[
  {
    "id": "1995-droga-krzyzowa-stacja-iv",
    "title": "Droga Krzyżowa - Stacja VIII",
    "titleEn": "Stations of the Cross - Station VIII",
    "titleFr": "Chemin de croix - Station VIII",
    "year": 1995,
    "imageUrl": "/attached_assets/droga.avif",
    "imageUrls": ["/attached_assets/droga.avif", "/attached_assets/1.avif"],
    "dimensions": "100 × 80 cm",
    "technique": "olej",
    "substrate": "canvas",
    "tags": ["sacred_art", "radom", "st_jadwiga_church", "mehoffer"],
    "dominantColor": "#5C3D2E",
    "description": "Jedna z 14 stacji Drogi Krzyżowej namalowanych dla kościoła św. Jadwigi Królowej w Radomiu. Praca wykonana w technice olejnej według wzorów Józefa Mehoffera.",
    "descriptionEn": "One of 14 Stations of the Cross painted for the church of St. Jadwiga the Queen in Radom. Work executed in oil technique following the patterns of Józef Mehoffer.",
    "descriptionFr": "Une des 14 stations du Chemin de croix peintes pour l'église de sainte Hedwige la Reine à Radom. Œuvre exécutée à l'huile selon les modèles de Józef Mehoffer.",
    "story": "Jedna z 14 stacji namalowanych dla parafii na Osiedlu Akademickim w Radomiu. Ten projekt był szczególnie ważny dla mojej twórczości sakralnej.",
    "storyEn": "One of 14 stations painted for the parish in the Academic Estate in Radom. This project was particularly important for my sacred art.",
    "storyFr": "Une des 14 stations peintes pour la paroisse du quartier académique de Radom. Ce projet était particulièrement important pour mon art sacré.",
    "available": 0
  },
  {
    "id": "2013-zamek-w-uniejowie",
    "title": "Zamek w Uniejowie",
    "titleEn": "Uniejów Castle",
    "titleFr": "Château d'Uniejów",
    "year": 2013,
    "imageUrl": "/attached_assets/13.avif",
    "imageUrls": ["/attached_assets/13.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "plein_air", "uniejow", "castle", "architecture"],
    "dominantColor": "#E8F4FD",
    "description": "Akwarela powstała podczas pamiętnego pobytu w Uniejowie w 2013 roku.",
    "descriptionEn": "A watercolor created during a memorable stay in Uniejów in 2013.",
    "descriptionFr": "Aquarelle créée lors d'un séjour mémorable à Uniejów en 2013.",
    "story": "Ten plener w Uniejowie był szczególnym doświadczeniem.",
    "storyEn": "This plein-air in Uniejów was a special experience.",
    "storyFr": "Ce plein-air à Uniejów était une expérience particulière.",
    "available": 1
  },
  {
    "id": "1980s-pejzaz-radomski",
    "title": "Pejzaż radomski",
    "titleEn": "Radom Landscape",
    "titleFr": "Paysage de Radom",
    "year": 2013,
    "imageUrl": "/attached_assets/12.avif",
    "imageUrls": ["/attached_assets/12.avif"],
    "dimensions": "60 × 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "radom", "hometown", "architecture"],
    "dominantColor": "#F0E6FF",
    "description": "Akwarela przedstawiająca charakterystyczny widok Radomia, miasta rodzinnego artysty. Praca wykonana z głębokim sentymentem do miejsca, które ukształtowało jego wrażliwość artystyczną.",
    "descriptionEn": "Watercolor depicting a characteristic view of Radom, the artist's hometown. Work executed with deep sentiment for the place that shaped his artistic sensitivity.",
    "descriptionFr": "Aquarelle représentant une vue caractéristique de Radom, ville natale de l'artiste. Œuvre exécutée avec un sentiment profond pour le lieu qui a façonné sa sensibilité artistique.",
    "story": "Radom to nie tylko moje miasto rodzinne, ale i źródło nieustannej inspiracji. Te prace powstały współcześnie, gdy odkrywałem piękno codziennych widoków mojego miasta.",
    "storyEn": "Radom is not only my hometown but also a source of constant inspiration. These works were created recently, as I was discovering the beauty of my city's everyday views.",
    "storyFr": "Radom n'est pas seulement ma ville natale, mais aussi une source d'inspiration constante. Ces œuvres ont été créées récemment, alors que je découvrais la beauté des vues quotidiennes de ma ville.",
    "available": 1
  },
  {
    "id": "1990s-kwiaty-polne",
    "title": "Kwiaty polne",
    "titleEn": "Wild Flowers",
    "titleFr": "Fleurs sauvages",
    "year": 2015,
    "imageUrl": "/attached_assets/6.avif",
    "imageUrls": ["/attached_assets/6.avif"],
    "dimensions": "50 × 35 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["nature", "flowers", "plein_air", "spring"],
    "dominantColor": "#FFE6D9",
    "description": "Delikatna kompozycja kwiatowa wykonana w plenerze. Artysta uchwycił niepowtarzalną świeżość wiosennych kwiatów polnych, wykorzystując technikę akwarelową do oddania ich naturalnej lekkości.",
    "descriptionEn": "Delicate floral composition executed en plein air. The artist captured the unique freshness of spring wildflowers, using watercolor technique to convey their natural lightness.",
    "descriptionFr": "Composition florale délicate exécutée en plein air. L'artiste a capturé la fraîcheur unique des fleurs sauvages printanières, utilisant la technique de l'aquarelle pour transmettre leur légèreté naturelle.",
    "story": "Podczas jednego z plenerów wiosennych zauważyłem tę piękną kompozycję kwiatów. Malowałem szybko, żeby złapać poranną rosę na płatkach.",
    "storyEn": "During one of the spring plein air sessions, I noticed this beautiful flower composition. I painted quickly to catch the morning dew on the petals.",
    "storyFr": "Lors d'une des sessions de plein air printanières, j'ai remarqué cette belle composition florale. J'ai peint rapidement pour saisir la rosée matinale sur les pétales.",
    "available": 0
  },
  {
    "id": "2000s-portret-studium",
    "title": "Studium portretu",
    "titleEn": "Portrait Study",
    "titleFr": "Étude de portrait",
    "year": 2005,
    "imageUrl": "/attached_assets/5.avif",
    "imageUrls": ["/attached_assets/5.avif"],
    "dimensions": "40 × 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["portrait", "study", "light", "shadow"],
    "dominantColor": "#E8F4FD",
    "description": "Studium portretowe koncentrujące się na grze światła i cienia na twarzy. Praca stanowi dowód mistrzowskiego opanowania techniki akwarelowej w oddawaniu ludzkiej ekspresji.",
    "descriptionEn": "Portrait study focusing on the play of light and shadow on the face. The work demonstrates masterful command of watercolor technique in rendering human expression.",
    "descriptionFr": "Étude de portrait se concentrant sur le jeu de lumière et d'ombre sur le visage. L'œuvre démontre une maîtrise magistrale de la technique de l'aquarelle dans le rendu de l'expression humaine.",
    "story": "To studium powstało podczas pracy nad większym portretem. Fascynuje mnie sposób, w jaki światło modeluje ludzką twarz i ujawnia emocje.",
    "storyEn": "This study was created while working on a larger portrait. I am fascinated by how light models the human face and reveals emotions.",
    "storyFr": "Cette étude a été créée en travaillant sur un portrait plus grand. Je suis fasciné par la façon dont la lumière modèle le visage humain et révèle les émotions.",
    "available": 1
  },
  {
    "id": "2010s-pejzaz-zimowy",
    "title": "Zimowy pejzaż",
    "titleEn": "Winter Landscape",
    "titleFr": "Paysage d'hiver",
    "year": 2015,
    "imageUrl": "/attached_assets/4.avif",
    "imageUrls": ["/attached_assets/4.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "winter", "snow", "tranquility"],
    "dominantColor": "#E8F4FD",
    "description": "Spokojna kompozycja zimowa ukazująca ciszę śnieżnego krajobrazu. Delikatne użycie białych i błękitnych tonów oddaje atmosferę zimowego poranka.",
    "descriptionEn": "Peaceful winter composition showing the silence of a snowy landscape. Delicate use of white and blue tones captures the atmosphere of a winter morning.",
    "descriptionFr": "Composition hivernale paisible montrant le silence d'un paysage enneigé. L'utilisation délicate de tons blancs et bleus capture l'atmosphère d'un matin d'hiver.",
    "story": "Tego zimowego ranka wstałem wcześnie, żeby złapać pierwsze światło na świeżym śniegu. Ciemność powoli ustępowała miejsca delikatnym błękitom.",
    "storyEn": "That winter morning I got up early to catch the first light on fresh snow. Darkness slowly gave way to delicate blues.",
    "storyFr": "Ce matin d'hiver, je me suis levé tôt pour saisir la première lumière sur la neige fraîche. L'obscurité a lentement cédé la place à des bleus délicats.",
    "available": 1
  },
  {
    "id": "2020-kazimierz-dolny",
    "title": "Plener w Kazimierzu Dolnym",
    "titleEn": "Plein Air in Kazimierz Dolny",
    "titleFr": "Plein Air à Kazimierz Dolny",
    "description": "To dzieło powstało podczas plenerów w Kazimierzu Dolnym. Artysta po raz pierwszy eksperymentował z nowymi technikami mieszania kolorów.",
    "descriptionEn": "This work was created during outdoor painting sessions in Kazimierz Dolny. The artist experimented with new color mixing techniques for the first time.",
    "descriptionFr": "Cette œuvre a été créée lors de séances de peinture en plein air à Kazimierz Dolny. L'artiste a expérimenté de nouvelles techniques de mélange de couleurs pour la première fois.",
    "imageUrl": "/attached_assets/8.avif",
    "imageUrls": ["/attached_assets/8.avif"],
    "year": 2011,
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "dimensions": "40x30 cm",
    "story": "To dzieło powstało podczas plenerów w Kazimierzu Dolnym. Artysta po raz pierwszy eksperymentował z nowymi technikami mieszania kolorów.",
    "storyEn": "This work was created during outdoor painting sessions in Kazimierz Dolny. The artist experimented with new color mixing techniques for the first time.",
    "storyFr": "Cette œuvre a été créée lors de séances de peinture en plein air à Kazimierz Dolny. L'artiste a expérimenté de nouvelles techniques de mélange de couleurs pour la première fois.",
    "tags": ["landscape", "plein_air", "experiment"],
    "available": 1
  },
  {
    "id": "1990-portret-starca",
    "title": "Portret starca",
    "titleEn": "Portrait of an Old Man",
    "titleFr": "Portrait d'un vieil homme",
    "description": "Studium charakteru wykonane ołówkiem. Subtelne odcienie oddają mądrość i doświadczenie życiowe modela.",
    "descriptionEn": "A character study in pencil. Subtle shades convey the wisdom and life experience of the model.",
    "descriptionFr": "Une étude de caractère réalisée au crayon. Des nuances subtiles transmettent la sagesse et l'expérience de vie du modèle.",
    "imageUrl": "/attached_assets/10.avif",
    "imageUrls": ["/attached_assets/10.avif"],
    "year": 1990,
    "technique": "ołówek",
    "substrate": "paper",
    "dimensions": "40x30 cm",
    "story": "Ten portret to studium charakteru i czasu zapisanego na twarzy. Zawsze fascynowały mnie historie, które można wyczytać ze zmarszczek i spojrzenia starszych osób. To była próba uchwycenia nie tyle fizycznego podobieństwa, co esencji przeżytego życia.",
    "storyEn": "This portrait is a study of character and time etched on a face. I've always been fascinated by the stories one can read in the wrinkles and gaze of older people. This was an attempt to capture not so much a physical likeness, but the essence of a life lived.",
    "storyFr": "Ce portrait est une étude du caractère et du temps gravé sur un visage. J'ai toujours été fasciné par les histoires que l'on peut lire dans les rides et le regard des personnes âgées. C'était une tentative de capturer non pas tant une ressemblance physique, mais l'essence d'une vie vécue.",
    "tags": ["portrait", "study", "pencil"],
    "available": 1
  },
  {
    "id": "6",
    "title": "Martwa natura",
    "titleEn": "Still Life",
    "titleFr": "Nature morte",
    "description": "Kompozycja martwej natury ze słonecznikami. Artysta uchwycił grę światła na powierzchniach kwiatów, tworząc realistyczny efekt.",
    "descriptionEn": "Still life composition with sunflowers. The artist captured the play of light on the surfaces of the flowers, creating a realistic effect.",
    "descriptionFr": "Composition de nature morte avec des tournesols. L'artiste a capturé le jeu de la lumière sur la surface des fleurs, créant un effet réaliste.",
    "imageUrl": "/attached_assets/3.avif",
    "imageUrls": ["/attached_assets/3.avif"],
    "year": 2010,
    "technique": "olej",
    "substrate": "canvas",
    "dimensions": "112x90 cm",
    "story": "To dzieło powstało podczas plenerów w Kazimierzu Dolnym. Artysta po raz pierwszy eksperymentował z nowymi technikami mieszania kolorów.",
    "storyEn": "This work was created during outdoor painting sessions in Kazimierz Dolny. The artist experimented with new color mixing techniques for the first time.",
    "storyFr": "Cette œuvre a été créée lors de séances de peinture en plein air à Kazimierz Dolny. L'artiste a expérimenté de nouvelles techniques de mélange de couleurs pour la première fois.",
    "tags": ["nature", "flowers", "still_life"],
    "available": 1
  },
  {
    "id": "2012-chalupa-z-jaroslawia",
    "title": "Chałupa z Jarosławia",
    "titleEn": "Cottage from Jarosław",
    "titleFr": "Chaumière de Jarosław",
    "year": 2012,
    "imageUrl": "/attached_assets/14.avif",
    "imageUrls": ["/attached_assets/14.avif"],
    "dimensions": "40 × 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "architecture", "rural", "cottage", "jaroslaw"],
    "dominantColor": "#C8A97E",
    "description": "Akwarela 'Chałupa z Jarosławia' z 2012 roku. Dzieło zostało namalowane na podstawie szkicu artysty ze starego szkicownika z 1974 roku, co nadaje mu unikalny, historyczny wymiar.",
    "descriptionEn": "Watercolor 'Cottage from Jarosław' from 2012. The work was painted based on the artist's sketch from an old sketchbook from 1974, which gives it a unique, historical dimension.",
    "descriptionFr": "Aquarelle 'Chaumière de Jarosław' de 2012. L'œuvre a été peinte d'après un croquis de l'artiste d'un ancien carnet de croquis de 1974, ce qui lui confère une dimension historique unique.",
    "story": "Ta praca ma dla mnie szczególne znaczenie. Powstała na podstawie jednego z moich starych szkiców z 1974 roku, odkrytego po latach. To sentymentalny powrót do motywów z wczesnego okresu mojej twórczości.",
    "storyEn": "This work has a special meaning for me. It was created based on one of my old sketches from 1974, rediscovered after many years. It is a sentimental return to the motifs of my early work.",
    "storyFr": "Cette œuvre a une signification particulière pour moi. Elle a été créée à partir d'une de mes anciennes esquisses de 1974, redécouverte après de nombreuses années. C'est un retour sentimental aux motifs de mes débuts.",
    "available": 1
  },
  {
    "id": "2012-konie-ii",
    "title": "Konie II",
    "titleEn": "Horses II",
    "titleFr": "Chevaux II",
    "year": 2012,
    "imageUrl": "/attached_assets/15.avif",
    "imageUrls": ["/attached_assets/15.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["animals", "horses", "nature", "dynamic", "study"],
    "dominantColor": "#D4C6B5",
    "description": "Dynamiczna kompozycja przedstawiająca trzy konie w swobodnym ruchu. Artysta za pomocą techniki akwareli uchwycił energię i siłę zwierząt. Gra światła na ich sierści oraz subtelne, rozmyte tło nadają pracy ekspresyjny i lekki charakter.",
    "descriptionEn": "A dynamic composition depicting three horses in free motion. The artist used the watercolor technique to capture the energy and strength of the animals. The play of light on their coats and the subtle, blurred background give the work an expressive and light character.",
    "descriptionFr": "Une composition dynamique représentant trois chevaux en mouvement libre. L'artiste a utilisé la technique de l'aquarelle pour capturer l'énergie et la force des animaux. Le jeu de lumière sur leur pelage et l'arrière-plan subtil et flou donnent à l'œuvre un caractère expressif et léger.",
    "story": "Konie od zawsze były dla mnie symbolem nieokiełznanej wolności i siły. W tej pracy starałem się oddać nie tyle ich dokładny, anatomiczny wygląd, co energię i dynamikę stada w ruchu. To studium potęgi i piękna natury.",
    "storyEn": "Horses have always been a symbol of untamed freedom and strength for me. In this work, I tried to capture not so much their exact, anatomical appearance, but the energy and dynamics of a herd in motion. It is a study of the power and beauty of nature.",
    "storyFr": "Les chevaux ont toujours été pour moi un symbole de liberté et de force indomptées. Dans cette œuvre, j'ai essayé de capturer non pas tant leur apparence anatomique exacte, mais l'énergie et la dynamique d'un troupeau en mouvement. C'est une étude de la puissance et de la beauté de la nature.",
    "available": 1
  },
  {
    "id": "2009-stara-chalupa",
    "title": "Stara chałupa",
    "titleEn": "Old Cottage",
    "titleFr": "Vieille Chaumière",
    "year": 2009,
    "imageUrl": "/attached_assets/16.avif",
    "imageUrls": ["/attached_assets/16.avif"],
    "dimensions": "60 × 45 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "architecture", "rural", "cottage", "kazanow"],
    "dominantColor": "#8B8D7A",
    "description": "Akwarela z 2009 roku przedstawiająca starą, błękitną chałupę krytą strzechą w miejscowości Zakrzówek (gmina Kazanów). Obraz oddaje urok i nostalgię odchodzącej w przeszłość architektury wiejskiej.",
    "descriptionEn": "A 2009 watercolor depicting an old, blue, thatched-roof cottage in Zakrzówek (Kazanów municipality). The painting captures the charm and nostalgia of vanishing rural architecture.",
    "descriptionFr": "Aquarelle de 2009 représentant une vieille chaumière bleue au toit de chaume à Zakrzówek (commune de Kazanów). La peinture capture le charme et la nostalgie de l'architecture rurale en voie de disparition.",
    "story": "Urzekła mnie historia tego miejsca. Ta chałupa, choć naznaczona upływem czasu, wciąż opowiadała historie minionych pokoleń. Chciałem uchwycić ten moment, zanim wspomnienie o niej zniknie na zawsze.",
    "storyEn": "I was captivated by the history of this place. This cottage, though marked by the passage of time, still told the stories of past generations. I wanted to capture this moment before its memory disappears forever.",
    "storyFr": "J'ai été captivé par l'histoire de ce lieu. Cette chaumière, bien que marquée par le temps, racontait encore les histoires des générations passées. Je voulais capturer ce moment avant que son souvenir ne disparaisse à jamais.",
    "available": 1
  },
  {
    "id": "2013-drukarnia-radom",
    "title": "Drukarnia Trzebińskiego",
    "titleEn": "Trzebiński's Printing House",
    "titleFr": "Imprimerie de Trzebiński",
    "year": 2013,
    "imageUrl": "/attached_assets/17.avif",
    "imageUrls": ["/attached_assets/17.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["architecture", "radom", "hometown", "city", "printing_house"],
    "dominantColor": "#D9A48F",
    "description": "Akwarela z 2013 roku ukazująca zabytkową drukarnię Jana Kantego Trzebińskiego, mieszczącą się w podwórku kamienicy przy ul. Żeromskiego 28 w Radomiu. Praca oddaje historyczny klimat tego miejsca, z jego charakterystyczną ceglaną architekturą i brukowanym dziedzińcem.",
    "descriptionEn": "A 2013 watercolor depicting the historic Jan Kanty Trzebiński printing house, located in the courtyard of the tenement house at 28 Żeromskiego Street in Radom. The work captures the historical atmosphere of this place, with its characteristic brick architecture and cobbled courtyard.",
    "descriptionFr": "Aquarelle de 2013 représentant l'imprimerie historique de Jan Kanty Trzebiński, située dans la cour de l'immeuble au 28, rue Żeromskiego à Radom. L'œuvre capture l'atmosphère historique de ce lieu, avec son architecture en briques caractéristique et sa cour pavée.",
    "story": "Podwórka radomskich kamienic kryją w sobie prawdziwe perełki. Drukarnia Trzebińskiego to jedno z tych miejsc, które zatrzymało czas. Malując tę scenę, chciałem zachować wspomnienie o rzemieślniczej tradycji Radomia i pięknie detali architektonicznych, które często umykają w codziennym pośpiechu.",
    "storyEn": "The courtyards of Radom's tenement houses hide real gems. The Trzebiński's Printing House is one of those places where time has stood still. By painting this scene, I wanted to preserve the memory of Radom's craft tradition and the beauty of architectural details that often go unnoticed in the daily rush.",
    "storyFr": "Les cours des immeubles de Radom cachent de véritables joyaux. L'imprimerie de Trzebiński est l'un de ces endroits où le temps s'est arrêté. En peignant cette scène, j'ai voulu préserver le souvenir de la tradition artisanale de Radom et la beauté des détails architecturaux qui passent souvent inaperçus dans la précipitation quotidienne.",
    "available": 1
  },
  {
    "id": "2014-dawny-bank-nbp-radom",
    "title": "Dawny budynek Banku NBP - Radom",
    "titleEn": "Former NBP Bank Building - Radom",
    "titleFr": "Ancien bâtiment de la banque NBP - Radom",
    "year": 2014,
    "imageUrl": "/attached_assets/18.avif",
    "imageUrls": ["/attached_assets/18.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["architecture", "radom", "hometown", "city", "bank"],
    "dominantColor": "#E5D9D2",
    "description": "Akwarela z 2014 roku przedstawiająca dawny budynek Narodowego Banku Polskiego przy ulicy Żeromskiego 43 w Radomiu. Obraz ukazuje klasycystyczną architekturę gmachu w słoneczny dzień, z charakterystyczną kopułą i tętniącym życiem placem.",
    "descriptionEn": "A 2014 watercolor depicting the former building of the National Bank of Poland at 43 Żeromskiego Street in Radom. The painting shows the classicist architecture of the building on a sunny day, with its characteristic dome and a bustling square.",
    "descriptionFr": "Aquarelle de 2014 représentant l'ancien bâtiment de la Banque Nationale de Pologne au 43, rue Żeromskiego à Radom. La peinture montre l'architecture classiciste du bâtiment par une journée ensoleillée, avec son dôme caractéristique et une place animée.",
    "story": "Ten budynek to jeden z najbardziej reprezentacyjnych obiektów w Radomiu. Zawsze podziwiałem jego monumentalną bryłę i klasyczne proporcje. Chciałem uchwycić grę światła na fasadzie i oddać atmosferę tego ważnego punktu na mapie miasta.",
    "storyEn": "This building is one of the most representative structures in Radom. I have always admired its monumental form and classical proportions. I wanted to capture the play of light on the facade and convey the atmosphere of this important point on the city map.",
    "storyFr": "Ce bâtiment est l'une des structures les plus représentatives de Radom. J'ai toujours admiré sa forme monumentale et ses proportions classiques. Je voulais capturer le jeu de la lumière sur la façade et transmettre l'atmosphère de ce point important sur la carte de la ville.",
    "available": 1
  },
  {
    "id": "2014-prezydium-rady-miejskiej-radom",
    "title": "Budynek Prezydium Rady Miejskiej - Radom",
    "titleEn": "City Hall Building - Radom",
    "titleFr": "Hôtel de Ville - Radom",
    "year": 2014,
    "imageUrl": "/attached_assets/19.avif",
    "imageUrls": ["/attached_assets/19.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "radom",
      "hometown",
      "city",
      "corazzi",
      "city_hall"
    ],
    "dominantColor": "#EFEBE0",
    "description": "Akwarela z 2014 roku przedstawiająca monumentalny gmach Urzędu Miejskiego w Radomiu. Dzieło ukazuje klasycystyczną fasadę budynku, zaprojektowaną przez słynnego architekta Antonio Corazziego, w otoczeniu zieleni i z postaciami na placu, co dodaje scenie życia.",
    "descriptionEn": "A 2014 watercolor depicting the monumental building of the City Hall in Radom. The work shows the classicist facade of the building, designed by the famous architect Antonio Corazzi, surrounded by greenery and with figures in the square, which adds life to the scene.",
    "descriptionFr": "Aquarelle de 2014 représentant le bâtiment monumental de l'Hôtel de Ville de Radom. L'œuvre montre la façade classiciste du bâtiment, conçue par le célèbre architecte Antonio Corazzi, entourée de verdure et avec des personnages sur la place, ce qui anime la scène.",
    "story": "Pałac Rządowy to serce Radomia i perła architektury Corazziego. Malowanie go było wyzwaniem ze względu na złożoność detali i kolumnady. Chciałem uchwycić nie tylko architekturę, ale i atmosferę tego miejsca, które jest świadkiem historii miasta i codziennego życia jego mieszkańców.",
    "storyEn": "The Governor's Palace is the heart of Radom and a pearl of Corazzi's architecture. Painting it was a challenge due to the complexity of the details and the colonnade. I wanted to capture not only the architecture but also the atmosphere of this place, which witnesses the city's history and the daily life of its inhabitants.",
    "storyFr": "Le Palais du Gouverneur est le cœur de Radom et une perle de l'architecture de Corazzi. Le peindre était un défi en raison de la complexité des détails et de la colonnade. Je voulais capturer non seulement l'architecture mais aussi l'atmosphère de ce lieu, qui est témoin de l'histoire de la ville et de la vie quotidienne de ses habitants.",
    "available": 1
  },
  {
    "id": "2004-tyniec-latem",
    "title": "Tyniec latem",
    "titleEn": "Tyniec in Summer",
    "titleFr": "Tyniec en été",
    "year": 2004,
    "imageUrl": "/attached_assets/20.avif",
    "imageUrls": ["/attached_assets/20.avif"],
    "dimensions": "70 × 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "architecture",
      "sacred_art",
      "water",
      "summer",
      "tyniec",
      "reflection"
    ],
    "dominantColor": "#7E7A67",
    "description": "Akwarela z 2004 roku przedstawiająca Opactwo Benedyktynów w Tyńcu, malowniczo położone na wapiennym wzgórzu nad Wisłą. Obraz oddaje letnią atmosferę, z bujną zielenią i odbiciem klasztoru w spokojnej tafli wody.",
    "descriptionEn": "A 2004 watercolor depicting the Benedictine Abbey in Tyniec, picturesquely situated on a limestone hill above the Vistula River. The painting captures the summer atmosphere, with lush greenery and the reflection of the monastery in the calm water surface.",
    "descriptionFr": "Aquarelle de 2004 représentant l'abbaye bénédictine de Tyniec, pittoresquement située sur une colline de calcaire au-dessus de la Vistule. La peinture capture l'atmosphère estivale, avec une végétation luxuriante et le reflet du monastère à la surface calme de l'eau.",
    "story": "Tyniec to miejsce niezwykłe, które wielokrotnie malowałem. Tego letniego dnia urzekła mnie gra światła na wodzie i majestat starych murów opactwa. Starałem się oddać spokój i harmonię tego krajobrazu, gdzie historia spotyka się z naturą.",
    "storyEn": "Tyniec is a special place that I have painted many times. On this summer day, I was captivated by the play of light on the water and the majesty of the old abbey walls. I tried to convey the peace and harmony of this landscape, where history meets nature.",
    "storyFr": "Tyniec est un lieu unique que j'ai peint à de nombreuses reprises. En cette journée d'été, j'ai été captivé par le jeu de la lumière sur l'eau et la majesté des vieux murs de l'abbaye. J'ai essayé de transmettre la paix et l'harmonie de ce paysage, où l'histoire rencontre la nature.",
    "available": 1
  },
  {
    "id": "2016-ilzanka-ruda",
    "title": "Iłżanka z mostu pod prąd - Ruda",
    "titleEn": "Iłżanka River from the Bridge, Upstream - Ruda",
    "titleFr": "L'Iłżanka depuis le pont, en amont - Ruda",
    "year": 2016,
    "imageUrl": "/attached_assets/21.avif",
    "imageUrls": ["/attached_assets/21.avif"],
    "dimensions": "50 x 35 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "water",
      "autumn",
      "trees",
      "reflection",
      "ilzanka",
      "ruda"
    ],
    "dominantColor": "#A67944",
    "description": "Akwarela z 2016 roku przedstawiająca rzekę Iłżankę w miejscowości Ruda, widzianą z mostu w kierunku pod prąd. Artysta uchwycił bogactwo jesiennych barw lasu i ich dynamiczne odbicie w wodzie.",
    "descriptionEn": "A 2016 watercolor depicting the Iłżanka River in the village of Ruda, seen from the bridge looking upstream. The artist captured the richness of the autumn colors of the forest and their dynamic reflection in the water.",
    "descriptionFr": "Aquarelle de 2016 représentant la rivière Iłżanka dans le village de Ruda, vue depuis le pont en amont. L'artiste a capturé la richesse des couleurs automnales de la forêt et leur reflet dynamique dans l'eau.",
    "story": "Jesień nad Iłżanką zawsze oferuje spektakl kolorów. Stojąc na moście w Rudzie, byłem zahipnotyzowany tym, jak woda zwielokrotniała paletę barw lasu. To była próba uchwycenia nie tylko widoku, ale i ulotnego wrażenia wibracji kolorów na powierzchni rzeki.",
    "storyEn": "Autumn by the Iłżanka River always offers a spectacle of colors. Standing on the bridge in Ruda, I was mesmerized by how the water multiplied the forest's color palette. It was an attempt to capture not just the view, but the fleeting impression of vibrating colors on the river's surface.",
    "storyFr": "L'automne au bord de la rivière Iłżanka offre toujours un spectacle de couleurs. Debout sur le pont à Ruda, j'ai été fasciné par la façon dont l'eau multipliait la palette de couleurs de la forêt. C'était une tentative de capturer non seulement la vue, mais aussi l'impression fugitive de couleurs vibrantes à la surface de la rivière.",
    "available": 1
  },
  {
    "id": "2016-jesienny-pejzaz-wierzby",
    "title": "Jesienny pejzaż z wierzbami",
    "titleEn": "Autumn Landscape with Willows",
    "titleFr": "Paysage d'automne avec des saules",
    "year": 2016,
    "imageUrl": "/attached_assets/22.avif",
    "imageUrls": ["/attached_assets/22.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "autumn",
      "trees",
      "light",
      "shadow",
      "rural",
      "willows"
    ],
    "dominantColor": "#A98E5B",
    "description": "Akwarela z 2016 roku przedstawiająca wiejską drogę w jesiennej scenerii. Obraz koncentruje się na grze światła i cienia, rzucanych przez stare, bezlistne wierzby. Ciepłe barwy jesieni i niskie słońce tworzą nostalgiczny, spokojny nastrój.",
    "descriptionEn": "A 2016 watercolor depicting a country road in an autumn setting. The painting focuses on the play of light and shadow cast by old, leafless willows. The warm colors of autumn and the low sun create a nostalgic, peaceful mood.",
    "descriptionFr": "Aquarelle de 2016 représentant un chemin de campagne dans un décor d'automne. La peinture se concentre sur le jeu de lumière et d'ombre projeté par de vieux saules sans feuilles. Les couleurs chaudes de l'automne et le soleil bas créent une ambiance nostalgique et paisible.",
    "story": "Wierzby to drzewa o niezwykłym charakterze, które od zawsze mnie inspirują. W tym pejzażu chciałem uchwycić urok jesiennego popołudnia, kiedy słońce stoi nisko, a cienie stają się długie i wyraziste. To właśnie one, a nie same drzewa, są głównymi bohaterami tej pracy.",
    "storyEn": "Willows are trees with a unique character that have always inspired me. In this landscape, I wanted to capture the charm of an autumn afternoon, when the sun is low and the shadows become long and expressive. It is them, not the trees themselves, that are the main subjects of this work.",
    "storyFr": "Les saules sont des arbres au caractère unique qui m'ont toujours inspiré. Dans ce paysage, je voulais capturer le charme d'un après-midi d'automne, lorsque le soleil est bas et que les ombres deviennent longues et expressives. Ce sont elles, et non les arbres eux-mêmes, qui sont les principaux sujets de cette œuvre.",
    "available": 1
  },
  {
    "id": "2018-synagoga-ciepielow",
    "title": "Synagoga w Ciepielowie",
    "titleEn": "Synagogue in Ciepielów",
    "titleFr": "Synagogue de Ciepielów",
    "year": 2018,
    "imageUrl": "/attached_assets/23.avif",
    "imageUrls": ["/attached_assets/23.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "ruins",
      "ciepielow",
      "summer",
      "light",
      "shadow"
    ],
    "dominantColor": "#B96746",
    "description": "Akwarela z 2018 roku przedstawiająca ruiny synagogi w Ciepielowie. Praca ukazuje ceglaną budowlę z charakterystycznymi kolumnami i arkadami, otoczoną bujną letnią zielenią. Artysta uchwycił grę światła i cienia, podkreślającą upływ czasu i nostalgiczną atmosferę tego historycznego miejsca.",
    "descriptionEn": "A 2018 watercolor depicting the ruins of the synagogue in Ciepielów. The work shows the brick structure with its characteristic columns and arcades, surrounded by lush summer greenery. The artist has captured the play of light and shadow, emphasizing the passage of time and the nostalgic atmosphere of this historic place.",
    "descriptionFr": "Aquarelle de 2018 représentant les ruines de la synagogue de Ciepielów. L'œuvre montre la structure en briques avec ses colonnes et arcades caractéristiques, entourée d'une verdure estivale luxuriante. L'artiste a capturé le jeu de la lumière et de l'ombre, soulignant le passage du temps et l'atmosphère nostalgique de ce lieu historique.",
    "story": "Ruiny mają w sobie niezwykłą moc opowiadania historii. Synagoga w Ciepielowie, choć zniszczona, wciąż emanuje godnością. Malując ją, chciałem oddać hołd pamięci i pokazać, jak natura powoli otula i przejmuje dzieło człowieka, tworząc poruszający obraz przemijania.",
    "storyEn": "Ruins have an extraordinary power to tell stories. The synagogue in Ciepielów, though destroyed, still exudes dignity. By painting it, I wanted to pay homage to memory and show how nature slowly embraces and takes over human creation, creating a moving picture of transience.",
    "storyFr": "Les ruines ont un pouvoir extraordinaire pour raconter des histoires. La synagogue de Ciepielów, bien que détruite, dégage encore de la dignité. En la peignant, j'ai voulu rendre hommage à la mémoire et montrer comment la nature embrasse et reprend lentement la création humaine, créant une image émouvante de l'éphémère.",
    "available": 1
  },
  {
    "id": "1992-gospodarstwo-sobolewskiego",
    "title": "Gospodarstwo pana Sobolewskiego na ul. Gołębiowskiej",
    "titleEn": "Mr. Sobolewski's Farm on Gołębiowska Street",
    "titleFr": "La ferme de M. Sobolewski, rue Gołębiowska",
    "year": 1992,
    "imageUrl": "/attached_assets/24.avif",
    "imageUrls": ["/attached_assets/24.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "rural",
      "radom",
      "hometown",
      "architecture",
      "cottage",
      "golebiow"
    ],
    "dominantColor": "#DEDACF",
    "description": "Akwarela z 1992 roku, namalowana z balkonu, przedstawia dawne gospodarstwo pana Sobolewskiego przy ulicy Gołębiowskiej w Radomiu. Obraz jest dokumentacją krajobrazu po tym, jak spłonęła stodoła, która niegdyś stała na pierwszym planie. Dzieło ukazuje więc przestrzeń naznaczoną zmianą i upływem czasu.",
    "descriptionEn": "A 1992 watercolor, painted from a balcony, depicts the former farm of Mr. Sobolewski on Gołębiowska Street in Radom. The painting documents the landscape after the barn, which once stood in the foreground, burned down. The work thus shows a space marked by change and the passage of time.",
    "descriptionFr": "Aquarelle de 1992, peinte depuis un balcon, représentant l'ancienne ferme de M. Sobolewski, rue Gołębiowska à Radom. La peinture documente le paysage après l'incendie de la grange qui se trouvait autrefois au premier plan. L'œuvre montre ainsi un espace marqué par le changement et le passage du temps.",
    "story": "Ten obraz to sentymentalne spojrzenie na fragment Radomia, który na moich oczach ulegał przemianom. Przez lata na pierwszym planie tego widoku stała duża stodoła. Po tym, jak spłonęła, krajobraz z mojego balkonu całkowicie się zmienił. Postanowiłem namalować ten nowy stan rzeczy – przestrzeń, która pozostała, i budynki w tle. Akwarela jest więc zapisem miejsca naznaczonego utratą i świadectwem nieustannych zmian w tkance miejskiej.",
    "storyEn": "This painting is a sentimental look at a part of Radom that was transforming before my eyes. For years, a large barn stood in the foreground of this view. After it burned down, the landscape from my balcony changed completely. I decided to paint this new reality—the space that remained and the buildings in the background. The watercolor is therefore a record of a place marked by loss and a testament to the constant changes in the urban fabric.",
    "storyFr": "Cette peinture est un regard sentimental sur une partie de Radom qui se transformait sous mes yeux. Pendant des années, une grande grange se dressait au premier plan de cette vue. Après son incendie, le paysage depuis mon balcon a complètement changé. J'ai décidé de peindre cette nouvelle réalité – l'espace qui restait et les bâtiments en arrière-plan. L'aquarelle est donc le témoignage d'un lieu marqué par la perte et une preuve des changements constants dans le tissu urbain.",
    "available": 1
  },
  {
    "id": "2025-mlynarska-4-radom",
    "title": "Radom ul. Młynarska 4, budynek pożydowski",
    "titleEn": "Radom, 4 Młynarska Street, Former Jewish Building",
    "titleFr": "Radom, 4 rue Młynarska, Ancien bâtiment juif",
    "year": 2025,
    "imageUrl": "/attached_assets/25.avif",
    "imageUrls": ["/attached_assets/25.avif"],
    "dimensions": "32 x 24 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "architecture",
      "city",
      "jewish_heritage",
      "mlynarska_street"
    ],
    "dominantColor": "#E6B939",
    "description": "Akwarela z 2025 roku przedstawia zabytkowy, pożydowski budynek przy ulicy Młynarskiej 4 w Radomiu. Praca, namalowana na ręcznie czerpanym papierze Art Deco (300 g/m²) farbami 'Białe Noce', ukazuje charakterystyczną, żółtą fasadę kamienicy w słoneczny, wczesnowiosenny dzień.",
    "descriptionEn": "This 2025 watercolor depicts the historic former Jewish building at 4 Młynarska Street in Radom. The work, painted on handmade Art Deco paper (300 g/m²) with 'White Nights' paints, shows the characteristic yellow facade of the tenement house on a sunny, early spring day.",
    "descriptionFr": "Cette aquarelle de 2025 représente l'ancien bâtiment juif historique au 4, rue Młynarska à Radom. L'œuvre, peinte sur du papier Art déco fait main (300 g/m²) avec des peintures 'Nuits Blanches', montre la façade jaune caractéristique de l'immeuble par une journée ensoleillée de début de printemps.",
    "story": "Ulica Młynarska to miejsce pełne historii, a ta kamienica jest jednym z jej cichych świadków. Chciałem uchwycić jej piękno i charakter, zanim zostanie zapomniana lub bezpowrotnie zmieniona. Słoneczne światło tego dnia wydobyło z murów niezwykłą energię i ciepło, tworząc kontrast między przeszłością a tętniącym życiem miastem.",
    "storyEn": "Młynarska Street is a place full of history, and this tenement is one of its silent witnesses. I wanted to capture its beauty and character before it is forgotten or irrevocably changed. The sunlight on that day brought out an extraordinary energy and warmth from the walls, creating a contrast between the past and the bustling city.",
    "storyFr": "La rue Młynarska est un lieu chargé d'histoire, et cet immeuble en est l'un de ses témoins silencieux. Je voulais capturer sa beauté et son caractère avant qu'il ne soit oublié ou changé à jamais. La lumière du soleil ce jour-là a fait ressortir une énergie et une chaleur extraordinaires des murs, créant un contraste entre le passé et la ville animée.",
    "available": 1
  },
  {
    "id": "2023-klasztor-bernardynow",
    "title": "Klasztor Bernardynów",
    "titleEn": "Bernardine Monastery",
    "titleFr": "Monastère des Bernardins",
    "year": 2023,
    "imageUrl": "/attached_assets/26.avif",
    "imageUrls": ["/attached_assets/26.avif"],
    "dimensions": "70 x 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "sacred_art",
      "architecture",
      "gothic",
      "monastery",
      "landscape",
      "summer"
    ],
    "dominantColor": "#D1603D",
    "description": "Akwarela z 2023 roku przedstawiająca monumentalny Klasztor Bernardynów. Obraz charakteryzuje się żywą kolorystyką, oddającą grę słońca na gotyckiej, ceglanej fasadzie. Artysta z dbałością o detal ukazał bogactwo architektoniczne budowli.",
    "descriptionEn": "A 2023 watercolor depicting the monumental Bernardine Monastery. The painting is characterized by vibrant colors, capturing the play of sunlight on the Gothic brick facade. The artist has rendered the architectural richness of the building with great attention to detail.",
    "descriptionFr": "Aquarelle de 2023 représentant le monumental monastère des Bernardins. La peinture se caractérise par des couleurs vives, capturant le jeu de la lumière du soleil sur la façade gothique en briques. L'artiste a rendu la richesse architecturale du bâtiment avec une grande attention aux détails.",
    "story": "Architektura gotycka to dla malarza zawsze wielkie wyzwanie i źródło inspiracji. W tej pracy chciałem oddać nie tylko bryłę klasztoru, ale przede wszystkim jego kolor i fakturę w letnim słońcu. Ciepłe czerwienie i żółcienie cegły kontrastujące z błękitem nieba tworzą niezwykle malowniczy i radosny widok.",
    "storyEn": "Gothic architecture is always a great challenge and a source of inspiration for a painter. In this work, I wanted to convey not only the form of the monastery but above all its color and texture in the summer sun. The warm reds and yellows of the brick contrasting with the blue sky create an incredibly picturesque and joyful view.",
    "storyFr": "L'architecture gothique est toujours un grand défi et une source d'inspiration pour un peintre. Dans cette œuvre, je voulais transmettre non seulement la forme du monastère, mais surtout sa couleur et sa texture sous le soleil d'été. Les rouges et les jaunes chauds de la brique contrastant avec le bleu du ciel créent une vue incroyablement pittoresque et joyeuse.",
    "available": 1
  },
  {
    "id": "2024-zimowe-brzozy-iii",
    "title": "Zimowe brzozy (wersja III)",
    "titleEn": "Winter Birches (version III)",
    "titleFr": "Bouleaux d'hiver (version III)",
    "year": 2024,
    "imageUrl": "/attached_assets/27.avif",
    "imageUrls": ["/attached_assets/27.avif"],
    "dimensions": "15 x 15 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "trees",
      "birches",
      "miniature",
      "autumn"
    ],
    "dominantColor": "#A8B8C0",
    "description": "Miniaturowa akwarela (15x15 cm) z 2024 roku, trzecia wersja z serii 'Zimowe brzozy'. Praca namalowana na papierze Canson (300 g/m²) przedstawia kontrast między ośnieżonym pierwszym planem a ciepłymi, jesiennymi barwami w tle. Charakterystyczna kora brzóz stanowi centralny punkt kompozycji.",
    "descriptionEn": "A miniature watercolor (15x15 cm) from 2024, the third version from the 'Winter Birches' series. The work, painted on Canson paper (300 g/m²), presents a contrast between the snowy foreground and the warm, autumn colors in the background. The characteristic bark of the birch trees is the focal point of the composition.",
    "descriptionFr": "Aquarelle miniature (15x15 cm) de 2024, troisième version de la série 'Bouleaux d'hiver'. L'œuvre, peinte sur papier Canson (300 g/m²), présente un contraste entre le premier plan enneigé et les couleurs chaudes et automnales de l'arrière-plan. L'écorce caractéristique des bouleaux constitue le point central de la composition.",
    "story": "Ta miniatura to próba uchwycenia specyficznego momentu na przełomie pór roku, kiedy pierwsza warstwa śniegu spotyka się z ostatnimi ciepłymi barwami jesieni. Brzozy, ze swoją graficzną korą, są idealnymi modelkami do studiowania gry światła i koloru w zimowym pejzażu.",
    "storyEn": "This miniature is an attempt to capture a specific moment at the turn of the seasons, when the first layer of snow meets the last warm colors of autumn. The birches, with their graphic bark, are perfect models for studying the play of light and color in a winter landscape.",
    "storyFr": "Cette miniature est une tentative de capturer un moment spécifique au tournant des saisons, lorsque la première couche de neige rencontre les dernières couleurs chaudes de l'automne. Les bouleaux, avec leur écorce graphique, sont des modèles parfaits pour étudier le jeu de la lumière et de la couleur dans un paysage d'hiver.",
    "available": 1
  },
  {
    "id": "2024-czerwona-wies",
    "title": "Czerwona wieś",
    "titleEn": "Red Village",
    "titleFr": "Village Rouge",
    "year": 2024,
    "imageUrl": "/attached_assets/28.avif",
    "imageUrls": ["/attached_assets/28.avif"],
    "dimensions": "30 x 20 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "abstract",
      "experiment",
      "water",
      "reflection",
      "red_village"
    ],
    "dominantColor": "#5F8B8C",
    "description": "Ekspresyjna, niemal abstrakcyjna akwarela z 2024 roku. Artysta za pomocą syntetycznych plam barwnych buduje pejzaż, w którym horyzontalna, czerwona linia sugeruje zabudowania wsi odbijające się w wodzie. Praca jest studium koloru i nastroju, a nie dosłownym przedstawieniem rzeczywistości.",
    "descriptionEn": "An expressive, almost abstract watercolor from 2024. The artist uses synthetic color patches to build a landscape where a horizontal red line suggests village buildings reflected in the water. The work is a study of color and mood rather than a literal representation of reality.",
    "descriptionFr": "Aquarelle expressive, presque abstraite de 2024. L'artiste utilise des taches de couleur synthétiques pour construire un paysage où une ligne rouge horizontale suggère des bâtiments de village se reflétant dans l'eau. L'œuvre est une étude de la couleur et de l'atmosphère plutôt qu'une représentation littérale de la réalité.",
    "story": "Czasem pejzaż to nie konkretne miejsce, ale wrażenie, które po nim pozostaje. W tej pracy odszedłem od realizmu na rzecz emocji. Czerwień symbolizuje energię i życie wsi widzianej z daleka, a jej rozedrgane odbicie w wodzie to metafora wspomnienia. To malarstwo uczuć, nie faktów.",
    "storyEn": "Sometimes a landscape is not a specific place, but the impression it leaves behind. In this work, I moved away from realism in favor of emotion. The red symbolizes the energy and life of a village seen from a distance, and its trembling reflection in the water is a metaphor for a memory. This is a painting of feelings, not facts.",
    "storyFr": "Parfois, un paysage n'est pas un lieu spécifique, mais l'impression qu'il laisse. Dans cette œuvre, je me suis éloigné du réalisme au profit de l'émotion. Le rouge symbolise l'énergie et la vie d'un village vu de loin, et son reflet tremblant dans l'eau est une métaphore du souvenir. C'est une peinture de sentiments, pas de faits.",
    "available": 1
  },
  {
    "id": "2024-muzeum-gombrowicza-wsola",
    "title": "Muzeum Witolda Gombrowicza we Wsoli",
    "titleEn": "Witold Gombrowicz Museum in Wsola",
    "titleFr": "Musée Witold Gombrowicz à Wsola",
    "year": 2024,
    "imageUrl": "/attached_assets/29.avif",
    "imageUrls": ["/attached_assets/29.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "museum",
      "manor_house",
      "wsola",
      "gombrowicz",
      "landscape"
    ],
    "dominantColor": "#E3C96F",
    "description": "Akwarela z 2024 roku przedstawiająca pałac we Wsoli, w którym mieści się Muzeum Witolda Gombrowicza. Obraz ukazuje klasycystyczną bryłę budynku z charakterystyczną żółtą elewacją i czerwonym dachem, otoczoną parkową zielenią pod dynamicznym niebem.",
    "descriptionEn": "A 2024 watercolor depicting the palace in Wsola, which houses the Witold Gombrowicz Museum. The painting shows the classicist structure of the building with its characteristic yellow facade and red roof, surrounded by park greenery under a dynamic sky.",
    "descriptionFr": "Aquarelle de 2024 représentant le palais de Wsola, qui abrite le musée Witold Gombrowicz. Le tableau montre la structure classiciste du bâtiment avec sa façade jaune caractéristique et son toit rouge, entourée de la verdure du parc sous un ciel dynamique.",
    "story": "Wsola to miejsce o wyjątkowym klimacie, gdzie historia architektury spotyka się z historią wielkiej literatury. Malując ten pałac, starałem się uchwycić jego elegancką, harmonijną bryłę, ale też oddać atmosferę otaczającego go parku. To próba przeniesienia na papier nie tylko widoku, ale i ducha tego miejsca.",
    "storyEn": "Wsola is a place with a unique atmosphere, where the history of architecture meets the history of great literature. While painting this palace, I tried to capture its elegant, harmonious form, but also to convey the atmosphere of the surrounding park. It is an attempt to transfer not just the view, but the spirit of this place onto paper.",
    "storyFr": "Wsola est un lieu à l'atmosphère unique, où l'histoire de l'architecture rencontre l'histoire de la grande littérature. En peignant ce palais, j'ai essayé de capturer sa forme élégante et harmonieuse, mais aussi de transmettre l'atmosphère du parc environnant. C'est une tentative de transférer sur le papier non seulement la vue, mais aussi l'esprit de ce lieu.",
    "available": 1
  },
  {
    "id": "2023-kazimierz-dolny-rynek-rysunek",
    "title": "Kazimierz Dolny - Rynek",
    "titleEn": "Kazimierz Dolny - Market Square",
    "titleFr": "Kazimierz Dolny - Place du Marché",
    "year": 2023,
    "imageUrl": "/attached_assets/30.avif",
    "imageUrls": ["/attached_assets/30.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "długopis",
    "substrate": "paper",
    "tags": [
      "architecture",
      "city",
      "plein_air",
      "kazimierz_dolny",
      "sketch",
      "market_square"
    ],
    "dominantColor": "#2D2D2D",
    "description": "Dynamiczny szkic wykonany długopisem w 2023 roku, przedstawiający tętniący życiem Rynek w Kazimierzu Dolnym. Artysta za pomocą szybkiej, pewnej kreski uchwycił architekturę miasteczka, ruch turystów i niepowtarzalną atmosferę tego miejsca.",
    "descriptionEn": "A dynamic sketch made with a ballpoint pen in 2023, depicting the bustling Market Square in Kazimierz Dolny. The artist used quick, confident lines to capture the town's architecture, the movement of tourists, and the unique atmosphere of the place.",
    "descriptionFr": "Croquis dynamique réalisé au stylo à bille en 2023, représentant la place du marché animée de Kazimierz Dolny. L'artiste a utilisé des lignes rapides et assurées pour capturer l'architecture de la ville, le mouvement des touristes et l'atmosphère unique de l'endroit.",
    "story": "Kazimierz Dolny to niewyczerpane źródło inspiracji. Ten szkic powstał podczas jednego z wielu pobytów, jako próba szybkiego uchwycenia wrażenia chwili. Rysunek długopisem ma w sobie pewną surowość i bezpośredniość, która doskonale pasuje do oddania energii zatłoczonego Rynku.",
    "storyEn": "Kazimierz Dolny is an inexhaustible source of inspiration. This sketch was created during one of many stays, as an attempt to quickly capture the impression of the moment. A ballpoint pen drawing has a certain rawness and immediacy that is perfectly suited to conveying the energy of a crowded Market Square.",
    "storyFr": "Kazimierz Dolny est une source d'inspiration inépuisable. Ce croquis a été réalisé lors d'un de mes nombreux séjours, comme une tentative de capturer rapidement l'impression du moment. Un dessin au stylo à bille a une certaine crudité et une immédiateté qui conviennent parfaitement pour transmettre l'énergie d'une place du marché bondée.",
    "available": 1
  },
  {
    "id": "1993-ambona-dabrowa-kozlowska",
    "title": "Ambona w okolicach Dąbrowy Kozłowskiej",
    "titleEn": "Hunting Stand near Dąbrowa Kozłowska",
    "titleFr": "Poste de chasse près de Dąbrowa Kozłowska",
    "year": 1993,
    "imageUrl": "/attached_assets/31.avif",
    "imageUrls": ["/attached_assets/31.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "węgiel",
    "substrate": "paper",
    "tags": [
      "landscape",
      "forest",
      "nature",
      "sketch",
      "hunting_stand",
      "dabrowa_kozlowska"
    ],
    "dominantColor": "#525252",
    "description": "Rysunek węglem z 1993 roku przedstawiający ambonę myśliwską w leśnej scenerii w okolicach Dąbrowy Kozłowskiej. Praca charakteryzuje się dynamiczną kreską i kontrastem, typowym dla techniki węgla, co doskonale oddaje surowy klimat lasu.",
    "descriptionEn": "A charcoal drawing from 1993 depicting a hunting stand in a forest setting near Dąbrowa Kozłowska. The work is characterized by dynamic lines and contrast, typical of the charcoal technique, which perfectly captures the raw atmosphere of the forest.",
    "descriptionFr": "Dessin au fusain de 1993 représentant un poste de chasse dans un décor forestier près de Dąbrowa Kozłowska. L'œuvre se caractérise par des lignes dynamiques et un contraste, typiques de la technique du fusain, qui capturent parfaitement l'atmosphère brute de la forêt.",
    "story": "To jeden ze szkiców z mojego starego notatnika. Zawsze fascynowały mnie te samotne, drewniane konstrukcje w środku lasu. Mają w sobie pewną tajemnicę. Węgiel jako medium pozwolił mi szybko uchwycić grę światła i cienia na deskach ambony i otaczających ją drzewach.",
    "storyEn": "This is one of the sketches from my old notebook. I have always been fascinated by these solitary wooden structures in the middle of the forest. They have a certain mystery about them. Charcoal as a medium allowed me to quickly capture the play of light and shadow on the boards of the hunting stand and the surrounding trees.",
    "storyFr": "C'est l'un des croquis de mon vieux carnet. J'ai toujours été fasciné par ces structures en bois solitaires au milieu de la forêt. Elles ont un certain mystère. Le fusain comme médium m'a permis de capturer rapidement le jeu de la lumière et de l'ombre sur les planches du poste de chasse et les arbres environnants.",
    "available": 1
  },
  {
    "id": "2012-fragment-wsi-ruda",
    "title": "Fragment wsi Ruda",
    "titleEn": "A Glimpse of Ruda Village",
    "titleFr": "Un aperçu du village de Ruda",
    "year": 2012,
    "imageUrl": "/attached_assets/32.avif",
    "imageUrls": ["/attached_assets/32.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "rural",
      "ruda",
      "summer",
      "cottage",
      "nature",
      "animals"
    ],
    "dominantColor": "#B5B87E",
    "description": "Akwarela z 2012 roku, która w idylliczny sposób ukazuje fragment wsi Ruda. Obraz przedstawia tradycyjne, drewniane chałupy kryte strzechą, otoczone bujną zielenią w ciepły, letni dzień. Pasące się na trawie gęsi dodają scenie sielskiego charakteru.",
    "descriptionEn": "A 2012 watercolor that idyllically depicts a fragment of the village of Ruda. The painting shows traditional wooden, thatched-roof cottages surrounded by lush greenery on a warm summer day. Geese grazing on the grass add to the scene's rustic charm.",
    "descriptionFr": "Aquarelle de 2012 dépeignant de manière idyllique un fragment du village de Ruda. Le tableau montre des chaumières traditionnelles en bois au toit de chaume, entourées d'une verdure luxuriante par une chaude journée d'été. Les oies broutant l'herbe ajoutent au charme rustique de la scène.",
    "story": "To jedna z tych scen, które są esencją polskiej wsi. Spokój, harmonia, bliskość natury. Malując ten fragment Rudy, chciałem zatrzymać w kadrze ten beztroski, letni moment – grę cieni na soczystej trawie, ciepło drewna starych chałup i swobodę pasących się zwierząt.",
    "storyEn": "This is one of those scenes that are the essence of the Polish countryside. Peace, harmony, closeness to nature. In painting this fragment of Ruda, I wanted to capture that carefree summer moment – the play of shadows on the lush grass, the warmth of the old wooden cottages, and the freedom of the grazing animals.",
    "storyFr": "C'est une de ces scènes qui sont l'essence de la campagne polonaise. Paix, harmonie, proximité avec la nature. En peignant ce fragment de Ruda, je voulais capturer ce moment d'été insouciant – le jeu des ombres sur l'herbe luxuriante, la chaleur des vieilles chaumières en bois et la liberté des animaux en pâturage.",
    "available": 1
  },
  {
    "id": "2022-dom-w-szczawnicy",
    "title": "Dom w Szczawnicy",
    "titleEn": "House in Szczawnica",
    "titleFr": "Maison à Szczawnica",
    "year": 2022,
    "imageUrl": "/attached_assets/33.avif",
    "imageUrls": ["/attached_assets/33.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "mountains",
      "landscape",
      "szczawnica",
      "summer",
      "highlander_style"
    ],
    "dominantColor": "#D99E54",
    "description": "Akwarela z 2022 roku przedstawiająca okazały, drewniany dom w Szczawnicy, utrzymany w stylu góralskim. Praca oddaje słoneczną atmosferę letniego dnia w górach. Artysta z dbałością o detal ukazał misterną, drewnianą konstrukcję budynku i jego osadzenie w górzystym krajobrazie.",
    "descriptionEn": "A 2022 watercolor depicting a grand wooden house in Szczawnica, built in the highlander style. The work captures the sunny atmosphere of a summer day in the mountains. The artist, with attention to detail, portrayed the intricate wooden structure of the building and its setting in the mountainous landscape.",
    "descriptionFr": "Aquarelle de 2022 représentant une grande maison en bois à Szczawnica, construite dans le style montagnard. L'œuvre capture l'atmosphère ensoleillée d'une journée d'été à la montagne. L'artiste, avec le souci du détail, a dépeint la structure complexe en bois du bâtiment et son implantation dans le paysage montagneux.",
    "story": "Architektura góralska ma w sobie niepowtarzalny urok. Ten dom w Szczawnicy to doskonały przykład połączenia tradycji z nowoczesnością. Malując go, chciałem oddać ciepło drewna rozgrzanego w słońcu i harmonię, z jaką budynek wpisuje się w otaczającą go przyrodę. To pochwała dla kunsztu lokalnych cieśli.",
    "storyEn": "Highlander architecture has a unique charm. This house in Szczawnica is a perfect example of combining tradition with modernity. While painting it, I wanted to convey the warmth of the sun-heated wood and the harmony with which the building blends into the surrounding nature. It's a tribute to the craftsmanship of local carpenters.",
    "storyFr": "L'architecture montagnarde a un charme unique. Cette maison à Szczawnica est un parfait exemple de l'alliance de la tradition et de la modernité. En la peignant, j'ai voulu transmettre la chaleur du bois chauffé par le soleil et l'harmonie avec laquelle le bâtiment s'intègre dans la nature environnante. C'est un hommage au savoir-faire des charpentiers locaux.",
    "available": 1
  },
  {
    "id": "2020-kosciol-w-zlotoklosie",
    "title": "Kościół w Złotokłosie",
    "titleEn": "Church in Złotokłos",
    "titleFr": "Église de Złotokłos",
    "year": 2020,
    "imageUrl": "/attached_assets/34.avif",
    "imageUrls": ["/attached_assets/34.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "landscape",
      "summer",
      "trees",
      "church",
      "zlotoklos"
    ],
    "dominantColor": "#9A8C5A",
    "description": "Akwarela z 2020 roku przedstawiająca urokliwy, kameralny kościół w Złotokłosie. Praca ukazuje świątynię otuloną bujną, letnią zielenią, a ciepłe światło słońca podkreśla fakturę kamiennych murów i czerwień dachu.",
    "descriptionEn": "A 2020 watercolor depicting the charming, intimate church in Złotokłos. The work shows the temple enveloped in lush summer greenery, and the warm sunlight emphasizes the texture of the stone walls and the red of the roof.",
    "descriptionFr": "Aquarelle de 2020 représentant la charmante et intime église de Złotokłos. L'œuvre montre le temple enveloppé dans une verdure estivale luxuriante, et la chaude lumière du soleil souligne la texture des murs en pierre et le rouge du toit.",
    "story": "Są miejsca, które urzekają swoim spokojem i harmonią z otoczeniem. Kościół w Złotokłosie jest jednym z nich. Malując go, chciałem oddać atmosferę letniego popołudnia, kiedy światło przenikające przez liście drzew tworzy niezwykły spektakl na starych murach. To obraz o ciszy, wierze i pięknie ukrytym w naturze.",
    "storyEn": "There are places that captivate with their peace and harmony with their surroundings. The church in Złotokłos is one of them. While painting it, I wanted to capture the atmosphere of a summer afternoon, when the light filtering through the tree leaves creates a remarkable spectacle on the old walls. It is a painting about silence, faith, and the beauty hidden in nature.",
    "storyFr": "Il y a des endroits qui captivent par leur paix et leur harmonie avec leur environnement. L'église de Złotokłos en fait partie. En la peignant, je voulais capturer l'atmosphère d'un après-midi d'été, lorsque la lumière filtrant à travers les feuilles des arbres crée un spectacle remarquable sur les vieux murs. C'est une peinture sur le silence, la foi et la beauté cachée dans la nature.",
    "available": 1
  },
  {
    "id": "2017-wierzby-po-deszczu",
    "title": "Wierzby po deszczu",
    "titleEn": "Willows After the Rain",
    "titleFr": "Saules après la pluie",
    "year": 2017,
    "imageUrl": "/attached_assets/35.avif",
    "imageUrls": ["/attached_assets/35.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "trees",
      "willows",
      "water",
      "reflection",
      "spring"
    ],
    "dominantColor": "#7C9A46",
    "description": "Akwarela z 2017 roku przedstawia charakterystyczny dla polskiego krajobrazu widok - aleję starych wierzb stojących w wodzie po obfitym deszczu. Praca tętni życiem, a intensywna zieleń drzew i ich dynamiczne odbicia w wodzie tworzą pełen energii, wiosenny pejzaż.",
    "descriptionEn": "A 2017 watercolor depicting a characteristic view of the Polish landscape - an alley of old willows standing in water after a heavy rain. The work is full of life, and the intense green of the trees and their dynamic reflections in the water create an energetic, spring landscape.",
    "descriptionFr": "Aquarelle de 2017 représentant une vue caractéristique du paysage polonais - une allée de vieux saules dans l'eau après une forte pluie. L'œuvre est pleine de vie, et le vert intense des arbres et leurs reflets dynamiques dans l'eau créent un paysage printanier et énergique.",
    "story": "Wierzby to jeden z moich ulubionych tematów malarskich. W tej pracy chciałem uchwycić moment, gdy po deszczu cały świat wydaje się odświeżony i nasycony kolorem. Światło odbijające się od mokrej kory drzew i drgające refleksy w wodzie to detale, które nadają tej scenie niezwykłej malowniczości.",
    "storyEn": "Willows are one of my favorite painting subjects. In this work, I wanted to capture the moment when, after the rain, the whole world seems refreshed and saturated with color. The light reflecting off the wet bark of the trees and the shimmering reflections in the water are details that give this scene its extraordinary picturesqueness.",
    "storyFr": "Les saules sont l'un de mes sujets de peinture préférés. Dans cette œuvre, j'ai voulu capturer le moment où, après la pluie, le monde entier semble rafraîchi et saturé de couleurs. La lumière se reflétant sur l'écorce humide des arbres et les reflets chatoyants dans l'eau sont des détails qui confèrent à cette scène son caractère extraordinairement pittoresque.",
    "available": 1
  },
  {
    "id": "2022-radom-szewska",
    "title": "Radom. Fragment ul. Szewskiej",
    "titleEn": "Radom. A Glimpse of Szewska Street",
    "titleFr": "Radom. Un aperçu de la rue Szewska",
    "year": 2022,
    "imageUrl": "/attached_assets/36.avif",
    "imageUrls": ["/attached_assets/36.avif"],
    "dimensions": "19 x 13 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "architecture",
      "city",
      "miniature",
      "old_town",
      "szewska_street"
    ],
    "dominantColor": "#6B8B9B",
    "description": "Miniaturowa akwarela (19x13 cm) z 2022 roku, namalowana na papierze Canson (200 g/m²). Praca ukazuje fragment zabudowy przy ulicy Szewskiej w Radomiu, z widoczną w tle wieżą kościoła Farnego. Artysta za pomocą żywych kolorów i swobodnych pociągnięć pędzla oddał malowniczy, nieco tajemniczy charakter starego miasta.",
    "descriptionEn": "A miniature watercolor (19x13 cm) from 2022, painted on Canson paper (200 g/m²). The work shows a fragment of the buildings on Szewska Street in Radom, with the tower of the Parish Church visible in the background. The artist used vibrant colors and free brushstrokes to convey the picturesque, somewhat mysterious character of the old town.",
    "descriptionFr": "Aquarelle miniature (19x13 cm) de 2022, peinte sur papier Canson (200 g/m²). L'œuvre montre un fragment des bâtiments de la rue Szewska à Radom, avec la tour de l'église paroissiale visible en arrière-plan. L'artiste a utilisé des couleurs vives et des coups de pinceau libres pour transmettre le caractère pittoresque et quelque peu mystérieux de la vieille ville.",
    "story": "Zaułki Starego Miasta w Radomiu kryją wiele inspirujących widoków. Ten fragment ulicy Szewskiej, z jej odrapanymi tynkami i wieżą Fary wyłaniającą się zza dachów, ma w sobie niezwykłą poezję. To próba uchwycenia nastroju i kolorytu tego miejsca, jego historii zapisanej w murach.",
    "storyEn": "The alleys of Radom's Old Town hide many inspiring views. This fragment of Szewska Street, with its peeling plaster and the Parish Church tower emerging from behind the roofs, has an extraordinary poetry to it. This is an attempt to capture the mood and color of this place, its history written in the walls.",
    "storyFr": "Les ruelles de la vieille ville de Radom cachent de nombreuses vues inspirantes. Ce fragment de la rue Szewska, avec son plâtre écaillé et la tour de l'église paroissiale émergeant derrière les toits, a une poésie extraordinaire. C'est une tentative de capturer l'ambiance et la couleur de ce lieu, son histoire inscrite dans les murs.",
    "available": 1
  },
  {
    "id": "1987-wieliczka-klasztor-reformatow",
    "title": "Wieliczka - Klasztor Reformatów",
    "titleEn": "Wieliczka - Reformati Monastery",
    "titleFr": "Wieliczka - Monastère des Réformés",
    "year": 1987,
    "imageUrl": "/attached_assets/37.avif",
    "imageUrls": ["/attached_assets/37.avif"],
    "dimensions": "70 x 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "wieliczka",
      "architecture",
      "sacred_art",
      "monastery",
      "landscape",
      "plein_air"
    ],
    "dominantColor": "#D9C381",
    "description": "Akwarela z 1987 roku, namalowana podczas pleneru w Wieliczce. Obraz przedstawia zabytkowy Klasztor Franciszkanów Reformatów w ciepłym, nieco nostalgicznym świetle. Ujęcie z oddali pozwala ukazać bryłę klasztoru wtopioną w otaczającą zieleń.",
    "descriptionEn": "A watercolor from 1987, painted during a plein-air event in Wieliczka. The painting depicts the historic Reformati Franciscan Monastery in a warm, somewhat nostalgic light. The distant perspective allows the monastery's form to be shown nestled in the surrounding greenery.",
    "descriptionFr": "Aquarelle de 1987, peinte lors d'un plein air à Wieliczka. Le tableau représente l'historique monastère des Franciscains Réformés sous une lumière chaude et quelque peu nostalgique. La perspective lointaine permet de montrer la forme du monastère nichée dans la verdure environnante.",
    "story": "Ten obraz powstał podczas pamiętnego pleneru w Wieliczce, zorganizowanego w celu ratowania Kopalni Soli. Panowała tam niezwykła atmosfera, a praca twórcza przeplatała się ze świadomością ważnego celu. Klasztor Reformatów, ze swoją spokojną i dostojną architekturą, był jednym z motywów, które wtedy uwieczniłem.",
    "storyEn": "This painting was created during the memorable plein-air event in Wieliczka, organized to help save the Salt Mine. There was an extraordinary atmosphere, and creative work was intertwined with the awareness of an important goal. The Reformati Monastery, with its calm and dignified architecture, was one of the motifs I captured at that time.",
    "storyFr": "Cette peinture a été créée lors du mémorable plein air à Wieliczka, organisé pour aider à sauver la mine de sel. Il y régnait une atmosphère extraordinaire, et le travail créatif était mêlé à la conscience d'un objectif important. Le monastère des Réformés, avec son architecture calme et digne, fut l'un des motifs que j'ai capturés à cette époque.",
    "available": 1
  },
  {
    "id": "2018-stara-wiejska-chalupa",
    "title": "Stara wiejska chałupa",
    "titleEn": "Old Country Cottage",
    "titleFr": "Vieille chaumière de campagne",
    "year": 2018,
    "imageUrl": "/attached_assets/38.avif",
    "imageUrls": ["/attached_assets/38.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": ["rural", "cottage", "architecture", "sketch", "radom", "golebiow"],
    "dominantColor": "#BDBDBD",
    "description": "Rysunek ołówkiem z 2018 roku, przedstawiający starą, drewnianą chałupę krytą strzechą w radomskiej dzielnicy Gołębiów II. Szkic oddaje surowy charakter i fakturę wiekowej budowli, z dbałością o detale takie jak konstrukcja dachu czy bale ścian.",
    "descriptionEn": "A pencil drawing from 2018, depicting an old, wooden, thatched-roof cottage in the Gołębiów II district of Radom. The sketch captures the raw character and texture of the aged structure, with attention to details such as the roof construction and wall logs.",
    "descriptionFr": "Dessin au crayon de 2018, représentant une vieille chaumière en bois au toit de chaume dans le quartier de Gołębiów II à Radom. Le croquis capture le caractère brut et la texture de la structure ancienne, avec une attention aux détails tels que la construction du toit et les rondins des murs.",
    "story": "Ten rysunek to sentymentalny powrót do widoków, które pamiętam z dzieciństwa. Gołębiów, niegdyś wieś pod Radomiem, wciąż kryje takie perełki zanikającej architektury. Chciałem uchwycić ołówkiem tę surową, prawdziwą formę, zanim zostanie wyremontowana lub zniknie na zawsze. To hołd dla prostoty i trwałości dawnego budownictwa.",
    "storyEn": "This drawing is a sentimental return to the views I remember from my childhood. Gołębiów, once a village near Radom, still hides such gems of disappearing architecture. I wanted to capture this raw, authentic form with a pencil before it gets renovated or disappears forever. It is a tribute to the simplicity and durability of old construction.",
    "storyFr": "Ce dessin est un retour sentimental aux vues que je me souviens de mon enfance. Gołębiów, autrefois un village près de Radom, cache encore de tels joyaux d'architecture en voie de disparition. Je voulais capturer cette forme brute et authentique au crayon avant qu'elle ne soit rénovée ou ne disparaisse à jamais. C'est un hommage à la simplicité et à la durabilité des constructions anciennes.",
    "available": 1
  },
  {
    "id": "2017-drewniany-kosciol-jedlnia-letnisko",
    "title": "Drewniany kościół w Jedlni-Letnisko",
    "titleEn": "Wooden Church in Jedlnia-Letnisko",
    "titleFr": "Église en bois à Jedlnia-Letnisko",
    "year": 2017,
    "imageUrl": "/attached_assets/39.avif",
    "imageUrls": ["/attached_assets/39.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "church",
      "wooden_architecture",
      "jedlnia_letnisko",
      "summer"
    ],
    "dominantColor": "#8F583B",
    "description": "Akwarela z 2017 roku przedstawiająca zabytkowy, drewniany kościół pw. św. Józefa Oblubieńca NMP w Jedlni-Letnisku. Praca ukazuje misterną architekturę świątyni w stylu zakopiańskim, skąpaną w letnim słońcu i otoczoną bujną zielenią.",
    "descriptionEn": "A 2017 watercolor depicting the historic wooden church of St. Joseph the Betrothed of the Blessed Virgin Mary in Jedlnia-Letnisko. The work showcases the intricate Zakopane-style architecture of the temple, bathed in summer sun and surrounded by lush greenery.",
    "descriptionFr": "Aquarelle de 2017 représentant l'église historique en bois de Saint-Joseph, époux de la Bienheureuse Vierge Marie, à Jedlnia-Letnisko. L'œuvre met en valeur l'architecture complexe de style Zakopane du temple, baignée par le soleil d'été et entourée d'une verdure luxuriante.",
    "story": "Ten kościół to prawdziwa perła drewnianej architektury sakralnej. Jego bryła, inspirowana stylem witkiewiczowskim, jest niezwykle malownicza. Malując go, chciałem oddać hołd kunsztowi dawnych cieśli i uchwycić atmosferę tego miejsca – spokój, wiarę i piękno, które zdaje się przenikać otaczającą go przyrodę.",
    "storyEn": "This church is a true gem of wooden sacral architecture. Its form, inspired by the Witkiewicz style, is incredibly picturesque. In painting it, I wanted to pay homage to the craftsmanship of old carpenters and capture the atmosphere of the place – the peace, faith, and beauty that seem to permeate the surrounding nature.",
    "storyFr": "Cette église est un véritable joyau de l'architecture sacrée en bois. Sa forme, inspirée du style de Witkiewicz, est incroyablement pittoresque. En la peignant, j'ai voulu rendre hommage au savoir-faire des anciens charpentiers et capturer l'atmosphère du lieu – la paix, la foi et la beauté qui semblent imprégner la nature environnante.",
    "available": 1
  },
  {
    "id": "2017-radom-remiza-zntk",
    "title": "Radom - Remiza straży przy ZNTK",
    "titleEn": "Radom - Fire Station at ZNTK",
    "titleFr": "Radom - Caserne de pompiers à ZNTK",
    "year": 2017,
    "imageUrl": "/attached_assets/40.avif",
    "imageUrls": ["/attached_assets/40.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "architecture",
      "city",
      "winter",
      "fire_station",
      "zntk"
    ],
    "dominantColor": "#C8B1A8",
    "description": "Akwarela z 2017 roku, pochodząca z kolekcji Piotra D., przedstawia historyczną remizę strażacką przy dawnych Zakładach Naprawczych Taboru Kolejowego (ZNTK) w Radomiu. Obraz ukazuje budynek w chłodnej, zimowej aurze, z charakterystyczną wieżyczką obserwacyjną i dużymi, czerwonymi bramami.",
    "descriptionEn": "A watercolor from 2017, from the collection of Piotr D., depicts the historic fire station at the former Railway Rolling Stock Repair Works (ZNTK) in Radom. The painting shows the building in a cool, winter atmosphere, with its characteristic observation tower and large red gates.",
    "descriptionFr": "Aquarelle de 2017, de la collection de Piotr D., représentant l'historique caserne de pompiers des anciens Ateliers de Réparation du Matériel Roulant Ferroviaire (ZNTK) à Radom. Le tableau montre le bâtiment dans une atmosphère hivernale et fraîche, avec sa tour d'observation caractéristique et ses grandes portes rouges.",
    "story": "To kolejny fragment Radomia, który ma swoją unikalną historię, związaną z przemysłowym dziedzictwem miasta. Budynek remizy, choć prosty w formie, ma w sobie wiele uroku. Chciałem uchwycić jego architekturę w surowym, zimowym świetle, które podkreślało detale i kolory fasady. To obraz o historii i pracy, zapisanej w murach tego miejsca.",
    "storyEn": "This is another fragment of Radom that has its own unique history, connected to the city's industrial heritage. The fire station building, though simple in form, has a lot of charm. I wanted to capture its architecture in the harsh winter light, which emphasized the details and colors of the facade. It's a painting about the history and labor inscribed in the walls of this place.",
    "storyFr": "C'est un autre fragment de Radom qui a sa propre histoire unique, liée au patrimoine industriel de la ville. Le bâtiment de la caserne de pompiers, bien que simple dans sa forme, a beaucoup de charme. J'ai voulu capturer son architecture sous la dure lumière de l'hiver, qui mettait en valeur les détails et les couleurs de la façade. C'est une peinture sur l'histoire et le travail inscrits dans les murs de ce lieu.",
    "available": 0
  },
  {
    "id": "2015-ilzanka-rzeka-dziecinstwa",
    "title": "Iłżanka - rzeka dzieciństwa",
    "titleEn": "Iłżanka - River of Childhood",
    "titleFr": "Iłżanka - Rivière de l'enfance",
    "year": 2015,
    "imageUrl": "/attached_assets/41.avif",
    "imageUrls": ["/attached_assets/41.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "water",
      "river",
      "trees",
      "summer",
      "nature",
      "reflection",
      "ilzanka",
      "ruda",
      "kazanow"
    ],
    "dominantColor": "#5A6B2F",
    "description": "Akwarela przedstawiająca ukochaną przez artystę rzekę Iłżankę we wsi Ruda (gm. Kazanów). Obraz tętni letnią zielenią gęstego lasu porastającego brzeg. Światło słońca przebija przez liście, tworząc świetliste refleksy na spokojnej tafli wody.",
    "descriptionEn": "A watercolor depicting the artist's beloved Iłżanka river in the village of Ruda (Kazanów municipality). The painting is vibrant with the summer green of the dense forest growing on the bank. Sunlight filters through the leaves, creating luminous reflections on the calm water surface.",
    "descriptionFr": "Aquarelle représentant la rivière bien-aimée de l'artiste, l'Iłżanka, dans le village de Ruda (commune de Kazanów). Le tableau est vibrant du vert estival de la forêt dense qui pousse sur la rive. La lumière du soleil filtre à travers les feuilles, créant des reflets lumineux sur la surface calme de l'eau.",
    "story": "To jest moja ukochana rzeka dzieciństwa, Iłżanka. Wiele letnich dni spędziłem nad jej brzegami w Rudzie. Ta akwarela to próba uchwycenia nie tylko samego widoku, ale przede wszystkim atmosfery tych beztroskich chwil – zapachu lasu, szumu wody i gry światła na powierzchni.",
    "storyEn": "This is my beloved river of childhood, the Iłżanka. I spent many summer days on its banks in Ruda. This watercolor is an attempt to capture not just the view itself, but above all, the atmosphere of those carefree moments – the smell of the forest, the sound of the water, and the play of light on the surface.",
    "storyFr": "C'est ma rivière d'enfance bien-aimée, l'Iłżanka. J'ai passé de nombreuses journées d'été sur ses rives à Ruda. Cette aquarelle est une tentative de capturer non seulement la vue elle-même, mais surtout l'atmosphère de ces moments insouciants – l'odeur de la forêt, le bruit de l'eau et le jeu de la lumière à la surface.",
    "available": 1
  },
  {
    "id": "2016-ruda-kwadryk",
    "title": "Leśna droga w Rudzie (Kwadryk Rudzki)",
    "titleEn": "Forest Path in Ruda (Ruda Quadriptych)",
    "titleFr": "Chemin forestier à Ruda (Quadriptyque de Ruda)",
    "year": 2016,
    "imageUrl": "/attached_assets/42.avif",
    "imageUrls": ["/attached_assets/42.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "forest",
      "trees",
      "summer",
      "light",
      "shadow",
      "ruda",
      "quadriptych"
    ],
    "dominantColor": "#4A5D2E",
    "description": "Akwarela z 2016 roku, będąca jedną z czterech części 'Kwadryptyku Rudzkiego'. Obraz przedstawia leśną drogę skąpaną w letnim słońcu. Artysta mistrzowsko oddał grę światła i cienia, tworzoną przez gęste korony drzew. Praca znajduje się w prywatnej kolekcji Piotra D.",
    "descriptionEn": "A 2016 watercolor, one of four parts of the 'Ruda Quadriptych'. The painting depicts a forest path bathed in summer sun. The artist masterfully rendered the play of light and shadow created by the dense tree canopies. The work is in the private collection of Piotr D.",
    "descriptionFr": "Aquarelle de 2016, l'une des quatre parties du 'Quadriptyque de Ruda'. Le tableau représente un chemin forestier baigné par le soleil d'été. L'artiste a rendu avec maîtrise le jeu de la lumière et de l'ombre créé par les denses cimes des arbres. L'œuvre se trouve dans la collection privée de Piotr D.",
    "story": "Ten obraz to część specjalnego, czteroczęściowego cyklu poświęconego krajobrazom wsi Ruda, który w całości trafił do kolekcji mojego przyjaciela, Piotra. W tej konkretnej pracy chciałem uchwycić wrażenie wejścia do cienistego, leśnego tunelu w upalny dzień. Kontrast między chłodnym cieniem na ścieżce a jaskrawym światłem przebijającym przez liście był główną inspiracją.",
    "storyEn": "This painting is part of a special four-part series dedicated to the landscapes of the village of Ruda, which entirely went to the collection of my friend, Piotr. In this particular work, I wanted to capture the feeling of entering a shady forest tunnel on a hot day. The contrast between the cool shade on the path and the bright light filtering through the leaves was the main inspiration.",
    "storyFr": "Cette peinture fait partie d'une série spéciale en quatre parties consacrée aux paysages du village de Ruda, qui est entièrement allée dans la collection de mon ami, Piotr. Dans cette œuvre particulière, je voulais capturer la sensation d'entrer dans un tunnel forestier ombragé par une chaude journée. Le contraste entre l'ombre fraîche sur le chemin et la lumière vive filtrant à travers les feuilles a été la principale inspiration.",
    "available": 0
  },
  {
    "id": "2015-droga-przez-las",
    "title": "Droga przez las",
    "titleEn": "Path Through the Forest",
    "titleFr": "Chemin à travers la forêt",
    "year": 2015,
    "imageUrl": "/attached_assets/43.avif",
    "imageUrls": ["/attached_assets/43.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "forest",
      "trees",
      "nature",
      "summer",
      "light",
      "shadow",
      "ruda",
      "kazanow",
      "kowalkow",
      "path",
      "staffage"
    ],
    "dominantColor": "#78866B",
    "description": "Akwarela z 2015 roku przedstawiająca leśną drogę w okolicach cmentarza w Kowalkowie (gm. Kazanów). Obraz ukazuje aleję wysokich sosen, przez których korony przebija się światło, tworząc malowniczą grę cieni na ścieżce. Postać na drodze to żona artysty, wprowadzona jako sztafaż.",
    "descriptionEn": "A 2015 watercolor depicting a forest road near the cemetery in Kowalków (Kazanów municipality). The painting shows an avenue of tall pine trees, with light filtering through their canopies, creating a picturesque play of shadows on the path. The figure on the road is the artist's wife, included as staffage.",
    "descriptionFr": "Aquarelle de 2015 représentant un chemin forestier près du cimetière de Kowalków (commune de Kazanów). Le tableau montre une allée de grands pins, avec la lumière filtrant à travers leurs cimes, créant un jeu d'ombres pittoresque sur le sentier. La silhouette sur la route est l'épouse de l'artiste, incluse comme staffage.",
    "story": "To droga, która prowadzi w kierunku wsi Ruda, gdzie jako dziecko spędzałem wakacje u dziadków. Ma dla mnie ogromną wartość sentymentalną. Idącą w oddali postacią, stanowiącą sztafaż, jest moja żona. Chciałem uchwycić atmosferę tego miejsca, spokój lasu i wspomnienia, które wiążą się z tą ścieżką.",
    "storyEn": "This is the road that leads towards the village of Ruda, where I spent my childhood holidays with my grandparents. It holds great sentimental value for me. The figure walking in the distance, serving as staffage, is my wife. I wanted to capture the atmosphere of this place, the tranquility of the forest, and the memories associated with this path.",
    "storyFr": "C'est la route qui mène au village de Ruda, où je passais mes vacances d'enfance chez mes grands-parents. Elle a une grande valeur sentimentale pour moi. La silhouette qui marche au loin, servant de staffage, est ma femme. Je voulais capturer l'atmosphère de ce lieu, la tranquillité de la forêt et les souvenirs associés à ce chemin.",
    "available": 1
  },
  {
    "id": "2009-cerkiew-lublin",
    "title": "Cerkiew w Lublinie",
    "titleEn": "Orthodox Church in Lublin",
    "titleFr": "Église orthodoxe de Lublin",
    "year": 2009,
    "imageUrl": "/attached_assets/44.avif",
    "imageUrls": ["/attached_assets/44.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "city",
      "lublin",
      "orthodox_church",
      "spring"
    ],
    "dominantColor": "#9F8569",
    "description": "Akwarela z 2009 roku przedstawiająca cerkiew katedralną Przemienienia Pańskiego w Lublinie. Artysta uchwycił fragment świątyni z jej charakterystyczną, czerwoną kopułą, w otoczeniu wczesnowiosennych drzew. Gra kolorów i światła na starych murach oddaje historyczny i uduchowiony klimat tego miejsca.",
    "descriptionEn": "A 2009 watercolor depicting the Transfiguration of the Lord Cathedral Orthodox Church in Lublin. The artist captured a fragment of the temple with its characteristic red dome, surrounded by early spring trees. The play of colors and light on the old walls conveys the historical and spiritual atmosphere of the place.",
    "descriptionFr": "Aquarelle de 2009 représentant la cathédrale orthodoxe de la Transfiguration-du-Seigneur à Lublin. L'artiste a capturé un fragment du temple avec son dôme rouge caractéristique, entouré d'arbres au début du printemps. Le jeu des couleurs et de la lumière sur les vieux murs transmet l'atmosphère historique et spirituelle du lieu.",
    "story": "Lublin to miasto o bogatej, wielokulturowej historii, a ta cerkiew jest jednym z jej najpiękniejszych symboli. Malując ją, byłem pod wrażeniem jej architektury i kolorystyki. Starałem się oddać nastrój wczesnej wiosny, kiedy przyroda budzi się do życia, a światło nadaje starym murom nowego blasku.",
    "storyEn": "Lublin is a city with a rich, multicultural history, and this Orthodox church is one of its most beautiful symbols. While painting it, I was impressed by its architecture and color scheme. I tried to capture the mood of early spring, when nature awakens, and the light gives a new glow to the old walls.",
    "storyFr": "Lublin est une ville à l'histoire riche et multiculturelle, et cette église orthodoxe en est l'un de ses plus beaux symboles. En la peignant, j'ai été impressionné par son architecture et ses couleurs. J'ai essayé de capturer l'ambiance du début du printemps, lorsque la nature s'éveille et que la lumière donne un nouvel éclat aux vieux murs.",
    "available": 1
  },
  {
    "id": "2015-cerkiew-radom",
    "title": "Radom - Cerkiew",
    "titleEn": "Radom - Orthodox Church",
    "titleFr": "Radom - Église orthodoxe",
    "year": 2015,
    "imageUrl": "/attached_assets/45.avif",
    "imageUrls": ["/attached_assets/45.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "architecture",
      "sacred_art",
      "city",
      "winter",
      "orthodox_church"
    ],
    "dominantColor": "#B4B49F",
    "description": "Akwarela z 2015 roku przedstawiająca cerkiew prawosławną w Radomiu, znajdującą się przy cmentarzu na ul. Warszawskiej. Praca ukazuje świątynię w zimowej scenerii, z nagimi drzewami i długimi cieńami na śniegu. Charakterystyczna kopuła i brama wejściowa stanowią centralne punkty kompozycji.",
    "descriptionEn": "A 2015 watercolor depicting the Orthodox church in Radom, located next to the cemetery on Warszawska Street. The work shows the temple in a winter setting, with bare trees and long shadows on the snow. The characteristic dome and entrance gate are the central points of the composition.",
    "descriptionFr": "Aquarelle de 2015 représentant l'église orthodoxe de Radom, située à côté du cimetière de la rue Warszawska. L'œuvre montre le temple dans un décor hivernal, avec des arbres nus et de longues ombres sur la neige. Le dôme caractéristique et la porte d'entrée sont les points centraux de la composition.",
    "story": "Jak ten czas leci. Malowałem tę cerkiew 5 lat temu, a wydaje się jakby to było wczoraj. To wyjątkowe miejsce w Radomiu, pełne zadumy, zwłaszcza zimą. Chciałem uchwycić ten chłodny, ale spokojny nastrój, grę świateł na złotej kopule i cienie starych drzew na śniegu. To pejzaż, który skłania do refleksji.",
    "storyEn": "How time flies. I painted this Orthodox church 5 years ago, and it feels like yesterday. It is a unique place in Radom, full of contemplation, especially in winter. I wanted to capture that cool but peaceful mood, the play of light on the golden dome, and the shadows of the old trees on the snow. It is a landscape that encourages reflection.",
    "storyFr": "Comme le temps passe vite. J'ai peint cette église orthodoxe il y a 5 ans, et j'ai l'impression que c'était hier. C'est un lieu unique à Radom, plein de contemplation, surtout en hiver. Je voulais capturer cette ambiance fraîche mais paisible, le jeu de la lumière sur le dôme doré et les ombres des vieux arbres sur la neige. C'est un paysage qui incite à la réflexion.",
    "available": 1
  },
  {
    "id": "2018-wies-ruda-rekonstrukcja",
    "title": "Chałupa Pani Wziątek we wsi Ruda (rekonstrukcja)",
    "titleEn": "Mrs. Wziątek's Cottage in Ruda Village (Reconstruction)",
    "titleFr": "Chaumière de Mme Wziątek dans le village de Ruda (Reconstruction)",
    "year": 2018,
    "imageUrl": "/attached_assets/46.avif",
    "imageUrls": ["/attached_assets/46.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": [
      "ruda",
      "rural",
      "cottage",
      "architecture",
      "sketch",
      "reconstruction",
      "kazanow",
      "landscape"
    ],
    "dominantColor": "#AAAAAA",
    "description": "Rysunek ołówkiem z 2018 roku, będący sentymentalną rekonstrukcją chałupy Pani Wziątek we wsi Ruda (gm. Kazanów). Praca oddaje klimat dawnej, wiejskiej zabudowy z jej drewnianymi domami, płotami i otaczającą przyrodą.",
    "descriptionEn": "A pencil drawing from 2018, which is a sentimental reconstruction of Mrs. Wziątek's cottage in the village of Ruda (Kazanów municipality). The work captures the atmosphere of old rural buildings with its wooden houses, fences, and surrounding nature.",
    "descriptionFr": "Dessin au crayon de 2018, qui est une reconstruction sentimentale de la chaumière de Mme Wziątek dans le village de Ruda (commune de Kazanów). L'œuvre capture l'atmosphère des anciens bâtiments ruraux avec ses maisons en bois, ses clôtures et la nature environnante.",
    "story": "To jest próba odtworzenia z pamięci fragmentu wsi Ruda, miejsca bliskiego mojemu sercu od dzieciństwa. Chałupa Pani Wziątek, jak wiele innych w okolicy, uległa z czasem przemianom. Ten rysunek jest próbą zatrzymania w kadrze wspomnienia, rekonstrukcją widoku, który powoli zaciera się w pamięci.",
    "storyEn": "This is an attempt to reconstruct from memory a fragment of the village of Ruda, a place close to my heart since childhood. Mrs. Wziątek's cottage, like many others in the area, has changed over time. This drawing is an attempt to capture a memory, a reconstruction of a view that is slowly fading from memory.",
    "storyFr": "C'est une tentative de reconstruire de mémoire un fragment du village de Ruda, un lieu cher à mon cœur depuis l'enfance. La chaumière de Mme Wziątek, comme beaucoup d'autres dans la région, a changé avec le temps. Ce dessin est une tentative de capturer un souvenir, une reconstruction d'une vue qui s'efface lentement de la mémoire.",
    "available": 1
  },
  {
    "id": "2013-kosciol-w-odechowie",
    "title": "Kościół w Odechowie",
    "titleEn": "Church in Odechów",
    "titleFr": "Église d'Odechów",
    "year": 2013,
    "imageUrl": "/attached_assets/47.avif",
    "imageUrls": ["/attached_assets/47.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "church",
      "landscape",
      "rural",
      "gothic",
      "odechow"
    ],
    "dominantColor": "#D9C98B",
    "description": "Akwarela z 2013 roku przedstawiająca gotycki kościół Zwiastowania NMP w Odechowie. Artysta uchwycił świątynię i otaczającą ją wiejską zabudowę w ciepłym, rozproszonym świetle. Praca oddaje malowniczy charakter mazowieckiego krajobrazu.",
    "descriptionEn": "A 2013 watercolor depicting the Gothic Church of the Annunciation of the Blessed Virgin Mary in Odechów. The artist captured the church and the surrounding rural buildings in a warm, diffused light. The work conveys the picturesque character of the Masovian landscape.",
    "descriptionFr": "Aquarelle de 2013 représentant l'église gothique de l'Annonciation de la Bienheureuse Vierge Marie à Odechów. L'artiste a capturé l'église et les bâtiments ruraux environnants sous une lumière chaude et diffuse. L'œuvre transmet le caractère pittoresque du paysage de Mazovie.",
    "story": "Kościół w Odechowie to jeden z najcenniejszych zabytków gotyku na południowym Mazowszu. Jego ceglana bryła pięknie komponuje się z wiejskim krajobrazem. Malując go, chciałem oddać nastrój spokojnego popołudnia, kiedy światło modeluje architekturę i ociepla całą scenę. To obraz o historii i trwaniu w sercu mazowieckiej ziemi.",
    "storyEn": "The church in Odechów is one of the most valuable Gothic monuments in southern Masovia. Its brick structure blends beautifully with the rural landscape. While painting it, I wanted to capture the mood of a peaceful afternoon, when light models the architecture and warms the entire scene. It is a painting about history and endurance in the heart of the Masovian land.",
    "storyFr": "L'église d'Odechów est l'un des monuments gothiques les plus précieux du sud de la Mazovie. Sa structure en briques se marie à merveille avec le paysage rural. En la peignant, j'ai voulu capturer l'ambiance d'un après-midi paisible, lorsque la lumière modèle l'architecture et réchauffe toute la scène. C'est une peinture sur l'histoire et l'endurance au cœur de la terre de Mazovie.",
    "available": 1
  },
  {
    "id": "2017-kosciol-jedlnia-koscielna",
    "title": "Kościół w Jedlni Kościelnej",
    "titleEn": "Church in Jedlnia Kościelna",
    "titleFr": "Église de Jedlnia Kościelna",
    "year": 2017,
    "imageUrl": "/attached_assets/48.avif",
    "imageUrls": ["/attached_assets/48.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "church",
      "landscape",
      "summer",
      "jedlnia_koscielna",
      "baroque"
    ],
    "dominantColor": "#86A5B1",
    "description": "Akwarela z 2017 roku przedstawiająca barokowy kościół św. Mikołaja i św. Małgorzaty w Jedlni Kościelnej (dawniej Jedlnia). Artysta z dużą dbałością o detale oddał bogactwo architektoniczne fasady z datą 'AD 1901' oraz strzelistą wieżą. Dynamiczne niebo i letnia sceneria podkreślają monumentalność budowli.",
    "descriptionEn": "A 2017 watercolor depicting the Baroque church of St. Nicholas and St. Margaret in Jedlnia Kościelna (formerly Jedlnia). The artist, with great attention to detail, rendered the architectural richness of the facade with the date 'AD 1901' and the soaring tower. The dynamic sky and summer scenery emphasize the monumentality of the building.",
    "descriptionFr": "Aquarelle de 2017 représentant l'église baroque Saint-Nicolas et Sainte-Marguerite à Jedlnia Kościelna (anciennement Jedlnia). L'artiste, avec une grande attention aux détails, a rendu la richesse architecturale de la façade avec la date 'AD 1901' et la tour élancée. Le ciel dynamique et le paysage estival soulignent la monumentalité du bâtiment.",
    "story": "To jeden z najpiękniejszych barokowych kościołów w naszym regionie. Jego fasada jest niezwykle bogata w detale, co stanowiło duże wyzwanie malarskie. Chciałem uchwycić nie tylko samą architekturę, ale też grę światła na jej zdobieniach i nastrój letniego dnia, kiedy niebo i chmury tworzą wspaniałe tło dla tej historycznej budowli.",
    "storyEn": "This is one of the most beautiful Baroque churches in our region. Its facade is incredibly rich in detail, which was a great painting challenge. I wanted to capture not only the architecture itself but also the play of light on its ornaments and the mood of a summer day, when the sky and clouds create a magnificent backdrop for this historic building.",
    "storyFr": "C'est l'une des plus belles églises baroques de notre région. Sa façade est incroyablement riche en détails, ce qui constituait un grand défi pictural. Je voulais capturer non seulement l'architecture elle-même, mais aussi le jeu de la lumière sur ses ornements et l'ambiance d'une journée d'été, lorsque le ciel et les nuages créent une magnifique toile de fond pour ce bâtiment historique.",
    "available": 1
  },
  {
    "id": "2017-czarnolas",
    "title": "Muzeum Jana Kochanowskiego w Czarnolesie",
    "titleEn": "Jan Kochanowski Museum in Czarnolas",
    "titleFr": "Musée Jan Kochanowski à Czarnolas",
    "year": 2017,
    "imageUrl": "/attached_assets/49.avif",
    "imageUrls": ["/attached_assets/49.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "museum",
      "manor_house",
      "czarnolas",
      "kochanowski",
      "landscape",
      "summer"
    ],
    "dominantColor": "#A8B4A2",
    "description": "Akwarela z 2017 roku przedstawiająca dworek w Czarnolesie - siedzibę Muzeum Jana Kochanowskiego. Praca ukazuje klasycystyczny budynek muzeum otoczony historycznym parkiem. Letnie światło delikatnie oświetla fasadę, podkreślając spokojną i dostojną atmosferę miejsca.",
    "descriptionEn": "A 2017 watercolor depicting the manor house in Czarnolas - the seat of the Jan Kochanowski Museum. The work shows the classicist museum building surrounded by a historic park. Summer light gently illuminates the facade, emphasizing the calm and dignified atmosphere of the place.",
    "descriptionFr": "Aquarelle de 2017 représentant le manoir de Czarnolas - siège du musée Jan Kochanowski. L'œuvre montre le bâtiment du musée de style classique entouré d'un parc historique. La lumière estivale illumine doucement la façade, soulignant l'atmosphère calme et digne du lieu.",
    "story": "Czarnolas to miejsce szczególne dla polskiej kultury. Malując siedzibę muzeum wielkiego poety, chciałem oddać klimat tego miejsca - jego historię, spokój i związek z naturą, która była tak ważna w twórczości Kochanowskiego. To próba przeniesienia na papier ducha renesansowej harmonii.",
    "storyEn": "Czarnolas is a special place for Polish culture. While painting the seat of the great poet's museum, I wanted to convey the atmosphere of this place - its history, tranquility, and connection with nature, which was so important in Kochanowski's work. It is an attempt to transfer the spirit of Renaissance harmony onto paper.",
    "storyFr": "Czarnolas est un lieu spécial pour la culture polonaise. En peignant le siège du musée du grand poète, j'ai voulu transmettre l'atmosphère de ce lieu - son histoire, sa tranquillité et son lien avec la nature, si important dans l'œuvre de Kochanowski. C'est une tentative de transférer sur le papier l'esprit de l'harmonie de la Renaissance.",
    "available": 1
  },
  {
    "id": "2017-jesien-w-bukowym-lesie",
    "title": "Jesień w bukowym lesie",
    "titleEn": "Autumn in the Beech Forest",
    "titleFr": "Automne dans la forêt de hêtres",
    "year": 2017,
    "imageUrl": "/attached_assets/50.avif",
    "imageUrls": ["/attached_assets/50.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "forest",
      "trees",
      "autumn",
      "light",
      "shadow",
      "beech_forest"
    ],
    "dominantColor": "#546D5B",
    "description": "Akwarela z 2017 roku przedstawiająca wnętrze bukowego lasu w pełni jesiennych barw. Artysta skupił się na kontraście między chłodnymi, niebieskawymi pniami starych drzew a ciepłymi, złocistymi liśćmi. Praca oddaje nastrój mglistego, jesiennego poranka.",
    "descriptionEn": "A 2017 watercolor depicting the interior of a beech forest in full autumn colors. The artist focused on the contrast between the cool, bluish trunks of old trees and the warm, golden leaves. The work conveys the mood of a misty autumn morning.",
    "descriptionFr": "Aquarelle de 2017 représentant l'intérieur d'une forêt de hêtres aux couleurs automnales. L'artiste s'est concentré sur le contraste entre les troncs froids et bleutés des vieux arbres et les feuilles chaudes et dorées. L'œuvre transmet l'ambiance d'un matin d'automne brumeux.",
    "story": "Uwielbiam jesienne lasy, a buczyna o tej porze roku ma w sobie coś niezwykłego. Chciałem uchwycić ten moment, gdy ostatnie liście płoną złotem na gałęziach, a pnie drzew przybierają chłodne, niemal błękitne odcienie. To pejzaż pełen nostalgii i malarskich kontrastów.",
    "storyEn": "I love autumn forests, and a beech wood has something extraordinary about it at this time of year. I wanted to capture that moment when the last leaves burn golden on the branches, and the tree trunks take on cool, almost blue hues. It is a landscape full of nostalgia and painterly contrasts.",
    "storyFr": "J'adore les forêts d'automne, et une hêtraie a quelque chose d'extraordinaire à cette période de l'année. Je voulais capturer ce moment où les dernières feuilles brûlent d'or sur les branches, et où les troncs d'arbres prennent des teintes froides, presque bleues. C'est un paysage plein de nostalgie et de contrastes picturaux.",
    "available": 1
  },
  {
    "id": "2019-zimowy-pejzaz-z-brzozami",
    "title": "Pejzaż zimowy z brzozami",
    "titleEn": "Winter Landscape with Birches",
    "titleFr": "Paysage d'hiver avec des bouleaux",
    "year": 2019,
    "imageUrl": "/attached_assets/51.avif",
    "imageUrls": ["/attached_assets/51.avif"],
    "dimensions": "26 x 17,5 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "trees",
      "birches",
      "light",
      "shadow",
      "tranquility"
    ],
    "dominantColor": "#CAD2B4",
    "description": "Akwarela z 2019 roku, namalowana na papierze Canson (300 g/m²), przedstawia spokojny, zimowy pejzaż. Obraz ukazuje grupę brzóz na pierwszym planie, ośnieżoną polanę i las w oddali. Artysta mistrzowsko operuje kontrastem ciepłego światła zachodzącego słońca i chłodnych, fioletowych cieni rzucanych na śnieg.",
    "descriptionEn": "A 2019 watercolor, painted on Canson paper (300 g/m²), depicts a peaceful winter landscape. The painting shows a group of birches in the foreground, a snow-covered clearing, and a forest in the distance. The artist masterfully uses the contrast between the warm light of the setting sun and the cool, violet shadows cast on the snow.",
    "descriptionFr": "Aquarelle de 2019, peinte sur papier Canson (300 g/m²), représentant un paysage d'hiver paisible. Le tableau montre un groupe de bouleaux au premier plan, une clairière enneigée et une forêt au loin. L'artiste utilise avec maîtrise le contraste entre la lumière chaude du soleil couchant et les ombres froides et violettes projetées sur la neige.",
    "story": "Zima w akwareli to fascynująca gra barw. Wbrew pozorom, śnieg nigdy nie jest tylko biały. W tej pracy chciałem uchwycić ten niezwykły moment zimowego popołudnia, kiedy niskie słońce barwi wszystko na złoto, a cienie stają się głęboko fioletowe. Brzozy, ze swoją charakterystyczną korą, są idealnym modelem do pokazania tej gry światła.",
    "storyEn": "Winter in watercolor is a fascinating play of colors. Contrary to appearances, snow is never just white. In this work, I wanted to capture that extraordinary moment of a winter afternoon when the low sun colors everything gold, and the shadows turn deep violet. The birches, with their distinctive bark, are the perfect subjects to show this play of light.",
    "storyFr": "L'hiver à l'aquarelle est un jeu de couleurs fascinant. Contrairement aux apparences, la neige n'est jamais seulement blanche. Dans cette œuvre, j'ai voulu capturer ce moment extraordinaire d'un après-midi d'hiver où le soleil bas colore tout en or et les ombres deviennent d'un violet profond. Les bouleaux, avec leur écorce distinctive, sont les sujets parfaits pour montrer ce jeu de lumière.",
    "available": 1
  },
  {
    "id": "2017-kosciol-alojzow-rekonstrukcja",
    "title": "Kościół w Alojzowie (rekonstrukcja)",
    "titleEn": "Church in Alojzów (Reconstruction)",
    "titleFr": "Église d'Alojzów (Reconstruction)",
    "year": 2017,
    "imageUrl": "/attached_assets/52.avif",
    "imageUrls": ["/attached_assets/52.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "church",
      "wooden_architecture",
      "reconstruction",
      "alojzow",
      "autumn"
    ],
    "dominantColor": "#B5A976",
    "description": "Akwarela z 2017 roku będąca artystyczną rekonstrukcją drewnianego kościoła w Alojzowie. Świątynia, wzniesiona w 1707 roku, spłonęła w 1936. Artysta odtworzył jej prawdopodobny wygląd w jesiennej scenerii, opierając się na dostępnych materiałach historycznych.",
    "descriptionEn": "A 2017 watercolor that is an artistic reconstruction of the wooden church in Alojzów. The temple, built in 1707, burned down in 1936. The artist recreated its probable appearance in an autumn setting, based on available historical materials.",
    "descriptionFr": "Aquarelle de 2017 qui est une reconstruction artistique de l'église en bois d'Alojzów. Le temple, construit en 1707, a brûlé en 1936. L'artiste a recréé son apparence probable dans un décor d'automne, en se basant sur les matériaux historiques disponibles.",
    "story": "To malarska podróż w czasie. Kościół w Alojzowie, którego już nie ma, ożywa na nowo na papierze. Rekonstrukcja na podstawie starych fotografii i opisów to fascynujące wyzwanie. Chciałem nie tylko odtworzyć bryłę budynku, ale też tchnąć w niego życie, umieszczając go w pejzażu pełnym ciepłych, jesiennych barw, jakby czas się dla niego zatrzymał.",
    "storyEn": "This is a painterly journey through time. The church in Alojzów, which no longer exists, comes to life again on paper. Reconstructing it based on old photographs and descriptions is a fascinating challenge. I wanted to not only recreate the building's form but also to breathe life into it by placing it in a landscape full of warm autumn colors, as if time had stood still for it.",
    "storyFr": "C'est un voyage pictural dans le temps. L'église d'Alojzów, qui n'existe plus, reprend vie sur le papier. La reconstruire à partir de vieilles photographies et de descriptions est un défi fascinant. Je voulais non seulement recréer la forme du bâtiment, mais aussi lui insuffler la vie en le plaçant dans un paysage plein de couleurs chaudes d'automne, comme si le temps s'était arrêté pour lui.",
    "available": 1
  },
  {
    "id": "2018-radom-rwanska-po-deszczu",
    "title": "Radom - ul. Rwańska po deszczu",
    "titleEn": "Radom - Rwańska Street After the Rain",
    "titleFr": "Radom - Rue Rwańska après la pluie",
    "year": 2018,
    "imageUrl": "/attached_assets/53.avif",
    "imageUrls": ["/attached_assets/53.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "old_town",
      "rwanska_street",
      "rain",
      "reflection"
    ],
    "dominantColor": "#A67A44",
    "description": "Akwarela z 2018 roku, przedstawiająca jedną z najbardziej urokliwych uliczek radomskiego Starego Miasta - Rwańską. Artysta uchwycił scenę tuż po deszczu, kiedy mokry bruk pięknie odbija kolorowe fasady kamienic i wieżę kościoła Farnego w tle. Obraz tętni życiem i światłem.",
    "descriptionEn": "A 2018 watercolor depicting one of the most charming streets of Radom's Old Town - Rwańska Street. The artist captured the scene just after the rain, when the wet cobblestones beautifully reflect the colorful facades of the tenement houses and the tower of the Parish Church in the background. The painting is vibrant with life and light.",
    "descriptionFr": "Aquarelle de 2018 représentant l'une des rues les plus charmantes de la vieille ville de Radom - la rue Rwańska. L'artiste a capturé la scène juste après la pluie, lorsque les pavés mouillés reflètent magnifiquement les façades colorées des immeubles et la tour de l'église paroissiale en arrière-plan. Le tableau est vibrant de vie et de lumière.",
    "story": "Ulica Rwańska po deszczu nabiera zupełnie nowego charakteru. Odbicia w kałużach zwielokrotniają kolory i światła, tworząc niemal impresjonistyczny widok. Chciałem oddać ten ulotny moment, kiedy miasto na chwilę zwalnia, a zwykła ulica zamienia się w malowniczy pejzaż pełen barwnych refleksów.",
    "storyEn": "Rwańska Street takes on a completely new character after the rain. The reflections in the puddles multiply the colors and lights, creating an almost impressionistic view. I wanted to capture this fleeting moment when the city slows down for a while, and an ordinary street turns into a picturesque landscape full of colorful reflections.",
    "storyFr": "La rue Rwańska prend un tout nouveau caractère après la pluie. Les reflets dans les flaques d'eau multiplient les couleurs et les lumières, créant une vue presque impressionniste. J'ai voulu capturer ce moment fugace où la ville ralentit un instant, et une rue ordinaire se transforme en un paysage pittoresque plein de reflets colorés.",
    "available": 1
  },
  {
    "id": "2019-stara-chalupa-rysunek",
    "title": "Stara chałupa",
    "titleEn": "Old Cottage",
    "titleFr": "Vieille Chaumière",
    "year": 2019,
    "imageUrl": "/attached_assets/54.avif",
    "imageUrls": ["/attached_assets/54.avif"],
    "dimensions": "18 x 13 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": [
      "rural",
      "cottage",
      "architecture",
      "sketch",
      "landscape",
      "nature"
    ],
    "dominantColor": "#C3C3C3",
    "description": "Rysunek ołówkiem z 2019 roku, przedstawiający starą, drewnianą chałupę krytą strzechą w wiejskim otoczeniu. Dynamiczna, szkicowa kreska oddaje surowy charakter budowli i otaczającej ją przyrody. Praca jest lekko poprawioną wersją wcześniejszego szkicu.",
    "descriptionEn": "A pencil drawing from 2019, depicting an old, wooden, thatched-roof cottage in a rural setting. The dynamic, sketchy lines capture the raw character of the building and the surrounding nature. The work is a slightly revised version of an earlier sketch.",
    "descriptionFr": "Dessin au crayon de 2019, représentant une vieille chaumière en bois au toit de chaume dans un cadre rural. Les lignes dynamiques et esquissées capturent le caractère brut du bâtiment et de la nature environnante. L'œuvre est une version légèrement révisée d'un croquis antérieur.",
    "story": "Lubię wracać do starych szkiców i motywów. Ta chałupa to kwintesencja wiejskiego krajobrazu, który powoli znika. Dynamiczna kreska ołówka pozwala szybko uchwycić nastrój i fakturę drewna i strzechy. To studium formy i światła, a zarazem hołd dla prostoty i piękna dawnej architektury.",
    "storyEn": "I enjoy revisiting old sketches and motifs. This cottage is the quintessence of the rural landscape that is slowly disappearing. The dynamic pencil line allows for a quick capture of the mood and the texture of the wood and thatch. It is a study of form and light, and at the same time, a tribute to the simplicity and beauty of old architecture.",
    "storyFr": "J'aime revisiter les anciens croquis et motifs. Cette chaumière est la quintessence du paysage rural qui disparaît lentement. Le trait de crayon dynamique permet de capturer rapidement l'ambiance et la texture du bois et du chaume. C'est une étude de la forme et de la lumière, et en même temps, un hommage à la simplicité et à la beauté de l'architecture ancienne.",
    "available": 1
  },
  {
    "id": "2011-samotna-sosna",
    "title": "Samotna sosna",
    "titleEn": "Lone Pine",
    "titleFr": "Pin solitaire",
    "year": 2011,
    "imageUrl": "/attached_assets/55.avif",
    "imageUrls": ["/attached_assets/55.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "forest",
      "trees",
      "winter",
      "snow",
      "dabrowa_kozlowska",
      "pine_tree"
    ],
    "dominantColor": "#B9A569",
    "description": "Akwarela z 2011 roku, przedstawiająca majestatyczną, samotną sosnę na tle zimowego lasu w okolicach Dąbrowy Kozłowskiej. Ciepłe światło zachodzącego słońca oświetla koronę drzewa, tworząc silny kontrast z chłodnym, ośnieżonym otoczeniem.",
    "descriptionEn": "A 2011 watercolor depicting a majestic, lone pine tree against a winter forest backdrop near Dąbrowa Kozłowska. The warm light of the setting sun illuminates the treetop, creating a strong contrast with the cool, snowy surroundings.",
    "descriptionFr": "Aquarelle de 2011 représentant un pin majestueux et solitaire sur fond de forêt hivernale près de Dąbrowa Kozłowska. La lumière chaude du soleil couchant illumine la cime de l'arbre, créant un fort contraste avec les environs froids et enneigés.",
    "story": "W lesie każda pora roku ma swój urok, ale zima potrafi być szczególnie malownicza. Ta potężna sosna, górująca nad młodszymi drzewami, przykuła moją uwagę podczas jednego ze spacerów. Zafascynował mnie kontrast między ciepłym blaskiem słońca na jej igłach a zimnym, monochromatycznym tłem. To obraz o sile, trwaniu i pięknie natury w jej surowej odsłonie.",
    "storyEn": "Every season in the forest has its charm, but winter can be particularly picturesque. This mighty pine, towering over the younger trees, caught my attention during one of my walks. I was fascinated by the contrast between the warm glow of the sun on its needles and the cold, monochromatic background. It is a painting about strength, endurance, and the beauty of nature in its raw form.",
    "storyFr": "Chaque saison dans la forêt a son charme, mais l'hiver peut être particulièrement pittoresque. Ce pin puissant, dominant les arbres plus jeunes, a attiré mon attention lors d'une de mes promenades. J'ai été fasciné par le contraste entre la lueur chaude du soleil sur ses aiguilles et l'arrière-plan froid et monochrome. C'est une peinture sur la force, l'endurance et la beauté de la nature dans sa forme la plus brute.",
    "available": 1
  },
  {
    "id": "2018-po-deszczu-radom",
    "title": "Po deszczu",
    "titleEn": "After the Rain",
    "titleFr": "Après la pluie",
    "year": 2018,
    "imageUrl": "/attached_assets/56.avif",
    "imageUrls": ["/attached_assets/56.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "radom",
      "hometown",
      "fields",
      "rain",
      "sky",
      "clouds",
      "spring"
    ],
    "dominantColor": "#5C8954",
    "description": "Akwarela z 2018 roku, przedstawiająca radomskie pola tuż po przejściu deszczu. Artysta uchwycił intensywną zieleń pól w pasach i dramatyczne, burzowe niebo. Praca ma niemal abstrakcyjny charakter, skupiając się na rytmie kolorowych pasów i nastroju krajobrazu.",
    "descriptionEn": "A 2018 watercolor depicting the fields of Radom just after a rain shower. The artist captured the intense green of the striped fields and a dramatic, stormy sky. The work has an almost abstract quality, focusing on the rhythm of the colorful stripes and the mood of the landscape.",
    "descriptionFr": "Aquarelle de 2018 représentant les champs de Radom juste après une averse. L'artiste a capturé le vert intense des champs rayés et un ciel dramatique et orageux. L'œuvre a une qualité presque abstraite, se concentrant sur le rythme des bandes colorées et l'atmosphère du paysage.",
    "story": "Jest coś niezwykłego w powietrzu i kolorach tuż po burzy. Wszystko staje się wyraziste i nasycone. Ten widok pól pod Radomiem, z ich geometrycznym podziałem, zainspirował mnie do stworzenia tej prostej, ale pełnej emocji kompozycji. Chciałem oddać uczucie świeżości i spokoju, które nastaje po deszczu.",
    "storyEn": "There is something extraordinary about the air and colors just after a storm. Everything becomes vivid and saturated. This view of the fields near Radom, with their geometric division, inspired me to create this simple yet emotional composition. I wanted to convey the feeling of freshness and calm that follows the rain.",
    "storyFr": "Il y a quelque chose d'extraordinaire dans l'air et les couleurs juste après un orage. Tout devient vif et saturé. Cette vue des champs près de Radom, avec leur division géométrique, m'a inspiré pour créer cette composition simple mais pleine d'émotion. Je voulais transmettre la sensation de fraîcheur et de calme qui suit la pluie.",
    "available": 1
  },
  {
    "id": "1990-portret-syna",
    "title": "Portret syna zrywającego kwiatki",
    "titleEn": "Portrait of My Son Picking Flowers",
    "titleFr": "Portrait de mon fils cueillant des fleurs",
    "year": 1990,
    "imageUrl": "/attached_assets/57.avif",
    "imageUrls": ["/attached_assets/57.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": ["portrait", "sketch", "family", "childhood", "son"],
    "dominantColor": "#DCDCDC",
    "description": "Intymny i osobisty rysunek ołówkiem z 1990 roku, przedstawiający syna artysty podczas zabawy na dworze. Szkic z czułością oddaje dziecięce rysy twarzy i skupienie malca, który sięga po kwiatki.",
    "descriptionEn": "An intimate and personal pencil drawing from 1990, depicting the artist's son playing outdoors. The sketch tenderly captures the child's facial features and the little one's concentration as he reaches for flowers.",
    "descriptionFr": "Dessin au crayon intime et personnel de 1990, représentant le fils de l'artiste jouant à l'extérieur. Le croquis capture avec tendresse les traits du visage de l'enfant et la concentration du petit alors qu'il attrape des fleurs.",
    "story": "To jeden z tych rysunków, które mają dla mnie ogromną wartość sentymentalną. To portret mojego syna, uchwycony w jednej z tych ulotnych, codziennych chwil dzieciństwa. Chciałem zatrzymać ten moment - jego ciekawość świata i niewinność. Ołówek, jako technika, pozwolił na szybkie i bezpośrednie oddanie tego wrażenia.",
    "storyEn": "This is one of those drawings that holds great sentimental value for me. It is a portrait of my son, captured in one of those fleeting, everyday moments of childhood. I wanted to freeze this moment - his curiosity about the world and his innocence. Pencil, as a technique, allowed for a quick and direct rendering of this impression.",
    "storyFr": "C'est l'un de ces dessins qui a une grande valeur sentimentale pour moi. C'est un portrait de mon fils, capturé dans un de ces moments fugaces et quotidiens de l'enfance. Je voulais figer cet instant - sa curiosité pour le monde et son innocence. Le crayon, en tant que technique, a permis de rendre rapidement et directement cette impression.",
    "available": 1
  },
  {
    "id": "2016-radom-fara",
    "title": "Radom - Fara",
    "titleEn": "Radom - Parish Church",
    "titleFr": "Radom - Église paroissiale",
    "year": 2016,
    "imageUrl": "/attached_assets/58.avif",
    "imageUrls": ["/attached_assets/58.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "sacred_art",
      "church",
      "gothic",
      "old_town",
      "parish_church"
    ],
    "dominantColor": "#C36F62",
    "description": "Akwarela z 2016 roku przedstawiająca kościół farny św. Jana Chrzciciela w Radomiu. Obraz ukazuje gotycką bryłę świątyni od strony wschodniej w chłodnym, zimowym świetle. Artysta zastosował żywą, nietypową dla pory roku kolorystykę, nadając scenie ekspresyjny charakter.",
    "descriptionEn": "A 2016 watercolor depicting the Parish Church of St. John the Baptist in Radom. The painting shows the Gothic structure of the temple from the east in a cool, winter light. The artist used a vivid, unusual color palette for the season, giving the scene an expressive character.",
    "descriptionFr": "Aquarelle de 2016 représentant l'église paroissiale Saint-Jean-Baptiste à Radom. Le tableau montre la structure gothique du temple depuis l'est sous une lumière hivernale et fraîche. L'artiste a utilisé une palette de couleurs vives et inhabituelles pour la saison, donnant à la scène un caractère expressif.",
    "story": "Fara radomska to serce Starego Miasta i budynek, który malowałem wielokrotnie o różnych porach roku. W tej pracy chciałem poeksperymentować z kolorem. Mimo zimowej aury z nagimi drzewami, postanowiłem użyć ciepłych czerwieni i pomarańczy na murach, aby oddać historyczne ciepło i znaczenie tego miejsca, kontrastujące z chłodem otoczenia.",
    "storyEn": "The Radom Parish Church is the heart of the Old Town and a building I have painted many times in different seasons. In this work, I wanted to experiment with color. Despite the winter aura with bare trees, I decided to use warm reds and oranges on the walls to convey the historical warmth and significance of the place, contrasting with the coolness of the surroundings.",
    "storyFr": "L'église paroissiale de Radom est le cœur de la vieille ville et un bâtiment que j'ai peint de nombreuses fois à différentes saisons. Dans cette œuvre, j'ai voulu expérimenter avec la couleur. Malgré l'aura hivernale avec des arbres nus, j'ai décidé d'utiliser des rouges et des oranges chauds sur les murs pour transmettre la chaleur historique et l'importance du lieu, en contraste avec la fraîcheur de l'environnement.",
    "available": 1
  },
  {
    "id": "2017-mazowieckie-wierzby",
    "title": "Mazowieckie wierzby",
    "titleEn": "Masovian Willows",
    "titleFr": "Saules de Mazovie",
    "year": 2017,
    "imageUrl": "/attached_assets/59.avif",
    "imageUrls": ["/attached_assets/59.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "trees",
      "willows",
      "spring",
      "light",
      "shadow",
      "masovia"
    ],
    "dominantColor": "#979C56",
    "description": "Akwarela z 2017 roku przedstawiająca aleję charakterystycznych dla krajobrazu Mazowsza wierzb głowiastych. Praca ukazuje scenę wczesną wiosną, kiedy drzewa dopiero wypuszczają pierwsze liście. Artysta skupił się na grze światła i cienia na pniach drzew i młodej trawie.",
    "descriptionEn": "A 2017 watercolor depicting an alley of pollard willows, characteristic of the Masovian landscape. The work shows an early spring scene, when the trees are just beginning to sprout their first leaves. The artist focused on the play of light and shadow on the tree trunks and young grass.",
    "descriptionFr": "Aquarelle de 2017 représentant une allée de saules têtards, caractéristiques du paysage de Mazovie. L'œuvre montre une scène du début du printemps, lorsque les arbres commencent à peine à faire leurs premières feuilles. L'artiste s'est concentré sur le jeu de la lumière et de l'ombre sur les troncs d'arbres et l'herbe jeune.",
    "story": "Wierzby to prawdziwy symbol Mazowsza. Ich poskręcane pnie i charakterystyczne korony są niezwykle malownicze o każdej porze roku. W tej pracy chciałem uchwycić ten szczególny moment wczesnej wiosny, kiedy światło jest już mocne, a przyroda budzi się do życia. Cienie rzucane przez nagie jeszcze gałęzie tworzą na ziemi ciekawy, dynamiczny wzór.",
    "storyEn": "Willows are a true symbol of Masovia. Their twisted trunks and characteristic crowns are incredibly picturesque in every season. In this work, I wanted to capture that special moment of early spring when the light is already strong and nature is awakening. The shadows cast by the still-bare branches create an interesting, dynamic pattern on the ground.",
    "storyFr": "Les saules sont un véritable symbole de la Mazovie. Leurs troncs tordus et leurs cimes caractéristiques sont incroyablement pittoresques en toute saison. Dans cette œuvre, j'ai voulu capturer ce moment particulier du début du printemps où la lumière est déjà forte et la nature s'éveille. Les ombres projetées par les branches encore nues créent un motif intéressant et dynamique sur le sol.",
    "available": 1
  },
  {
    "id": "2018-panorama-glinic",
    "title": "Radom - Panorama Glinic",
    "titleEn": "Radom - Panorama of Glinice",
    "titleFr": "Radom - Panorama de Glinice",
    "year": 2018,
    "imageUrl": "/attached_assets/60.avif",
    "imageUrls": ["/attached_assets/60.avif"],
    "dimensions": "40 x 20 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "landscape",
      "summer",
      "panorama",
      "glinice"
    ],
    "dominantColor": "#A4B567",
    "description": "Panoramiczna akwarela z 2018 roku, przedstawiająca widok na radomską dzielnicę Glinice. Na pierwszym planie rozciąga się kwiecista, letnia łąka, a w oddali widać zwartą zabudowę dzielnicy z charakterystycznymi wieżami kościelnymi. Praca ma lekki, pogodny nastrój.",
    "descriptionEn": "A panoramic watercolor from 2018, depicting a view of the Glinice district in Radom. The foreground features a flowering summer meadow, and in the distance, the dense development of the district with its characteristic church towers is visible. The work has a light, cheerful mood.",
    "descriptionFr": "Aquarelle panoramique de 2018, représentant une vue du quartier de Glinice à Radom. Le premier plan présente une prairie d'été fleurie, et au loin, le développement dense du quartier avec ses clochers d'église caractéristiques est visible. L'œuvre dégage une atmosphère légère et joyeuse.",
    "story": "Glinice to jedna z najstarszych i najbardziej charakterystycznych dzielnic Radomia. Chciałem uchwycić ten widok, który łączy w sobie naturę z miastem. Złocista łąka na pierwszym planie tworzy piękny kontrast z panoramą dachów i wież w oddali. To obraz o tym, jak te dwa światy – przyrody i cywilizacji – przenikają się na obrzeżach miasta.",
    "storyEn": "Glinice is one of the oldest and most characteristic districts of Radom. I wanted to capture this view, which combines nature with the city. The golden meadow in the foreground creates a beautiful contrast with the panorama of rooftops and towers in the distance. It is a painting about how these two worlds – nature and civilization – interpenetrate on the outskirts of the city.",
    "storyFr": "Glinice est l'un des quartiers les plus anciens et les plus caractéristiques de Radom. Je voulais capturer cette vue, qui combine la nature et la ville. La prairie dorée au premier plan crée un beau contraste avec le panorama des toits et des tours au loin. C'est une peinture sur la façon dont ces deux mondes – la nature et la civilisation – s'interpénètrent à la périphérie de la ville.",
    "available": 1
  },
  {
    "id": "szkic-ilzanka-ruda",
    "title": "Szkic Iłżanki z mostu pod prąd",
    "titleEn": "Sketch of Iłżanka River, Upstream from the Bridge",
    "titleFr": "Croquis de la rivière Iłżanka, en amont du pont",
    "year": 2018,
    "imageUrl": "/attached_assets/61.avif",
    "imageUrls": ["/attached_assets/61.avif"],
    "dimensions": "30 x 22 cm",
    "technique": "ołówek",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "forest",
      "trees",
      "water",
      "river",
      "sketch",
      "reflection",
      "ruda",
      "ilzanka"
    ],
    "dominantColor": "#C8C8C8",
    "description": "Dynamiczny szkic ołówkiem przedstawiający rzekę Iłżankę we wsi Ruda, widzianą z mostu w kierunku pod prąd. Rysunek na grubym papierze (300 g/m²) koncentruje się na oddaniu gry świateł i cieni oraz drgających odbić drzew w wodzie za pomocą ekspresyjnej kreski.",
    "descriptionEn": "A dynamic pencil sketch depicting the Iłżanka River in the village of Ruda, seen from the bridge looking upstream. The drawing on thick paper (300 g/m²) focuses on rendering the play of light and shadow and the shimmering reflections of trees in the water using expressive lines.",
    "descriptionFr": "Croquis dynamique au crayon représentant la rivière Iłżanka dans le village de Ruda, vue depuis le pont en amont. Le dessin sur papier épais (300 g/m²) se concentre sur le rendu du jeu de la lumière et de l'ombre ainsi que des reflets chatoyants des arbres dans l'eau à l'aide de lignes expressives.",
    "story": "Ten szkic to szybki zapis wrażenia, studium do późniejszej pracy w kolorze. Czasem sam szkic ołówkiem potrafi najlepiej oddać istotę pejzażu – jego rytm, kontrasty i strukturę. W tym przypadku fascynowało mnie, jak za pomocą samej kreski oddać ruch wody i migotanie odbić leśnego gąszczu.",
    "storyEn": "This sketch is a quick record of an impression, a study for a later work in color. Sometimes a pencil sketch itself can best capture the essence of a landscape—its rhythm, contrasts, and structure. In this case, I was fascinated by how to convey the movement of water and the flicker of the dense forest's reflection using only lines.",
    "storyFr": "Ce croquis est un enregistrement rapide d'une impression, une étude pour un travail ultérieur en couleur. Parfois, un simple croquis au crayon peut le mieux capturer l'essence d'un paysage - son rythme, ses contrastes et sa structure. Dans ce cas, j'ai été fasciné par la manière de transmettre le mouvement de l'eau et le scintillement du reflet de la forêt dense en utilisant uniquement des lignes.",
    "available": 1
  },
  {
    "id": "2017-droga-z-wierzbami-rysunek",
    "title": "Droga z wierzbami",
    "titleEn": "Road with Willows",
    "titleFr": "Route avec des saules",
    "year": 2017,
    "imageUrl": "/attached_assets/62.avif",
    "imageUrls": ["/attached_assets/62.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "landscape",
      "nature",
      "trees",
      "willows",
      "winter",
      "path",
      "masovia",
      "sketch"
    ],
    "dominantColor": "#A57B5B",
    "description": "Rysunek piórkiem lawowany sepią z 2017 roku, przedstawiający aleję mazowieckich wierzb w zimowej scenerii. Praca łączy precyzję kreski piórka z malarskimi efektami lawowania, co nadaje scenie głębi i nostalgicznego nastroju.",
    "descriptionEn": "A 2017 sepia ink wash drawing, depicting an alley of Masovian willows in a winter setting. The work combines the precision of pen lines with the painterly effects of ink wash, giving the scene depth and a nostalgic mood.",
    "descriptionFr": "Un dessin lavis à l'encre sépia de 2017, représentant une allée de saules de Mazovie dans un décor hivernal. L'œuvre combine la précision des traits de plume avec les effets picturaux du lavis, donnant à la scène profondeur et une ambiance nostalgique.",
    "story": "Droga z wierzbami - rysunek piórkiem sępią lawowany - 2017. Ta technika pozwala mi na połączenie rysunku z malarstwem. Kontur piórkiem nadaje formę, a lawowanie sepią buduje nastrój, światło i cienie. Wierzby to temat, do którego ciągle wracam, a ta praca jest próbą uchwycenia ich zimowego, nieco surowego piękna.",
    "storyEn": "Road with willows - sepia pen and wash drawing - 2017. This technique allows me to combine drawing with painting. The pen outline gives form, while the sepia wash builds mood, light, and shadow. Willows are a theme I constantly return to, and this work is an attempt to capture their winter, somewhat stark beauty.",
    "storyFr": "Route avec des saules - dessin à la plume sépia et lavis - 2017. Cette technique me permet de combiner le dessin et la peinture. Le contour à la plume donne la forme, tandis que le lavis sépia construit l'ambiance, la lumière et les ombres. Les saules sont un thème auquel je reviens constamment, et cette œuvre est une tentative de capturer leur beauté hivernale, un peu austère.",
    "available": 1
  },
  {
    "id": "1985-portret-syna-ernesta",
    "title": "Portret syna Ernesta",
    "titleEn": "Portrait of my son Ernest",
    "titleFr": "Portrait de mon fils Ernest",
    "year": 1985,
    "imageUrl": "/attached_assets/63.avif",
    "imageUrls": ["/attached_assets/63.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": ["portrait", "sketch", "family", "son", "childhood", "pencil"],
    "dominantColor": "#BEBEBE",
    "description": "Delikatny, pełen emocji szkic ołówkiem z 1985 roku, przedstawiający najstarszego syna artysty, Ernesta. Rysunek z czułością oddaje dziecięcą zadumę i niewinność, koncentrując się na subtelnej grze światła na twarzy dziecka.",
    "descriptionEn": "A delicate, emotional pencil sketch from 1985, depicting the artist's eldest son, Ernest. The drawing tenderly captures childhood contemplation and innocence, focusing on the subtle play of light on the child's face.",
    "descriptionFr": "Un croquis au crayon délicat et émouvant de 1985, représentant le fils aîné de l'artiste, Ernest. Le dessin capture avec tendresse la contemplation et l'innocence de l'enfance, en se concentrant sur le jeu subtil de la lumière sur le visage de l'enfant.",
    "story": "Portret mojego najstarszego syna Ernesta - rysunek z 1985 roku. To jeden z wielu portretów rodzinnych, które mają dla mnie szczególne znaczenie. Ołówek pozwala uchwycić ulotne chwile i emocje w najbardziej bezpośredni sposób.",
    "storyEn": "Portrait of my eldest son Ernest - a drawing from 1985. This is one of many family portraits that hold special meaning for me. The pencil allows for capturing fleeting moments and emotions in the most direct way.",
    "storyFr": "Portrait de mon fils aîné Ernest - un dessin de 1985. C'est l'un des nombreux portraits de famille qui ont une signification particulière pour moi. Le crayon permet de capturer les moments fugaces et les émotions de la manière la plus directe.",
    "available": 1
  },
  {
    "id": "2016-zlota-polska-jesien",
    "title": "Złota Polska jesień",
    "titleEn": "Golden Polish Autumn",
    "titleFr": "Automne doré polonais",
    "year": 2016,
    "imageUrl": "/attached_assets/64.avif",
    "imageUrls": ["/attached_assets/64.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": ["landscape", "autumn", "forest", "trees", "path", "nature"],
    "dominantColor": "#A17A3E",
    "description": "Rysunek z 2016 roku wykonany piórkiem i lawowany sepią. Praca przedstawia leśną ścieżkę w scenerii złotej polskiej jesieni. Ciepła, monochromatyczna kolorystyka i gra światła podkreślają urok i nastrój tej pory roku.",
    "descriptionEn": "A 2016 drawing made with pen and sepia wash. The work depicts a forest path in the setting of a golden Polish autumn. The warm, monochromatic color scheme and play of light emphasize the charm and mood of this season.",
    "descriptionFr": "Un dessin de 2016 réalisé à la plume et au lavis sépia. L'œuvre représente un sentier forestier dans le décor d'un automne doré polonais. La palette de couleurs chaudes et monochromes et le jeu de lumière soulignent le charme et l'ambiance de cette saison.",
    "story": "Złota Polska jesień - rysunek piórkiem, sępią lawowany 2016. Uwielbiam tę porę roku za jej niezwykłe światło i kolory. Technika lawowania sepią pozwala w subtelny sposób oddać ciepłą atmosferę jesiennego lasu, jego zapach i spokój.",
    "storyEn": "Golden Polish Autumn - a 2016 pen and sepia wash drawing. I love this time of year for its extraordinary light and colors. The sepia wash technique allows for a subtle rendering of the warm atmosphere of an autumn forest, its scent, and tranquility.",
    "storyFr": "Automne doré polonais - un dessin à la plume et au lavis sépia de 2016. J'adore cette période de l'année pour sa lumière et ses couleurs extraordinaires. La technique du lavis sépia permet de rendre subtilement l'atmosphère chaleureuse d'une forêt d'automne, son parfum et sa tranquillité.",
    "available": 1
  },
  {
    "id": "2015-radom-fara-wiosna",
    "title": "Radom Fara (wiosna)",
    "titleEn": "Radom - Parish Church (Spring)",
    "titleFr": "Radom - Église paroissiale (Printemps)",
    "year": 2015,
    "imageUrl": "/attached_assets/65.avif",
    "imageUrls": ["/attached_assets/65.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "sacred_art",
      "church",
      "gothic",
      "old_town",
      "parish_church",
      "spring",
      "trees"
    ],
    "dominantColor": "#A95C5C",
    "description": "Akwarela z 2015 roku przedstawiająca radomską Farę w scenerii wczesnej wiosny. Artysta uchwycił moment, gdy nagie gałęzie drzew pokrywają się delikatnym, różowym kwieciem, tworząc malowniczy kontrast z gotycką bryłą kościoła i jego zielonymi dachami.",
    "descriptionEn": "A 2015 watercolor depicting the Radom Parish Church in an early spring setting. The artist captured the moment when the bare branches of the trees are covered with delicate, pink blossoms, creating a picturesque contrast with the Gothic body of the church and its green roofs.",
    "descriptionFr": "Aquarelle de 2015 représentant l'église paroissiale de Radom dans un décor de début de printemps. L'artiste a capturé le moment où les branches nues des arbres se couvrent de délicates fleurs roses, créant un contraste pittoresque avec le corps gothique de l'église et ses toits verts.",
    "story": "Radom Fara - akwarela 2015. To jedno z moich ulubionych ujęć radomskiej fary, zwłaszcza o tej porze roku, kiedy przyroda budzi się do życia. Chciałem oddać ten radosny, wiosenny nastrój za pomocą żywych kolorów i dynamicznej kompozycji.",
    "storyEn": "Radom Parish Church - watercolor 2015. This is one of my favorite views of the Radom Parish Church, especially at this time of year when nature comes to life. I wanted to convey this joyful, spring mood through vibrant colors and a dynamic composition.",
    "storyFr": "Église paroissiale de Radom - aquarelle 2015. C'est l'une de mes vues préférées de l'église paroissiale de Radom, surtout à cette période de l'année où la nature s'éveille. J'ai voulu transmettre cette ambiance joyeuse et printanière à travers des couleurs vives et une composition dynamique.",
    "available": 1
  },
  {
    "id": "1973-wielki-konkurs",
    "title": "Wielki konkurs",
    "titleEn": "The Great Competition",
    "titleFr": "Le Grand Concours",
    "year": 1973,
    "imageUrl": "/attached_assets/66.avif",
    "imageUrls": ["/attached_assets/66.avif"],
    "dimensions": "70 x 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["radom", "hometown", "city", "childhood", "staffage"],
    "dominantColor": "#B4A28B",
    "description": "Akwarela z 1973 roku, dokumentująca konkurs rysunku kredą na jezdni zorganizowany przez gazetę 'Życie Radomskie' w Radomiu. Praca z czułością oddaje atmosferę dziecięcej zabawy i twórczej energii.",
    "descriptionEn": "A 1973 watercolor documenting a chalk drawing competition on the road, organized by the 'Życie Radomskie' newspaper in Radom. The work tenderly captures the atmosphere of children's play and creative energy.",
    "descriptionFr": "Aquarelle de 1973 documentant un concours de dessin à la craie sur la chaussée, organisé par le journal 'Życie Radomskie' à Radom. L'œuvre capture avec tendresse l'atmosphère du jeu et de l'énergie créatrice des enfants.",
    "story": "Wielki konkurs - akwarela 1973 Radom. To praca o charakterze dokumentalnym. Przedstawia konkurs rysunku kredą na jezdni, zorganizowany przez gazetę 'Życie Radomskie'. Chciałem uchwycić tę niezwykłą atmosferę, pełną radości i twórczej pasji najmłodszych.",
    "storyEn": "The Great Competition - watercolor 1973 Radom. This is a documentary-style work. It depicts a chalk drawing competition on the road, organized by the 'Życie Radomskie' newspaper. I wanted to capture that extraordinary atmosphere, full of joy and the creative passion of the youngest participants.",
    "storyFr": "Le Grand Concours - aquarelle 1973 Radom. Il s'agit d'une œuvre de style documentaire. Elle dépeint un concours de dessin à la craie sur la chaussée, organisé par le journal 'Życie Radomskie'. Je voulais capturer cette atmosphère extraordinaire, pleine de joie et de la passion créative des plus jeunes.",
    "available": 1
  },
  {
    "id": "2011-radom-kosciol-garnizonowy",
    "title": "Radom. Kościół Garnizonowy od ul. Piłsudskiego",
    "titleEn": "Radom. Garrison Church from Piłsudskiego Street",
    "titleFr": "Radom. Église de la Garnison vue de la rue Piłsudskiego",
    "year": 2011,
    "imageUrl": "/attached_assets/67.avif",
    "imageUrls": ["/attached_assets/67.avif"],
    "dimensions": "70 x 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "sacred_art",
      "church",
      "summer",
      "light",
      "shadow"
    ],
    "dominantColor": "#D7B66D",
    "description": "Akwarela z 2011 roku przedstawiająca Kościół Garnizonowy św. Stanisława Biskupa w Radomiu, widziany od strony ulicy Piłsudskiego. Praca ukazuje klasycystyczną architekturę świątyni w słoneczny, letni dzień, z mocno zaznaczoną grą światła i cienia.",
    "descriptionEn": "A 2011 watercolor depicting the Garrison Church of St. Stanislaus the Bishop in Radom, seen from Piłsudskiego Street. The work showcases the classicist architecture of the temple on a sunny summer day, with a strong play of light and shadow.",
    "descriptionFr": "Aquarelle de 2011 représentant l'église de la Garnison Saint-Stanislas-l'Évêque à Radom, vue de la rue Piłsudskiego. L'œuvre met en valeur l'architecture classique du temple par une journée d'été ensoleillée, avec un fort jeu de lumière et d'ombre.",
    "story": "Radom. Kościół Garnizonowy od ul. Piłsudskiego - akwarela 2011. To jeden z najbardziej charakterystycznych budynków w centrum Radomia. Zawsze fascynowała mnie jego monumentalna bryła i gra światłocienia na placu przed nim.",
    "storyEn": "Radom. Garrison Church from Piłsudskiego Street - watercolor 2011. This is one of the most characteristic buildings in the center of Radom. I have always been fascinated by its monumental form and the play of light and shadow on the square in front of it.",
    "storyFr": "Radom. Église de la Garnison vue de la rue Piłsudskiego - aquarelle 2011. C'est l'un des bâtiments les plus caractéristiques du centre de Radom. J'ai toujours été fasciné par sa forme monumentale et le jeu de lumière et d'ombre sur la place devant.",
    "available": 1
  },
  {
    "id": "2016-jesienny-pejzaz-z-wierzbami-akwarela",
    "title": "Jesienny pejzaż z wierzbami",
    "titleEn": "Autumn Landscape with Willows",
    "titleFr": "Paysage d'automne avec des saules",
    "year": 2016,
    "imageUrl": "/attached_assets/68.avif",
    "imageUrls": ["/attached_assets/68.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "autumn",
      "trees",
      "willows",
      "light",
      "shadow",
      "rural",
      "path"
    ],
    "dominantColor": "#7D7A4D",
    "description": "Akwarela z 2016 roku przedstawiająca aleję starych wierzb w ciepłym świetle jesiennego popołudnia. Artysta mistrzowsko uchwycił grę światła i cienia, z długimi cieniami rzucanymi przez nagie konary na wiejską drogę.",
    "descriptionEn": "A 2016 watercolor depicting an alley of old willows in the warm light of an autumn afternoon. The artist masterfully captures the play of light and shadow, with long shadows cast by the bare branches onto the country road.",
    "descriptionFr": "Aquarelle de 2016 représentant une allée de vieux saules dans la lumière chaude d'un après-midi d'automne. L'artiste capture avec maîtrise le jeu de la lumière et de l'ombre, avec de longues ombres projetées par les branches nues sur le chemin de campagne.",
    "story": "Jesienny pejzaż z wierzbami - akwarela 2016. To kolejny obraz z mojego ulubionego cyklu z wierzbami. W tej pracy kluczowe było dla mnie oddanie atmosfery i światła późnej jesieni, kiedy słońce stoi nisko nad horyzontem.",
    "storyEn": "Autumn landscape with willows - watercolor 2016. This is another painting from my favorite series with willows. In this work, it was key for me to convey the atmosphere and light of late autumn, when the sun is low on the horizon.",
    "storyFr": "Paysage d'automne avec des saules - aquarelle 2016. C'est une autre peinture de ma série préférée avec des saules. Dans cette œuvre, il était essentiel pour moi de transmettre l'atmosphère et la lumière de la fin de l'automne, lorsque le soleil est bas sur l'horizon.",
    "available": 1
  },
  {
    "id": "2009-stara-plebania-odechow",
    "title": "Stara plebania w Odechowie",
    "titleEn": "The Old Rectory in Odechów",
    "titleFr": "L'Ancien Presbytère d'Odechów",
    "year": 2009,
    "imageUrl": "/attached_assets/69.avif",
    "imageUrls": ["/attached_assets/69.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "rural",
      "landscape",
      "ruins",
      "odechow",
      "autumn",
      "sky",
      "clouds"
    ],
    "dominantColor": "#BFA87E",
    "description": "Akwarela z 2009 roku przedstawiająca starą, niszczejącą plebanię w Odechowie. Artysta uchwycił budynek w surowej, jesiennej aurze, z nagimi drzewami i dramatycznym niebem. Wrak samochodu na pierwszym planie potęguje wrażenie opuszczenia i upływu czasu.",
    "descriptionEn": "A 2009 watercolor depicting the old, decaying rectory in Odechów. The artist has captured the building in a stark, autumnal atmosphere, with bare trees and a dramatic sky. The car wreck in the foreground enhances the sense of abandonment and the passage of time.",
    "descriptionFr": "Aquarelle de 2009 représentant l'ancien presbytère en ruine d'Odechów. L'artiste a capturé le bâtiment dans une atmosphère automnale austère, avec des arbres nus et un ciel dramatique. L'épave de voiture au premier plan renforce le sentiment d'abandon et le passage du temps.",
    "story": "Stara plebania w Odechowie - akwarela 2009. Szkoda, że idzie ku ruinie i nie odnawiają jej.",
    "storyEn": "The Old Rectory in Odechów - watercolor 2009. It's a shame it's falling into ruin and they are not renovating it.",
    "storyFr": "L'Ancien Presbytère d'Odechów - aquarelle 2009. C'est dommage qu'il tombe en ruine et qu'on ne le rénove pas.",
    "available": 1
  },
  {
    "id": "2010-rysunek-piorkiem-ruda",
    "title": "Zimowy las w Rudzie nad Iłżanką",
    "titleEn": "Winter Forest in Ruda on the Iłżanka",
    "titleFr": "Forêt d'hiver à Ruda sur l'Iłżanka",
    "year": 2010,
    "imageUrl": "/attached_assets/70.avif",
    "imageUrls": ["/attached_assets/70.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_piorkiem",
    "substrate": "paper",
    "tags": [
      "landscape",
      "winter",
      "forest",
      "trees",
      "sketch",
      "ruda",
      "ilzanka",
      "nature"
    ],
    "dominantColor": "#D3D3D3",
    "description": "Rysunek piórkiem w kolorze sepii, wykonany w 2010 roku. Praca przedstawia zimowy krajobraz leśny w miejscowości Ruda nad Iłżanką. Za pomocą ekspresyjnej kreski artysta oddał surowy charakter i graficzną strukturę nagich drzew.",
    "descriptionEn": "A sepia ink pen drawing from 2010. The work depicts a winter forest landscape in Ruda on the Iłżanka River. Using expressive lines, the artist conveyed the raw character and graphic structure of the bare trees.",
    "descriptionFr": "Un dessin à la plume et à l'encre sépia de 2010. L'œuvre dépeint un paysage forestier hivernal à Ruda sur la rivière Iłżanka. Par des lignes expressives, l'artiste a rendu le caractère brut et la structure graphique des arbres dénudés.",
    "story": "Rysunek piórkiem - sepia 2010 - Ruda n/Iłżanką. To szybki szkic z natury, próba uchwycenia piękna i prostoty zimowego lasu, gdzie główną rolę odgrywa linia i kontrast.",
    "storyEn": "Pen drawing - sepia 2010 - Ruda on the Iłżanka. This is a quick sketch from nature, an attempt to capture the beauty and simplicity of a winter forest, where line and contrast play the main role.",
    "storyFr": "Dessin à la plume - sépia 2010 - Ruda sur l'Iłżanka. Il s'agit d'un croquis rapide d'après nature, une tentative de capturer la beauté et la simplicité d'une forêt d'hiver, où la ligne et le contraste jouent le rôle principal.",
    "available": 1
  },
  {
    "id": "2012-zakole-ilzanki-2",
    "title": "Zakole Iłżanki 2",
    "titleEn": "Bend of the Iłżanka River II",
    "titleFr": "Mécandre de l'Iłżanka II",
    "year": 2012,
    "imageUrl": "/attached_assets/71.avif",
    "imageUrls": ["/attached_assets/71.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "forest",
      "trees",
      "water",
      "river",
      "ilzanka",
      "ruda",
      "kazanow",
      "reflection"
    ],
    "dominantColor": "#7DB4C4",
    "description": "Akwarela z 2012 roku przedstawiająca zimowy pejzaż z zakolem rzeki Iłżanki w Rudzie. Artysta uchwycił grę światła na śniegu i lodzie oraz dynamiczne odbicia drzew w wodzie, tworząc pełen życia, mroźny krajobraz.",
    "descriptionEn": "A 2012 watercolor depicting a winter landscape with a bend in the Iłżanka river in Ruda. The artist captured the play of light on the snow and ice, and the dynamic reflections of the trees in the water, creating a vibrant, frosty scene.",
    "descriptionFr": "Aquarelle de 2012 représentant un paysage d'hiver avec un méandre de la rivière Iłżanka à Ruda. L'artiste a capturé le jeu de la lumière sur la neige et la glace, ainsi que les reflets dynamiques des arbres dans l'eau, créant une scène hivernale pleine de vie.",
    "story": "Zakole Iłżanki 2 - akwarela 2012 - Ruda gm. Kazanów. Zima nad moją ukochaną rzeką Iłżanką zawsze dostarcza wielu malarskich inspiracji. W tej pracy chciałem oddać kontrast między chłodem śniegu a energią płynącej wody.",
    "storyEn": "Bend of the Iłżanka River 2 - watercolor 2012 - Ruda, Kazanów municipality. Winter on my beloved Iłżanka river always provides a lot of artistic inspiration. In this work, I wanted to convey the contrast between the coldness of the snow and the energy of the flowing water.",
    "storyFr": "Mécandre de l'Iłżanka II - aquarelle 2012 - Ruda, commune de Kazanów. L'hiver sur ma rivière bien-aimée, l'Iłżanka, est toujours une grande source d'inspiration artistique. Dans cette œuvre, j'ai voulu transmettre le contraste entre la froideur de la neige et l'énergie de l'eau vive.",
    "available": 1
  },
  {
    "id": "2013-puszcza-kozienicka",
    "title": "Fragment Puszczy Kozienickiej",
    "titleEn": "A Fragment of the Kozienice Forest",
    "titleFr": "Un fragment de la forêt de Kozienice",
    "year": 2013,
    "imageUrl": "/attached_assets/72.avif",
    "imageUrls": ["/attached_assets/72.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "forest",
      "nature",
      "trees",
      "light",
      "shadow",
      "dabrowa_kozlowska",
      "puszcza_kozienicka",
      "kozlow"
    ],
    "dominantColor": "#9A915D",
    "description": "Akwarela z 2013 roku przedstawiająca fragment Puszczy Kozienickiej w okolicach Dąbrowy Kozłowskiej i Kozłowa. Na pierwszym planie widoczny jest powalony, omszały pień drzewa, a w tle wysokie sosny, przez które przebija się światło, tworząc magiczną atmosferę.",
    "descriptionEn": "A 2013 watercolor depicting a fragment of the Kozienice Forest near Dąbrowa Kozłowska and Kozłów. In the foreground is a fallen, mossy tree trunk, and in the background are tall pine trees through which light filters, creating a magical atmosphere.",
    "descriptionFr": "Aquarelle de 2013 représentant un fragment de la forêt de Kozienice près de Dąbrowa Kozłowska et Kozłów. Au premier plan se trouve un tronc d'arbre tombé et couvert de mousse, et à l'arrière-plan de grands pins à travers lesquels la lumière filtre, créant une atmosphère magique.",
    "story": "Fragment Puszczy Kozienickiej - akwarela 2013 - okolice Dąbrowy Kozłowskiej i Kozłowa. Puszcza ma w sobie niezwykłą dzikość i piękno. Ten powalony, omszały gigant na pierwszym planie opowiada historię o upływie czasu i sile natury.",
    "storyEn": "A fragment of the Kozienice Forest - watercolor 2013 - vicinity of Dąbrowa Kozłowska and Kozłów. The forest has an extraordinary wildness and beauty. This fallen, mossy giant in the foreground tells a story about the passage of time and the power of nature.",
    "storyFr": "Un fragment de la forêt de Kozienice - aquarelle 2013 - environs de Dąbrowa Kozłowska et Kozłów. La forêt possède une sauvagerie et une beauté extraordinaires. Ce géant tombé et couvert de mousse au premier plan raconte une histoire sur le passage du temps et la puissance de la nature.",
    "available": 1
  },
  {
    "id": "2016-na-rozstaju-drog",
    "title": "Na rozstaju dróg",
    "titleEn": "At the Crossroads",
    "titleFr": "À la croisée des chemins",
    "year": 2016,
    "imageUrl": "/attached_assets/73.avif",
    "imageUrls": ["/attached_assets/73.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "autumn",
      "forest",
      "trees",
      "path",
      "light",
      "shadow",
      "sacred_art",
      "ruda",
      "ilzanka",
      "kazanow",
      "cross"
    ],
    "dominantColor": "#D4A24E",
    "description": "Akwarela z 2016 roku przedstawiająca przydrożny, drewniany krzyż na rozstaju dróg w jesiennym lesie we wsi Ruda. Praca, namalowana w ciepłych, złotych barwach, oddaje nostalgiczny i refleksyjny nastrój wiejskiego krajobrazu.",
    "descriptionEn": "A 2016 watercolor depicting a roadside wooden cross at a crossroads in an autumn forest in the village of Ruda. The work, painted in warm, golden colors, conveys the nostalgic and reflective mood of the rural landscape.",
    "descriptionFr": "Aquarelle de 2016 représentant une croix en bois au bord de la route à une croisée des chemins dans une forêt d'automne dans le village de Ruda. L'œuvre, peinte dans des tons chauds et dorés, transmet l'ambiance nostalgique et réfléchie du paysage rural.",
    "story": "Na rozstaju dróg, gdzie drewniany Chrystus stał. Zapytałem dokąd iść ? Frasobliwą minę miał.... - akwarela 2016 wieś Ruda n/Iłżanką gm. Kazanów.",
    "storyEn": "At the crossroads, where a wooden Christ stood. I asked where to go? He had a sorrowful face.... - watercolor 2016, village of Ruda on the Iłżanka river, Kazanów municipality.",
    "storyFr": "À la croisée des chemins, où se tenait un Christ en bois. J'ai demandé où aller ? Il avait un visage affligé.... - aquarelle 2016, village de Ruda sur la rivière Iłżanka, commune de Kazanów.",
    "available": 1
  },
  {
    "id": "2009-gajowy-wg-brandta",
    "title": "Gajowy (wg. J. Brandta)",
    "titleEn": "Forester (after J. Brandt)",
    "titleFr": "Garde forestier (d'après J. Brandt)",
    "year": 2009,
    "imageUrl": "/attached_assets/74.avif",
    "imageUrls": ["/attached_assets/74.avif"],
    "dimensions": "70 x 50 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "animals",
      "horses",
      "study",
      "brandt",
      "historical",
      "hunting"
    ],
    "dominantColor": "#9B8D6B",
    "description": "Akwarela z 2009 roku, będąca studium dzieła Józefa Brandta. Obraz przedstawia dynamiczną scenę z gajowym na siwym koniu, w towarzystwie psa myśliwskiego. W tle widać tabor i rozległy, polski krajobraz.",
    "descriptionEn": "A 2009 watercolor, which is a study of a work by Józef Brandt. The painting depicts a dynamic scene with a forester on a gray horse, accompanied by a hunting dog. In the background, a wagon train and a vast Polish landscape are visible.",
    "descriptionFr": "Aquarelle de 2009, qui est une étude d'une œuvre de Józef Brandt. Le tableau dépeint une scène dynamique avec un garde forestier sur un cheval gris, accompagné d'un chien de chasse. À l'arrière-plan, un convoi de chariots et un vaste paysage polonais sont visibles.",
    "story": "Gajowy - akwarela wg. J. Brandta 2009. Kopiowanie prac wielkich mistrzów, takich jak Józef Brandt, to dla mnie forma dialogu z historią polskiego malarstwa i nieustanna nauka warsztatu.",
    "storyEn": "Forester - watercolor after J. Brandt 2009. Copying the works of great masters like Józef Brandt is for me a form of dialogue with the history of Polish painting and a continuous learning of the craft.",
    "storyFr": "Garde forestier - aquarelle d'après J. Brandt 2009. Copier les œuvres de grands maîtres comme Józef Brandt est pour moi une forme de dialogue avec l'histoire de la peinture polonaise et un apprentissage continu du métier.",
    "available": 1
  },
  {
    "id": "2015-radom-zeromskiego-rwanska",
    "title": "Radom - ul. Żeromskiego w kierunku ul. Rwańskiej",
    "titleEn": "Radom - Żeromskiego Street towards Rwańska Street",
    "titleFr": "Radom - Rue Żeromskiego vers la rue Rwańska",
    "year": 2015,
    "imageUrl": "/attached_assets/75.avif",
    "imageUrls": ["/attached_assets/75.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "old_town",
      "sketch",
      "zeromskiego_street",
      "rwanska_street"
    ],
    "dominantColor": "#A17A68",
    "description": "Rysunek piórkiem lawowany sepią z 2015 roku, przedstawiający widok z radomskiej ulicy Żeromskiego w kierunku ulicy Rwańskiej. Praca w monochromatycznej, ciepłej tonacji oddaje historyczny charakter i architekturę centrum miasta.",
    "descriptionEn": "A 2015 sepia pen and wash drawing, showing the view from Żeromskiego Street towards Rwańska Street in Radom. The work, in a monochromatic, warm tone, conveys the historical character and architecture of the city center.",
    "descriptionFr": "Un dessin à la plume et au lavis sépia de 2015, montrant la vue de la rue Żeromskiego vers la rue Rwańska à Radom. L'œuvre, dans un ton chaud et monochrome, transmet le caractère historique et l'architecture du centre-ville.",
    "story": "Radom - ul. Żeromskiego w kierunku ul. Rwańskiej - rysunek piórkiem sepią lawowany 2015. To jedno z najbardziej rozpoznawalnych i malowniczych miejsc w Radomiu. Starałem się uchwycić perspektywę i detale architektoniczne, które tworzą niepowtarzalny klimat tej części miasta.",
    "storyEn": "Radom - Żeromskiego Street towards Rwańska Street - sepia pen and wash drawing 2015. This is one of the most recognizable and picturesque places in Radom. I tried to capture the perspective and architectural details that create the unique atmosphere of this part of the city.",
    "storyFr": "Radom - Rue Żeromskiego vers la rue Rwańska - dessin à la plume et lavis sépia 2015. C'est l'un des endroits les plus reconnaissables et pittoresques de Radom. J'ai essayé de capturer la perspective et les détails architecturaux qui créent l'atmosphère unique de cette partie de la ville.",
    "available": 1
  },
  {
    "id": "2017-wierzby-rysunek-lawowany",
    "title": "Wierzby",
    "titleEn": "Willows",
    "titleFr": "Saules",
    "year": 2017,
    "imageUrl": "/attached_assets/76.avif",
    "imageUrls": ["/attached_assets/76.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "landscape",
      "nature",
      "trees",
      "willows",
      "water",
      "reflection",
      "winter",
      "masovia"
    ],
    "dominantColor": "#8B6C5C",
    "description": "Rysunek piórkiem lawowany sepią z 2017 roku. Praca przedstawia szpaler starych, mazowieckich wierzb, których konary odbijają się w wodzie rozlewiska. Monochromatyczna kolorystyka i połączenie precyzyjnej kreski z malarską plamą podkreślają surowy, nostalgiczny klimat sceny.",
    "descriptionEn": "A 2017 sepia pen and wash drawing. The work depicts a line of old Masovian willows whose branches are reflected in the water of a floodplain. The monochromatic color scheme and the combination of precise lines with painterly washes emphasize the raw, nostalgic atmosphere of the scene.",
    "descriptionFr": "Un dessin à la plume et au lavis sépia de 2017. L'œuvre représente une rangée de vieux saules de Mazovie dont les branches se reflètent dans l'eau d'une plaine inondable. La palette de couleurs monochromes et la combinaison de lignes précises avec des lavis picturaux soulignent l'atmosphère brute et nostalgique de la scène.",
    "story": "Wierzby - rysunek piórkiem, lawowany sepią - 2017. To jeden z moich ulubionych motywów, który pozwala na studium formy, światła i odbić w wodzie przy użyciu ograniczonej palety barw.",
    "storyEn": "Willows - pen drawing, sepia wash - 2017. This is one of my favorite motifs, which allows for the study of form, light, and reflections in water using a limited color palette.",
    "storyFr": "Saules - dessin à la plume, lavis sépia - 2017. C'est l'un de mes motifs préférés, qui permet d'étudier la forme, la lumière et les reflets dans l'eau en utilisant une palette de couleurs limitée.",
    "available": 1
  },
  {
    "id": "2017-rekonstrukcja-zamku-radom",
    "title": "Rekonstrukcja Radomskiego Zamku",
    "titleEn": "Reconstruction of the Radom Castle",
    "titleFr": "Reconstruction du Château de Radom",
    "year": 2017,
    "imageUrl": "/attached_assets/77.avif",
    "imageUrls": ["/attached_assets/77.avif"],
    "dimensions": "38 x 28 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "castle",
      "architecture",
      "reconstruction",
      "historical",
      "gothic",
      "water",
      "reflection",
      "animals",
      "horses"
    ],
    "dominantColor": "#D98C4A",
    "description": "Artystyczna wizja zrekonstruowanego Zamku Królewskiego w Radomiu. Akwarela z 2017 roku ukazuje gotycką budowlę z jej wieżami i murami, otoczoną fosą. Dynamiczna scena z końmi na pierwszym planie ożywia historyczny krajobraz.",
    "descriptionEn": "An artistic vision of the reconstructed Royal Castle in Radom. The 2017 watercolor shows the Gothic structure with its towers and walls, surrounded by a moat. The dynamic scene with horses in the foreground brings the historical landscape to life.",
    "descriptionFr": "Une vision artistique du château royal reconstruit à Radom. L'aquarelle de 2017 montre la structure gothique avec ses tours et ses murs, entourée de douves. La scène dynamique avec des chevaux au premier plan anime le paysage historique.",
    "story": "Rekonstrukcja Radomskiego Zamku - akwarela 2017. To moja próba odtworzenia na papierze jednego z najważniejszych zabytków w historii Radomia. Chciałem pokazać, jak mógł wyglądać w czasach swojej świetności.",
    "storyEn": "Reconstruction of the Radom Castle - watercolor 2017. This is my attempt to recreate on paper one of the most important monuments in the history of Radom. I wanted to show how it might have looked in its heyday.",
    "storyFr": "Reconstruction du Château de Radom - aquarelle 2017. C'est ma tentative de recréer sur papier l'un des monuments les plus importants de l'histoire de Radom. Je voulais montrer à quoi il aurait pu ressembler à son apogée.",
    "available": 1
  },
  {
    "id": "2016-dom-esterki-gaski",
    "title": "Dom Esterki i Gąski",
    "titleEn": "Esterka and Gąska Houses",
    "titleFr": "Maisons d'Esterka et Gąska",
    "year": 2016,
    "imageUrl": "/attached_assets/78.avif",
    "imageUrls": ["/attached_assets/78.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "radom",
      "hometown",
      "architecture",
      "city",
      "old_town",
      "historical",
      "baroque",
      "esterka_gaska_houses"
    ],
    "dominantColor": "#7A893D",
    "description": "Akwarela z 2016 roku przedstawiająca zabytkowe kamienice Dom Gąski i Dom Esterki przy radomskim Rynku. Artysta za pomocą żywych kolorów - czerwieni i zieleni - oddał charakterystyczny wygląd tych barokowych budynków w słoneczny, letni dzień.",
    "descriptionEn": "A 2016 watercolor depicting the historic Gąska and Esterka tenement houses in the Radom Market Square. The artist used vibrant colors - red and green - to capture the characteristic appearance of these baroque buildings on a sunny summer day.",
    "descriptionFr": "Aquarelle de 2016 représentant les maisons historiques de Gąska et Esterka sur la place du marché de Radom. L'artiste a utilisé des couleurs vives - rouge et vert - pour capturer l'aspect caractéristique de ces bâtiments baroques par une journée d'été ensoleillée.",
    "story": "Dom Esterki i Gąski - akwarela 2016. To jedne z najpiękniejszych i najbardziej malowniczych kamienic w Radomiu, prawdziwe perły baroku. Zawsze chciałem uwiecznić ich piękne, kolorowe fasady.",
    "storyEn": "Esterka and Gąska Houses - watercolor 2016. These are some of the most beautiful and picturesque tenement houses in Radom, true pearls of the Baroque. I have always wanted to capture their beautiful, colorful facades.",
    "storyFr": "Maisons d'Esterka et Gąska - aquarelle 2016. Ce sont parmi les plus belles et pittoresques maisons de Radom, de véritables perles du baroque. J'ai toujours voulu capturer leurs magnifiques façades colorées.",
    "available": 1
  },
  {
    "id": "2017-chalupa-pani-wziatek-rysunek",
    "title": "Chałupa Pani Wziątek",
    "titleEn": "Mrs. Wziątek's Cottage",
    "titleFr": "La Chaumière de Mme Wziątek",
    "year": 2017,
    "imageUrl": "/attached_assets/79.avif",
    "imageUrls": ["/attached_assets/79.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": [
      "rural",
      "cottage",
      "architecture",
      "sketch",
      "pencil",
      "ruda",
      "kazanow",
      "landscape"
    ],
    "dominantColor": "#D0D0D0",
    "description": "Rysunek ołówkiem z 2017 roku przedstawiający chałupę Pani Wziątek we wsi Ruda. Szkic z dbałością o detal oddaje fakturę starego drewna, krytego strzechą dachu i otoczenia, tworząc nostalgiczny portret zanikającej wiejskiej architektury.",
    "descriptionEn": "A 2017 pencil drawing depicting Mrs. Wziątek's cottage in the village of Ruda. The sketch, with attention to detail, captures the texture of the old wood, the thatched roof, and the surroundings, creating a nostalgic portrait of vanishing rural architecture.",
    "descriptionFr": "Un dessin au crayon de 2017 représentant la chaumière de Mme Wziątek dans le village de Ruda. Le croquis, avec une grande attention aux détails, capture la texture du vieux bois, du toit de chaume et de l'environnement, créant un portrait nostalgique de l'architecture rurale en voie de disparition.",
    "story": "Chałupa Pani Wziątek - rys. ołówek 2017. To miejsce bliskie memu sercu, które wielokrotnie szkicowałem. W tej pracy chciałem za pomocą ołówka oddać surowość i piękno prostoty tej starej, drewnianej chałupy.",
    "storyEn": "Mrs. Wziątek's Cottage - pencil drawing 2017. This place is close to my heart, and I have sketched it many times. In this work, I wanted to use a pencil to convey the rawness and beauty of the simplicity of this old wooden cottage.",
    "storyFr": "La Chaumière de Mme Wziątek - dessin au crayon 2017. Cet endroit m'est cher et je l'ai dessiné à de nombreuses reprises. Dans cette œuvre, je voulais utiliser le crayon pour transmettre la rusticité et la beauté de la simplicité de cette vieille chaumière en bois.",
    "available": 1
  },
  {
    "id": "2017-droga-z-wierzbami-olowek",
    "title": "Droga z wierzbami",
    "titleEn": "Road with Willows",
    "titleFr": "Route avec des saules",
    "year": 2017,
    "imageUrl": "/attached_assets/80.avif",
    "imageUrls": ["/attached_assets/80.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "trees",
      "willows",
      "path",
      "rural",
      "masovia",
      "sketch",
      "pencil"
    ],
    "dominantColor": "#BDBDBD",
    "description": "Dynamiczny szkic ołówkiem z 2017 roku, przedstawiający aleję głowiastych wierzb w zimowym krajobrazie. Ekspresyjna kreska oddaje surowy charakter ośnieżonej drogi i nagich konarów drzew.",
    "descriptionEn": "A dynamic pencil sketch from 2017, depicting an alley of pollard willows in a winter landscape. The expressive lines capture the raw character of the snowy road and the bare branches of the trees.",
    "descriptionFr": "Un croquis dynamique au crayon de 2017, représentant une allée de saules têtards dans un paysage hivernal. Les lignes expressives capturent le caractère brut de la route enneigée et des branches nues des arbres.",
    "story": "Droga z wierzbami - rysunek ołówkiem 2017 - 06-04-2017. Kolejne studium mojego ulubionego tematu mazowieckiego krajobrazu. Ołówek pozwala na uchwycenie gry światła i cienia w najbardziej surowej, graficznej formie.",
    "storyEn": "Road with Willows - pencil drawing 2017 - 04-06-2017. Another study of my favorite Masovian landscape theme. The pencil allows for capturing the play of light and shadow in its rawest, most graphic form.",
    "storyFr": "Route avec des saules - dessin au crayon 2017 - 06-04-2017. Une autre étude de mon thème de paysage mazovien préféré. Le crayon permet de capturer le jeu de la lumière et de l'ombre dans sa forme la plus brute et graphique.",
    "available": 1
  },
  {
    "id": "2017-chalupa-pani-wziatek-akwarela",
    "title": "Chałupa Pani Wziątek (wersja II)",
    "titleEn": "Mrs. Wziątek's Cottage (version II)",
    "titleFr": "La Chaumière de Mme Wziątek (version II)",
    "year": 2017,
    "imageUrl": "/attached_assets/81.avif",
    "imageUrls": ["/attached_assets/81.avif"],
    "dimensions": "26 x 18 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "rural",
      "cottage",
      "architecture",
      "ruda",
      "kazanow",
      "summer",
      "landscape",
      "nature"
    ],
    "dominantColor": "#B48F47",
    "description": "Druga wersja akwareli z 2017 roku, przedstawiająca chałupę Pani Wziątek we wsi Ruda. Praca, namalowana w żywych, letnich barwach, oddaje urok wiejskiego krajobrazu w pełnym słońcu.",
    "descriptionEn": "The second version of a 2017 watercolor, depicting Mrs. Wziątek's cottage in the village of Ruda. The work, painted in vibrant summer colors, captures the charm of the rural landscape in full sun.",
    "descriptionFr": "La deuxième version d'une aquarelle de 2017, représentant la chaumière de Mme Wziątek dans le village de Ruda. L'œuvre, peinte dans des couleurs estivales vives, capture le charme du paysage rural en plein soleil.",
    "story": "Chałupa pani Wziątek - akwarela 2017 - wieś Ruda - wersja II. To kolejne ujęcie tego samego, bliskiego mi miejsca. Tym razem chciałem oddać atmosferę ciepłego, letniego dnia, kiedy zieleń jest najbardziej soczysta, a światło podkreśla ciepłą barwę starego drewna.",
    "storyEn": "Mrs. Wziątek's cottage - watercolor 2017 - Ruda village - version II. This is another take on the same place that is dear to me. This time, I wanted to capture the atmosphere of a warm summer day, when the green is at its most lush, and the light emphasizes the warm color of the old wood.",
    "storyFr": "La chaumière de Mme Wziątek - aquarelle 2017 - village de Ruda - version II. C'est une autre vue du même endroit qui m'est cher. Cette fois, je voulais capturer l'atmosphère d'une chaude journée d'été, lorsque le vert est le plus luxuriant et que la lumière souligne la couleur chaude du vieux bois.",
    "available": 1
  },
  {
    "id": "1974-kazimierz-dolny-piorko",
    "title": "Kazimierz Dolny - Rynek",
    "titleEn": "Kazimierz Dolny - Market Square",
    "titleFr": "Kazimierz Dolny - Place du Marché",
    "year": 1974,
    "imageUrl": "/attached_assets/82.avif",
    "imageUrls": ["/attached_assets/82.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_piorkiem",
    "substrate": "paper",
    "tags": [
      "kazimierz_dolny",
      "city",
      "architecture",
      "sketch",
      "old_town",
      "market_square"
    ],
    "dominantColor": "#A9A9A9",
    "description": "Szkic piórkiem z 1974 roku, przedstawiający architekturę Rynku w Kazimierzu Dolnym. Dynamiczna, ekspresyjna kreska oddaje tętniącą życiem atmosferę miasteczka.",
    "descriptionEn": "A 1974 pen sketch depicting the architecture of the Market Square in Kazimierz Dolny. The dynamic, expressive lines capture the bustling atmosphere of the town.",
    "descriptionFr": "Un croquis à la plume de 1974 représentant l'architecture de la Place du Marché à Kazimierz Dolny. Les lignes dynamiques et expressives capturent l'atmosphère animée de la ville.",
    "story": "Rysunek piórkiem - Kazimierz Dolny 1974 rok. To jeden z moich wczesnych szkiców z Kazimierza, miejsca, do którego wracałem przez całe życie. Już wtedy fascynowała mnie jego niepowtarzalna architektura i klimat.",
    "storyEn": "Pen drawing - Kazimierz Dolny 1974. This is one of my early sketches from Kazimierz, a place I have returned to throughout my life. Even then, I was fascinated by its unique architecture and atmosphere.",
    "storyFr": "Dessin à la plume - Kazimierz Dolny 1974. C'est l'un de mes premiers croquis de Kazimierz, un endroit où je suis retourné toute ma vie. Déjà à l'époque, j'étais fasciné par son architecture et son atmosphère uniques.",
    "available": 1
  },
  {
    "id": "2017-wiosenne-brzozy-rysunek",
    "title": "Wiosenne brzozy",
    "titleEn": "Spring Birches",
    "titleFr": "Bouleaux de printemps",
    "year": 2017,
    "imageUrl": "/attached_assets/83.avif",
    "imageUrls": ["/attached_assets/83.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "landscape",
      "spring",
      "winter",
      "forest",
      "trees",
      "birches",
      "snow",
      "nature",
      "sketch"
    ],
    "dominantColor": "#A58A6F",
    "description": "Rysunek piórkiem lawowany sepią z 2017 roku. Praca przedstawia zagajnik brzóz w scenerii wczesnej wiosny, gdy na ziemi leżą jeszcze resztki śniegu. Monochromatyczna paleta sepii podkreśla graficzny charakter drzew i subtelną grę światła.",
    "descriptionEn": "A 2017 sepia pen and wash drawing. The work depicts a birch grove in an early spring setting, when remnants of snow still lie on the ground. The monochromatic sepia palette emphasizes the graphic character of the trees and the subtle play of light.",
    "descriptionFr": "Un dessin à la plume et au lavis sépia de 2017. L'œuvre représente un bosquet de bouleaux dans un décor de début de printemps, alors que des restes de neige recouvrent encore le sol. La palette monochrome sépia souligne le caractère graphique des arbres et le jeu subtil de la lumière.",
    "story": "Wiosenne brzozy - rysunek piórkiem, sepią lawowany 2017. Brzozy to wdzięczny temat o każdej porze roku. W tej pracy chciałem uchwycić moment przejścia z zimy do wiosny, wykorzystując technikę lawowania do oddania nastroju i światła.",
    "storyEn": "Spring birches - pen drawing, sepia wash 2017. Birches are a graceful subject in any season. In this work, I wanted to capture the moment of transition from winter to spring, using the wash technique to convey mood and light.",
    "storyFr": "Bouleaux de printemps - dessin à la plume, lavis sépia 2017. Les bouleaux sont un sujet gracieux en toute saison. Dans cette œuvre, j'ai voulu capturer le moment de la transition de l'hiver au printemps, en utilisant la technique du lavis pour transmettre l'ambiance et la lumière.",
    "available": 1
  },
  {
    "id": "2017-droga-z-wierzbami-vi",
    "title": "Droga z wierzbami VI",
    "titleEn": "Road with Willows VI",
    "titleFr": "Route avec des saules VI",
    "year": 2017,
    "imageUrl": "/attached_assets/84.avif",
    "imageUrls": ["/attached_assets/84.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "trees",
      "willows",
      "path",
      "rural",
      "masovia",
      "sketch"
    ],
    "dominantColor": "#997F6F",
    "description": "Szósta wersja z cyklu 'Droga z wierzbami', wykonana techniką rysunku piórkiem lawowanego sepią w 2017 roku. Praca ukazuje ośnieżoną wiejską drogę otoczoną starymi wierzbami. Monochromatyczna paleta i dynamiczna kreska podkreślają surowy, zimowy nastrój.",
    "descriptionEn": "The sixth version from the 'Road with Willows' series, created in 2017 using the sepia pen and wash technique. The work shows a snowy country road surrounded by old willows. The monochromatic palette and dynamic lines emphasize the harsh winter mood.",
    "descriptionFr": "La sixième version de la série 'Route avec des saules', créée en 2017 à la technique de la plume et du lavis sépia. L'œuvre montre un chemin de campagne enneigé entouré de vieux saules. La palette monochrome et les lignes dynamiques soulignent l'ambiance hivernale et austère.",
    "story": "Droga z wierzbami VI - rysunek piórkiem, sepia, lawunek - 2017. Ten motyw jest dla mnie niewyczerpanym źródłem inspiracji. W każdej kolejnej wersji staram się odkryć nowy aspekt tego samego krajobrazu, eksperymentując z kompozycją i kreską.",
    "storyEn": "Road with Willows VI - pen drawing, sepia, wash - 2017. This motif is an inexhaustible source of inspiration for me. in each subsequent version, I try to discover a new aspect of the same landscape, experimenting with composition and line.",
    "storyFr": "Route avec des saules VI - dessin à la plume, sépia, lavis - 2017. Ce motif est une source d'inspiration inépuisable pour moi. Dans chaque version suivante, j'essaie de découvrir un nouvel aspect du même paysage, en expérimentant avec la composition et le trait.",
    "available": 1
  },
  {
    "id": "2017-droga-z-wierzbami-v",
    "title": "Droga z wierzbami V",
    "titleEn": "Road with Willows V",
    "titleFr": "Route avec des saules V",
    "year": 2017,
    "imageUrl": "/attached_assets/85.avif",
    "imageUrls": ["/attached_assets/85.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_piorkiem",
    "substrate": "paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "trees",
      "willows",
      "path",
      "rural",
      "masovia",
      "sketch"
    ],
    "dominantColor": "#A88C5E",
    "description": "Piąta wersja z cyklu 'Droga z wierzbami', wykonana techniką rysunku piórkiem i sepią w 2017 roku. Praca przedstawia aleję wierzb w zimowym, monochromatycznym pejzażu, podkreślając ich graficzny charakter.",
    "descriptionEn": "The fifth version from the 'Road with Willows' series, created in 2017 using the pen and sepia technique. The work depicts an alley of willows in a wintery, monochromatic landscape, emphasizing their graphic character.",
    "descriptionFr": "La cinquième version de la série 'Route avec des saules', créée en 2017 à la technique de la plume et du sépia. L'œuvre dépeint une allée de saules dans un paysage hivernal et monochrome, soulignant leur caractère graphique.",
    "story": "Droga z wierzbami V - rys. piórkiem, sepia 2017. To studium mazowieckich wierzb w zimowej szacie. Sepia jako medium pozwala na uzyskanie ciepłej, nostalgicznej tonacji, idealnej do oddania nastroju tego pejzażu.",
    "storyEn": "Road with Willows V - pen drawing, sepia 2017. This is a study of Masovian willows in their winter attire. Sepia as a medium allows for achieving a warm, nostalgic tone, perfect for conveying the mood of this landscape.",
    "storyFr": "Route avec des saules V - dessin à la plume, sépia 2017. C'est une étude des saules de Mazovie dans leur parure d'hiver. Le sépia comme médium permet d'obtenir une tonalité chaude et nostalgique, parfaite pour transmettre l'ambiance de ce paysage.",
    "available": 1
  },
  {
    "id": "2017-droga-z-wierzbami-iv",
    "title": "Droga z wierzbami IV",
    "titleEn": "Road with Willows IV",
    "titleFr": "Route avec des saules IV",
    "year": 2017,
    "imageUrl": "/attached_assets/86.avif",
    "imageUrls": ["/attached_assets/86.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_piorkiem",
    "substrate": "paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "trees",
      "willows",
      "path",
      "rural",
      "masovia",
      "sketch"
    ],
    "dominantColor": "#9D7F63",
    "description": "Czwarta wersja z cyklu 'Droga z wierzbami', wykonana techniką rysunku piórkiem i sepią w 2017 roku. Ciepła, monochromatyczna paleta barw podkreśla graficzny charakter starych wierzb i zimowy nastrój pejzażu.",
    "descriptionEn": "The fourth version from the 'Road with Willows' series, created in 2017 using the pen and sepia technique. The warm, monochromatic color palette emphasizes the graphic character of the old willows and the winter mood of the landscape.",
    "descriptionFr": "La quatrième version de la série 'Route avec des saules', créée en 2017 à la technique de la plume et du sépia. La palette de couleurs chaudes et monochromes souligne le caractère graphique des vieux saules et l'ambiance hivernale du paysage.",
    "story": "Droga z wierzbami IV - rys. piórkiem, sepia 2017. Kontynuacja mojego ulubionego motywu, tym razem w cieplejszej tonacji sepii, która nadaje scenie nostalgicznego charakteru.",
    "storyEn": "Road with Willows IV - pen drawing, sepia 2017. A continuation of my favorite motif, this time in a warmer sepia tone, which gives the scene a nostalgic character.",
    "storyFr": "Route avec des saules IV - dessin à la plume, sépia 2017. Une continuation de mon motif préféré, cette fois dans un ton sépia plus chaud, qui donne à la scène un caractère nostalgique.",
    "available": 1
  },
  {
    "id": "2017-droga-z-wierzbami-vii",
    "title": "Droga z wierzbami VII",
    "titleEn": "Road with Willows VII",
    "titleFr": "Route avec des saules VII",
    "year": 2017,
    "imageUrl": "/attached_assets/87.avif",
    "imageUrls": ["/attached_assets/87.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "landscape",
      "winter",
      "trees",
      "willows",
      "path",
      "rural",
      "masovia",
      "sketch"
    ],
    "dominantColor": "#A98B63",
    "description": "Siódma odsłona cyklu 'Droga z wierzbami', wykonana w technice rysunku piórkiem lawowanego sepią w 2017 roku. Praca charakteryzuje się dynamiczną kompozycją i swobodną kreską, która oddaje organiczne kształty starych drzew i surowość zimowego pejzażu.",
    "descriptionEn": "The seventh installment of the 'Road with Willows' series, created in 2017 using the sepia pen and wash technique. The work is characterized by a dynamic composition and a free-flowing line that captures the organic shapes of the old trees and the starkness of the winter landscape.",
    "descriptionFr": "Le septième volet de la série 'Route avec des saules', réalisé en 2017 à la technique de la plume et du lavis sépia. L'œuvre se caractérise par une composition dynamique et un trait libre qui capture les formes organiques des vieux arbres et l'austérité du paysage hivernal.",
    "story": "To kolejne studium z mojego ulubionego cyklu mazowieckich pejzaży. Zmieniające się światło i pory roku sprawiają, że te same wierzby za każdym razem wyglądają inaczej, oferując nieskończone możliwości interpretacji artystycznej.",
    "storyEn": "This is another study from my favorite series of Masovian landscapes. The changing light and seasons make the same willows look different each time, offering endless possibilities for artistic interpretation.",
    "storyFr": "Ceci est une autre étude de ma série préférée de paysages de Mazovie. La lumière changeante et les saisons font que les mêmes saules ont l'air différents à chaque fois, offrant des possibilités infinies d'interprétation artistique.",
    "available": 1
  },
  {
    "id": "2017-widok-fara-walowa",
    "title": "Widok na Farę z ul. Wałowej",
    "titleEn": "View of the Parish Church from Wałowa Street",
    "titleFr": "Vue de l'église paroissiale depuis la rue Wałowa",
    "year": 2017,
    "imageUrl": "/attached_assets/88.avif",
    "imageUrls": ["/attached_assets/88.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "rysunek_lawowany",
    "substrate": "paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "sacred_art",
      "church",
      "sketch",
      "old_town",
      "walowa_street",
      "masovia"
    ],
    "dominantColor": "#B89684",
    "description": "Rysunek piórkiem lawowany sepią z 2017 roku, przedstawiający perspektywę ulicy Wałowej w Radomiu z widokiem na wieżę Fary. Praca oddaje architektoniczne detale i historyczny klimat miasta w ciepłej, monochromatycznej tonacji.",
    "descriptionEn": "A 2017 sepia pen and wash drawing, showing a perspective of Wałowa Street in Radom with a view of the Parish Church tower. The work captures architectural details and the historical atmosphere of the city in a warm, monochromatic tone.",
    "descriptionFr": "Un dessin à la plume et au lavis sépia de 2017, montrant une perspective de la rue Wałowa à Radom avec vue sur la tour de l'église paroissiale. L'œuvre capture les détails architecturaux et l'atmosphère historique de la ville dans une tonalité chaude et monochrome.",
    "story": "Widok na Farę z ul. Wałowej - piórko, sepia 2017. Ulica Wałowa, prowadząca do najstarszej części Radomia, ma w sobie niezwykły urok. Ten rysunek jest próbą uchwycenia tego nastroju, z grą światła i cienia na bruku i fasadach starych kamienic.",
    "storyEn": "View of the Parish Church from Wałowa Street - pen, sepia 2017. Wałowa Street, leading to the oldest part of Radom, has a unique charm. This drawing is an attempt to capture that mood, with the play of light and shadow on the cobblestones and the facades of the old tenement houses.",
    "storyFr": "Vue de l'église paroissiale depuis la rue Wałowa - plume, sépia 2017. La rue Wałowa, menant à la partie la plus ancienne de Radom, a un charme unique. Ce dessin est une tentative de capturer cette ambiance, avec le jeu de la lumière et de l'ombre sur les pavés et les façades des anciennes maisons de location.",
    "available": 1
  },
  {
    "id": "2016-widok-z-balkonu-piwnika",
    "title": "Widok z balkonu na ul. Piwnika",
    "titleEn": "View from the balcony on Piwnika Street",
    "titleFr": "Vue du balcon sur la rue Piwnika",
    "year": 2016,
    "imageUrl": "/attached_assets/89.avif",
    "imageUrls": ["/attached_assets/89.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "węgiel",
    "substrate": "paper",
    "tags": [
      "radom",
      "hometown",
      "city",
      "architecture",
      "sketch",
      "piwnika_street"
    ],
    "dominantColor": "#A9A9A9",
    "description": "Szkic węglem z 2016 roku, przedstawiający widok z balkonu artysty na ulicę Piwnika w Radomiu. Praca charakteryzuje się miękką, malarską kreską, typową dla techniki węgla, która oddaje atmosferę i architekturę miejskiego pejzażu.",
    "descriptionEn": "A 2016 charcoal sketch, depicting the view from the artist's balcony onto Piwnika Street in Radom. The work is characterized by a soft, painterly line, typical of the charcoal technique, which conveys the atmosphere and architecture of the urban landscape.",
    "descriptionFr": "Un croquis au fusain de 2016, représentant la vue depuis le balcon de l'artiste sur la rue Piwnika à Radom. L'œuvre se caractérise par un trait doux et pictural, typique de la technique du fusain, qui transmet l'atmosphère et l'architecture du paysage urbain.",
    "story": "Widok z balkonu na ul. Piwnika - szkic węglem - Radom 2016. Czasem inspirację można znaleźć tuż za oknem. To widok, który towarzyszył mi na co dzień, uchwycony w technice węgla, która doskonale nadaje się do studiowania światłocienia.",
    "storyEn": "View from the balcony on Piwnika Street - charcoal sketch - Radom 2016. Sometimes inspiration can be found right outside the window. This is a view that accompanied me every day, captured in the charcoal technique, which is perfectly suited for studying chiaroscuro.",
    "storyFr": "Vue du balcon sur la rue Piwnika - croquis au fusain - Radom 2016. Parfois, l'inspiration se trouve juste devant la fenêtre. C'est une vue qui m'accompagnait au quotidien, capturée avec la technique du fusain, qui se prête parfaitement à l'étude du clair-obscur.",
    "available": 1
  },
  {
    "id": "2021-gospodarstwo-miniatura",
    "title": "Gospodarstwo",
    "titleEn": "Farmstead",
    "titleFr": "Ferme",
    "year": 2021,
    "imageUrl": "/attached_assets/90.avif",
    "imageUrls": ["/attached_assets/90.avif"],
    "dimensions": "20,5 x 11,5 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "rural", "cottage", "architecture", "miniature"],
    "dominantColor": "#A5A876",
    "description": "Miniaturowa akwarela z 2021 roku, przedstawiająca wiejskie gospodarstwo z chałupami krytymi strzechą. Praca o wymiarach 20,5 x 11,5 cm została namalowana na papierze Canson (200 g/m²).",
    "descriptionEn": "A miniature watercolor from 2021, depicting a rural farmstead with thatched-roof cottages. The work, measuring 20.5 x 11.5 cm, was painted on Canson paper (200 g/m²).",
    "descriptionFr": "Aquarelle miniature de 2021, représentant une ferme rurale avec des chaumières au toit de chaume. L'œuvre, mesurant 20,5 x 11,5 cm, a été peinte sur papier Canson (200 g/m²).",
    "story": "Ta miniatura to powrót do sielskich, wiejskich krajobrazów, które zawsze mnie inspirowały. Mały format pozwala na uchwycenie ulotnego wrażenia i atmosfery miejsca w skondensowanej formie.",
    "storyEn": "This miniature is a return to the idyllic, rural landscapes that have always inspired me. The small format allows for capturing the fleeting impression and atmosphere of a place in a condensed form.",
    "storyFr": "Cette miniature est un retour aux paysages ruraux et idylliques qui m'ont toujours inspiré. Le petit format permet de capturer l'impression fugitive et l'atmosphère d'un lieu sous une forme condensée.",
    "available": 1
  },
  {
    "id": "2010-jesienny-las-puszcza-kozienicka",
    "title": "Jesienny las",
    "titleEn": "Autumn Forest",
    "titleFr": "Forêt d'automne",
    "year": 2010,
    "imageUrl": "/attached_assets/91.avif",
    "imageUrls": ["/attached_assets/91.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "nature",
      "forest",
      "trees",
      "autumn",
      "light",
      "shadow",
      "puszcza_kozienicka",
      "dabrowa_kozlowska"
    ],
    "dominantColor": "#8B4513",
    "description": "Akwarela z 2010 roku przedstawiająca jesienny pejzaż z Puszczy Kozienickiej, z okolic Dąbrowy Kozłowskiej. Obraz ukazuje wnętrze lasu z powalonymi pniami i plamami ciepłych, jesiennych barw.",
    "descriptionEn": "A 2010 watercolor depicting an autumn landscape from the Kozienice Forest, near Dąbrowa Kozłowska. The painting shows the forest interior with fallen trunks and patches of warm, autumn colors.",
    "descriptionFr": "Aquarelle de 2010 représentant un paysage d'automne de la forêt de Kozienice, près de Dąbrowa Kozłowska. La peinture montre l'intérieur de la forêt avec des troncs tombés et des taches de couleurs chaudes d'automne.",
    "story": "Puszcza Kozienicka jesienią to prawdziwy festiwal barw. W tej pracy chciałem uchwycić kontrast między chłodnym, wilgotnym cieniem sosen a ognistymi plamami opadłych liści. To pejzaż o przemijaniu i naturalnym cyklu życia w lesie.",
    "storyEn": "The Kozienice Forest in autumn is a true festival of colors. In this work, I wanted to capture the contrast between the cool, damp shade of the pine trees and the fiery patches of fallen leaves. It is a landscape about transience and the natural cycle of life in the forest.",
    "storyFr": "La forêt de Kozienice en automne est un véritable festival de couleurs. Dans cette œuvre, j'ai voulu capturer le contraste entre l'ombre fraîche et humide des pins et les taches flamboyantes des feuilles mortes. C'est un paysage sur le caractère éphémère et le cycle naturel de la vie dans la forêt.",
    "available": 1
  },
  {
    "id": "1974-rysunek-jaroslaw-zasanie",
    "title": "Rysunek z pleneru w Jarosławiu",
    "titleEn": "Plein Air Drawing from Jarosław",
    "titleFr": "Dessin en Plein Air de Jarosław",
    "year": 1974,
    "imageUrl": "/attached_assets/92.avif",
    "imageUrls": ["/attached_assets/92.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "węgiel",
    "substrate": "paper",
    "tags": [
      "landscape",
      "architecture",
      "rural",
      "cottage",
      "ruins",
      "jaroslaw",
      "sketch",
      "plein_air"
    ],
    "dominantColor": "#BDBDBD",
    "description": "Rysunek węglem z 1974 roku, wykonany podczas pleneru w Jarosławiu. Praca przedstawia starą, zniszczoną chałupę w dzielnicy Zasanie, będąc studium formy i światłocienia.",
    "descriptionEn": "A 1974 charcoal drawing made during a plein-air session in Jarosław. The work depicts an old, ruined cottage in the Zasanie district, serving as a study of form and chiaroscuro.",
    "descriptionFr": "Dessin au fusain de 1974, réalisé lors d'une séance de plein air à Jarosław. L'œuvre représente une vieille chaumière en ruine dans le quartier de Zasanie, servant d'étude de la forme et du clair-obscur.",
    "story": "To jeden z moich najwcześniejszych szkiców plenerowych. Już wtedy fascynowała mnie niszczejąca architektura, która opowiada historie minionych lat. Węgiel, jako technika, pozwolił mi uchwycić surowy charakter i dramatyzm tej sceny.",
    "storyEn": "This is one of my earliest plein-air sketches. Even then, I was fascinated by decaying architecture that tells stories of bygone years. Charcoal, as a technique, allowed me to capture the raw character and drama of this scene.",
    "storyFr": "C'est l'un de mes premiers croquis en plein air. Déjà à l'époque, j'étais fasciné par l'architecture en décomposition qui raconte des histoires des années passées. Le fusain, en tant que technique, m'a permis de capturer le caractère brut et le drame de cette scène.",
    "available": 1
  },
  {
    "id": "2015-arab",
    "title": "Arab",
    "titleEn": "Arabian Horse",
    "titleFr": "Cheval Arabe",
    "year": 2015,
    "imageUrl": "/attached_assets/93.avif",
    "imageUrls": ["/attached_assets/93.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["animals", "horses", "nature", "study", "arabian_horse"],
    "dominantColor": "#A0522D",
    "description": "Akwarela z 2015 roku przedstawiająca szlachetnego konia arabskiego w ruchu. Artysta uchwycił jego elegancką sylwetkę i grę światła na mięśniach na tle barwnego, uproszczonego pejzażu.",
    "descriptionEn": "A 2015 watercolor depicting a noble Arabian horse in motion. The artist has captured its elegant silhouette and the play of light on its muscles against a vibrant, simplified landscape.",
    "descriptionFr": "Aquarelle de 2015 représentant un noble cheval arabe en mouvement. L'artiste a capturé sa silhouette élégante et le jeu de la lumière sur ses muscles sur fond d'un paysage coloré et simplifié.",
    "story": "Konie od zawsze były dla mnie źródłem inspiracji, a w szczególności araby z ich wyjątkową gracją i ogniem. Ta niewielka akwarela to próba uchwycenia elegancji ruchu i szlachetnej sylwetki tego wspaniałego zwierzęcia.",
    "storyEn": "Horses have always been a source of inspiration for me, especially Arabians with their unique grace and fire. This small watercolor is an attempt to capture the elegance of movement and the noble silhouette of this magnificent animal.",
    "storyFr": "Les chevaux ont toujours été une source d'inspiration pour moi, en particulier les pur-sang arabes avec leur grâce et leur fougue uniques. Cette petite aquarelle est une tentative de capturer l'élégance du mouvement et la noble silhouette de ce magnifique animal.",
    "available": 1
  },
  {
    "id": "2015-pejzaz-z-promieniami-slonca",
    "title": "Pejzaż z promieniami słońca",
    "titleEn": "Landscape with Sunbeams",
    "titleFr": "Paysage avec des rayons de soleil",
    "year": 2015,
    "imageUrl": "/attached_assets/94.avif",
    "imageUrls": ["/attached_assets/94.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": ["landscape", "sky", "clouds", "light", "sunbeams", "nature"],
    "dominantColor": "#87CEEB",
    "description": "Akwarela z 2015 roku przedstawiająca rozległy pejzaż z dramatycznym, pochmurnym niebem. Głównym motywem obrazu są promienie słońca, które przebijają się przez chmury, tworząc na horyzoncie świetliste smugi.",
    "descriptionEn": "A 2015 watercolor depicting a vast landscape with a dramatic, cloudy sky. The main motif of the painting is the sunbeams breaking through the clouds, creating luminous streaks on the horizon.",
    "descriptionFr": "Aquarelle de 2015 représentant un vaste paysage avec un ciel dramatique et nuageux. Le motif principal du tableau est constitué par les rayons du soleil qui percent les nuages, créant des traînées lumineuses à l'horizon.",
    "story": "Ta praca to jedna z moich 'zabaw z pejzażem', próba uchwycenia ulotnego zjawiska, jakim są promienie słońca przebijające się przez chmury. To studium światła i atmosfery w krajobrazie.",
    "storyEn": "This work is one of my 'plays with landscape,' an attempt to capture the fleeting phenomenon of sunbeams breaking through the clouds. It is a study of light and atmosphere in the landscape.",
    "storyFr": "Cette œuvre est l'un de mes 'jeux avec le paysage', une tentative de capturer le phénomène fugace des rayons du soleil perçant les nuages. C'est une étude de la lumière et de l'atmosphère dans le paysage.",
    "available": 1
  },
  {
    "id": "2015-kosciol-jana-chrzciciela-kredki",
    "title": "Kościół św. Jana Chrzciciela",
    "titleEn": "St. John the Baptist Church",
    "titleFr": "Église Saint-Jean-Baptiste",
    "year": 2015,
    "imageUrl": "/attached_assets/95.avif",
    "imageUrls": ["/attached_assets/95.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "kredki_akwarelowe",
    "substrate": "watercolor_paper",
    "tags": [
      "architecture",
      "sacred_art",
      "church",
      "gothic",
      "summer",
      "trees",
      "experiment",
      "radom",
      "hometown",
      "parish_church"
    ],
    "dominantColor": "#76A96A",
    "description": "Akwarela z 2015 roku przedstawiająca kościół farny św. Jana Chrzciciela w Radomiu. Praca jest pierwszym eksperymentem artysty z techniką kredek akwarelowych, co nadaje jej unikalną fakturę i charakter.",
    "descriptionEn": "A 2015 watercolor depicting the Parish Church of St. John the Baptist in Radom. The work is the artist's first experiment with the watercolor pencil technique, which gives it a unique texture and character.",
    "descriptionFr": "Aquarelle de 2015 représentant l'église paroissiale Saint-Jean-Baptiste à Radom. L'œuvre est la première expérience de l'artiste avec la technique des crayons aquarellables, ce qui lui confère une texture et un caractère uniques.",
    "story": "To była moja pierwsza próba zmierzenia się z kredkami akwarelowymi. Chciałem zobaczyć, jakie efekty można uzyskać, łącząc precyzję rysunku kredką z malarskością akwareli. Kościół farny w Radomiu, ze swoją bogatą fakturą i kolorystyką, był idealnym modelem do tego eksperymentu.",
    "storyEn": "This was my first attempt at working with watercolor pencils. I wanted to see what effects could be achieved by combining the precision of a pencil drawing with the painterly quality of watercolor. The parish church in Radom, with its rich texture and colors, was the perfect model for this experiment.",
    "storyFr": "C'était ma première tentative de travailler avec des crayons aquarellables. Je voulais voir quels effets pouvaient être obtenus en combinant la précision du dessin au crayon avec la qualité picturale de l'aquarelle. L'église paroissiale de Radom, avec sa texture et ses couleurs riches, était le modèle parfait pour cette expérience.",
    "available": 1
  },
  {
    "id": "1974-rysunek-modelki-ognisko",
    "title": "Rysunek modelki",
    "titleEn": "Model Drawing",
    "titleFr": "Dessin de modèle",
    "year": 1974,
    "imageUrl": "/attached_assets/96.avif",
    "imageUrls": ["/attached_assets/96.avif"],
    "dimensions": "40 x 30 cm",
    "technique": "ołówek",
    "substrate": "paper",
    "tags": ["portrait", "study", "sketch", "radom", "hometown", "pencil"],
    "dominantColor": "#8B8589",
    "description": "Szkic postaci wykonany ołówkiem w Państwowym Ognisku Plastycznym w Radomiu w 1974 roku. Praca jest studium ludzkiej anatomii i nastroju, oddając chwilę zadumy modelki.",
    "descriptionEn": "A figure sketch made with pencil at the State Art Center in Radom in 1974. The work is a study of human anatomy and mood, capturing a moment of the model's contemplation.",
    "descriptionFr": "Croquis de figure réalisé au crayon au Centre d'Art de l'État à Radom en 1974. L'œuvre est une étude de l'anatomie humaine et de l'ambiance, capturant un moment de contemplation du modèle.",
    "story": "Zajęcia z rysunku postaci w Ognisku Plastycznym były fundamentem mojej artystycznej edukacji. To tam, pod okiem wspaniałych pedagogów, uczyłem się anatomii, proporcji i gry światłocienia. Ten szkic to zapis jednej z takich lekcji - próba uchwycenia nie tylko formy, ale i cichej, skupionej atmosfery panującej w pracowni.",
    "storyEn": "Figure drawing classes at the Art Center were the foundation of my artistic education. It was there, under the guidance of wonderful teachers, that I learned anatomy, proportion, and the play of light and shadow. This sketch is a record of one such lesson—an attempt to capture not only the form but also the quiet, focused atmosphere of the studio.",
    "storyFr": "Les cours de dessin de modèle au Centre d'Art ont été le fondement de mon éducation artistique. C'est là, sous la direction de merveilleux professeurs, que j'ai appris l'anatomie, les proportions et le jeu de la lumière et de l'ombre. Ce croquis est le témoignage d'une de ces leçons - une tentative de capturer non seulement la forme, mais aussi l'atmosphère calme et concentrée de l'atelier.",
    "available": 1
  },
  {
    "id": "2014-krzyz-bryzgow",
    "title": "Krzyż z 1846 roku w Bryzgowie",
    "titleEn": "Cross from 1846 in Bryzgów",
    "titleFr": "Croix de 1846 à Bryzgów",
    "year": 2014,
    "imageUrl": "/attached_assets/97.avif",
    "imageUrls": ["/attached_assets/97.avif"],
    "dimensions": "50 x 40 cm",
    "technique": "akwarela",
    "substrate": "watercolor_paper",
    "tags": [
      "landscape",
      "winter",
      "snow",
      "forest",
      "trees",
      "sacred_art",
      "cross",
      "historical",
      "light",
      "shadow"
    ],
    "dominantColor": "#B08A63",
    "description": "Akwarela z 2014 roku przedstawiająca zabytkowy krzyż z 1846 roku, usytuowany w zimowej, leśnej scenerii w miejscowości Bryzgów. Artysta uchwycił grę światła i cienia na śniegu, oddając surowy i zarazem spokojny nastrój tego miejsca. Charakterystyczny symbol trupiej czaszki u podstawy krzyża dodaje scenie historycznej głębi.",
    "descriptionEn": "A 2014 watercolor depicting the historic cross from 1846, situated in a wintery forest setting in Bryzgów. The artist captured the play of light and shadow on the snow, conveying the stark yet peaceful atmosphere of the location. The characteristic skull and crossbones symbol at the base of the cross adds historical depth to the scene.",
    "descriptionFr": "Aquarelle de 2014 représentant la croix historique de 1846, située dans un décor forestier hivernal à Bryzgów. L'artiste a capturé le jeu de la lumière et de l'ombre sur la neige, transmettant l'atmosphère à la fois austère et paisible du lieu. Le symbole caractéristique de la tête de mort à la base de la croix ajoute une profondeur historique à la scène.",
    "story": "Bryzgów i jego okolice kryją wiele takich historycznych pamiątek. Ten krzyż, naznaczony czasem i historią, stanowił niezwykle malowniczy obiekt w zimowym pejzażu. Chciałem uchwycić jego samotność i ciszę, która go otaczała, a także grę chłodnego, zimowego światła na starym kamieniu i śniegu.",
    "storyEn": "Bryzgów and its surroundings hide many such historical mementos. This cross, marked by time and history, was an incredibly picturesque subject in the winter landscape. I wanted to capture its solitude and the silence that surrounded it, as well as the play of the cold winter light on the old stone and snow.",
    "storyFr": "Bryzgów et ses environs cachent de nombreux souvenirs historiques de ce type. Cette croix, marquée par le temps et l'histoire, était un sujet incroyablement pittoresque dans le paysage hivernal. J'ai voulu capturer sa solitude et le silence qui l'entourait, ainsi que le jeu de la froide lumière d'hiver sur la vieille pierre et la neige.",
    "available": 1
  },
  {
    "id": "2013-osty-monotypia",
    "title": "Osty",
    "titleEn": "Thistles",
    "titleFr": "Chardons",
    "year": 2013,
    "imageUrl": "/attached_assets/98.avif",
    "imageUrls": ["/attached_assets/98.avif"],
    "dimensions": "30 x 21 cm",
    "technique": "monotypia",
    "substrate": "paper",
    "tags": ["nature", "flowers", "study", "experiment", "thistles"],
    "dominantColor": "#595959",
    "description": "Monotypia z 2013 roku przedstawiająca kompozycję z ostami. Praca charakteryzuje się surową, ekspresyjną kreską i silnym kontrastem, typowym dla tej techniki graficznej.",
    "descriptionEn": "A 2013 monotype depicting a composition with thistles. The work is characterized by a raw, expressive line and strong contrast, typical of this graphic technique.",
    "descriptionFr": "Monotype de 2013 représentant une composition de chardons. L'œuvre se caractérise par un trait brut et expressif et un fort contraste, typiques de cette technique graphique.",
    "story": "Monotypia to fascynująca technika graficzna, która pozwala na uzyskanie unikalnej, jednorazowej odbitki. W tej pracy chciałem zbadać możliwości, jakie daje, aby oddać surowy i 'kolczasty' charakter ostów. To eksperyment z formą i fakturą.",
    "storyEn": "Monotype is a fascinating graphic technique that allows for a unique, one-of-a-kind print. In this work, I wanted to explore its possibilities to convey the raw and 'prickly' character of thistles. It is an experiment with form and texture.",
    "storyFr": "La monotypie est une technique graphique fascinante qui permet d'obtenir une estampe unique. Dans cette œuvre, j'ai voulu explorer ses possibilités pour traduire le caractère brut et 'piquant' des chardons. C'est une expérimentation sur la forme et la texture.",
    "available": 1
  }
]
